// Рекомендуется редактировать через специальный редактор https://fastcode.im/Store/8815
//@script_version 98
//@script_appid 8552
//@script_name ИРАдаптер
//@script_display_name ИРАдаптер
//@script_description Адаптер для подсистемы "Инструменты разработчика Tormozit"
//@script_author Tormozit
//@script_developer_url http://devtool1c.ucoz.ru/
//@script_url https://fastcode.im/Store/8552
//@script_section Редактирование
//@turbomenuitem ИР адаптер
//
//@script_hotkey None            ЗапуститьТолстыйКлиент Запустить толстый клиент 
//@script_hotkey Control+Shift+Q ЗакрытьПриложениеИР Закрыть приложение ИР
//@script_hotkey None            ОбновитьКэшМодулей Обновить кэш модулей
//@script_hotkey None            РазрешитьЗапретитьИР Разрешить или запретить ИР
//@script_hotkey None            СброситьНастройкиАдаптераБазы Сбросить настройки адаптера базы
//@script_hotkey None            СообщитьОПроблеме Сообщить о проблеме
//@script_hotkey None            СписокОбщихМетодов Список общих методов
//@script_hotkey None            ---- Контекстные команды ----
//@script_hotkey None            АнализЗамера Анализ замера производительности   
//@script_hotkey Control+OemPlus ВернутьсяИзПереходаИР Вернуться из перехода в модуле
//@script_hotkey Shift+Alt+F9    ВычислитьВыражение Вычислить выражение
//@script_hotkey None            ДеревоВызововМетода Дерево вызовов метода
//@script_hotkey Control+Alt+C   ЗапомнитьДляСравнения Запомнить для сравнения
//@script_hotkey Control+M       КонструкторМетода Конструктор метода
//@script_hotkey Control+F11     КопироватьСсылку Копировать ссылку
//@script_hotkey None            НайтиПоследнююПравкуВГите Найти последнюю правку в Гите
//@script_hotkey None            НайтиПоследнююПравкуВХранилище Найти последнюю правку в хранилище
//@script_hotkey None            НайтиВОкнах Найти в окнах
//@script_hotkey Control+Alt+F12 НайтиВМодулях Найти в модулях
//@script_hotkey Alt+F           НайтиВСписке Найти в списке
//@script_hotkey Control+Alt+D   ОбъявитьТипВыражения Объявить тип выражения
//@script_hotkey Alt+Q           ОткрытьОбъектМетаданных Открыть объект метаданных
//@script_hotkey Control+Shift+D ОтладитьОбъект Отладить объект
//@script_hotkey Control+B       ПерейтиВНачалоРодителяВМодуле Перейти в начало родителя
//@script_hotkey None            ПерейтиВПоследниеМетоды Перейти в последние методы
//@script_hotkey Control+F12     ПерейтиКОпределению Перейти к определению
//@script_hotkey None            ПереименоватьСлово Переименовать слово
//@script_hotkey None            ПодпискиНаСобытия Подписки на события
//@script_hotkey Alt+F3          ПоказатьПараметрыМетода Показать параметры метода
//@script_hotkey Alt+F7          ПроверитьМодуль Проверить модуль
//@script_hotkey None            РедактироватьКомпоновку Редактировать компоновку
//@script_hotkey None            РедактироватьТаблицу Редактировать таблицу
//@script_hotkey Control+Shift+E РедактироватьТекст Редактировать текст
//@script_hotkey Alt+Subtract    СвернутьДругиеСтроки Свернуть другие строки
//@script_hotkey Alt+F1          СинтаксПомощникИР Синтакс-помощник ИР по слову
//@script_hotkey None            СписокМетодовМодуля Список методов модуля
//@script_hotkey None            СохранитьМодульВФайл Сохранить модуль в файл
//@script_hotkey Control+Alt+F9  ТочкаОстановаПодробная Точка останова подробная
//@script_hotkey Alt+Shift+F     ФорматироватьТекст Форматировать текст
//@script_hotkey None            ---- Расширение стандартных команд ----
//@script_hotkey Escape          НажатиеEscape Закрыть окно  
//@script_hotkey Alt+F12         НайтиИспользование Найти использование
//@script_hotkey F3              НайтиСледующий Найти следующий
//@script_hotkey Control+F3      НайтиСледующийВыделенный Найти следующий выделенный
//@script_hotkey Control+OemCloseBrackets ПерейтиКГраницеКонструкцииВперед Перейти к границе конструкции вперед
//@script_hotkey Control+OemOpenBrackets ПерейтиКГраницеКонструкцииНазад Перейти к границе конструкции назад
//@script_hotkey Control+F1      СинтаксПомощник Синтакс-помощник по слову

//@_script_hotkey None            Тест Тест
//@_script_hotkey None            АвтодополнениеМодальное Автодополнение модальное
//@_script_hotkey Control+F       _НайтиСтроку Найти строку
//@_script_hotkey Control+Enter   НажатиеCtrlENTER Нажатие Ctrl+Enter

//@retain_clipboard 0
//@enterprise_mode 0
//@hide_actions 0
//@min_api_version 5
//@turbomenu 1 // Отображать команды в меню Турбоменю
//@turbobutton 1 // Отображать команды скрипта в меню Турбокнопки (в текущей строке модуля)
//@AccessIBInfo 1 // ТурбоКонф сам подготовит параметры базы заранее, а не в момент выполнения скрипта
//@RequestDocInfo 0 // ТурбоКонф сам подготовит параметры документа перед каждым вызовом скрипта
//@subscribe МодифицированныеДокументы // ТурбоКонф будет копить измененные документы, которые можно получать методом ПолучитьМодифицированныеДокументы()

// Фиктивная кнопка нужна для обхода ошибки Турбоконф https://turboconf.ru/Tasks/9909#34d463d59005445fabb3652780151762
//@_button {'Name': 'Пустышка', 'Text': '', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-190,50', 'Width': 1, 'Height': 1, 'BackColor': '', 'Filter': '^(ЪЪЪ)$' }
// Окно "Выражение"
//@button {'Name': 'КнопкаОтладитьОбъект', 'Text': 'Отладить', Hint:'Отладить объект из значения текущего свойства или иерархическое логическое выражение в подходящем инструменте. Для запроса с входящими временными таблицами рекомендуется вызывать команду непосредственно в модуле. (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-190,50', 'Width': 60, 'Height': 18, 'BackColor': '', 'Filter': '^Выражение$' }
//@button {'Name': 'КнопкаРедактироватьТекст', 'Text': 'Редактор', Hint:'Редактировать текстовое значение текущего свойства или показать описание ошибки в редакторе текста (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-255,50', 'Width': 60, 'Height': 18, 'BackColor': '', 'Filter': '^Выражение' }
//@button {'Name': 'КнопкаУсловиеОстанова', 'Text': 'Условие', Hint:'Добавить точку останова с условием по текущему значению свойства с закрытием окна. (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-320,50', 'Width': 55, 'Height': 18, 'BackColor': '', 'Filter': '^Выражение$' }
//@button {'Name': 'ВычислитьСвойствоРодителяИзВыражения', 'Text': 'Родитель', Hint:'Вычислить (сделать корнем) родителя или его родителя и активировать в нем текущее свойство (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-380,50', 'Width': 60, 'Height': 18, 'BackColor': '', 'Filter': '^Выражение$' }
//@button {'Name': 'ВключитьВТаблоИзВыражения', 'Text': 'В табло+', Hint:'Добавить выражение в очередь на включение в табло без закрытия окна (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-445,50', 'Width': 55, 'Height': 18, 'BackColor': '', 'Filter': '^Выражение$' }
//@button {'Name': 'ПодробноОкнаВыражение', 'Text': 'Подробно', Hint:'Сформировать структуру родителя с добавлением к непустым свойствам свойств "<ИмяСвойства>_Инфо" с представлением вложенной коллекции с числом ее элементов (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-505,50', 'Width': 60, 'Height': 18, 'BackColor': '', 'Filter': '^Выражение$' }
//@button {'Name': 'СравнитьОбъектыИзВыражения', 'Text': 'Сравнить', Hint:'Запомнить значение текущего свойства для сравнения или сравнить с запомненным (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-570,50', 'Width': 55, 'Height': 18, 'BackColor': '', 'Filter': '^Выражение$' }
//@button {'Name': 'СериализоватьИзВыражения', 'Text': 'XML', Hint:'Сериализовать значение текущего свойства в XML через сериализатор XDTO (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-630,50', 'Width': 30, 'Height': 18, 'BackColor': '', 'Filter': '^Выражение$' }
//@button {'Name': 'КнопкаВыполнитьПроизвольныйКод', 'Text': 'Выполнить код', Hint:'Открыть редактор кода и после нажатия в нем ОК выполнить введенный код. Переменная "Результат" позволяет вернуть значение в окно. (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-5,120', 'Width': 100, 'Height': 20, 'BackColor': '', 'Filter': '^Выражение$' }
//@button {'Name': 'КнопкаПрерватьОтлаживаемыйКод', 'Text': 'Прервать код', Hint:'Будут очищены все локальные переменные и выполнена команда "Шагнуть из". Этого обычно достаточно для вызова ошибки выполнения в отлаживаемом коде. (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-5,150', 'Width': 100, 'Height': 20, 'BackColor': '', 'Filter': '^Выражение$' }
//@button {'Name': 'ВычислитьОписатьПараметрыМетода', 'Text': 'Типы параметров', Hint:'Описать типы параметров выполняемого метода из их значений (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-5,180', 'Width': 100, 'Height': 20, 'BackColor': '', 'Filter': '^Выражение$' }
// Окно "Просмотр значения выражения"
//@button {'Name': 'КнопкаРедактироватьТекст', 'Text': 'Просмотр ИР', Hint:'Открыть просмотр текста в редакторе текста (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-5,35', 'Width': 80, 'Height': 20, 'BackColor': '', 'Filter': '^Просмотр значения выражения' }
// Окно "<Коллекция>"
//@button {'Name': 'КнопкаНайтиЭлементКоллекции', 'Text': 'Список ИР', Hint:'Найти элемент коллекции в расширенном списке. Текущее окно будет переоткрыто. Сериализуемые коллекции также можно исследовать командой ""Отладить"" (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-190,10', 'Width': 80, 'Height': 18, 'BackColor': '', 'Filter': '^(Структура|Соответствие|СписокЗначений|Массив|.*ЭлементыФормы|Колонки|.*ТабличнаяЧасть\\..*\\.|ТаблицаЗначений|.*Коллекци.*|ДанныеФормы)' }
//@button {'Name': 'КнопкаОткрытьЭлементКоллекции', 'Text': 'Открыть ИР', Hint:'Открыть элемент коллекции с активацией свойства колонки (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-280,10', 'Width': 80, 'Height': 18, 'BackColor': '', 'Filter': '^(Структура|Соответствие|СписокЗначений|Массив|.*ЭлементыФормы|Колонки|.*ТабличнаяЧасть\\..*\\.|ТаблицаЗначений|.*Коллекци.*|ДанныеФормы)' }
//@button {'Name': 'ВключитьВТаблоИзКоллекции', 'Text': 'В табло', Hint:'Добавить свойство элемента в очередь на включение в табло без закрытия окна (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-370,10', 'Width': 50, 'Height': 18, 'BackColor': '', 'Filter': '^(Структура|Соответствие|СписокЗначений|Массив|.*ЭлементыФормы|Колонки|.*ТабличнаяЧасть\\..*\\.|ТаблицаЗначений|.*Коллекци.*|ДанныеФормы)' }
//@button {'Name': 'СократитьКоллекциюИзКоллекции', 'Text': 'Сократить', Hint:'Удалить все элементы коллекции кроме текущего (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-430,10', 'Width': 60, 'Height': 18, 'BackColor': '', 'Filter': '^(Структура|Соответствие|СписокЗначений|Массив|.*ЭлементыФормы|Колонки|.*ТабличнаяЧасть\\..*\\.|ТаблицаЗначений|.*Коллекци.*|ДанныеФормы)' }
// Окно "Параметры точки останова"
//@button {'Name': 'КнопкаВставитьУсловиеИзТабло', 'Text': 'Вставить из табло', Hint:'Вставить условие из уже выделенных в табло выражений (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-150,50', 'Width': 100, 'Height': 18, 'BackColor': '', 'Filter': '^Параметры точки останова$' }
// Окно "Динамический список"
//@button {'Name': 'КнопкаРедактироватьТекст', 'Text': 'Редактор ИР', Hint:'Редактировать текст запроса в редакторе текста (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '10,-30', 'Width': 90, 'Height': 18, 'BackColor': '', 'Filter': '^Динамический список' }
// Окно "Тип элемента"
//@button {'Name': 'КнопкаНоваяОбычнаяГруппаВертикальная', 'Text': '|', Hint:'Добавить обычную группу вертикальную (ИР)', 'Image': '', 'Anchor':'RightTop', 'Offset': '-15,5', 'Width': 15, 'Height': 20, 'BackColor': '', 'Filter': '^Тип элемента' }
//@button {'Name': 'КнопкаНоваяОбычнаяГруппаБезОтображенияВертикальная', 'Text': '|', Hint:'Добавить обычную группу без отображения вертикальную (ИР)', 'Image': '', 'Anchor':'RightTop', 'Offset': '-15,25', 'Width': 15, 'Height': 20, 'BackColor': '', 'Filter': '^Тип элемента' }
//@button {'Name': 'КнопкаНоваяОбычнаяГруппаГоризонтальная', 'Text': '-', Hint:'Добавить обычную группу горизонтальную (ИР)', 'Image': '', 'Anchor':'RightTop', 'Offset': '-30,5', 'Width': 15, 'Height': 20, 'BackColor': '', 'Filter': '^Тип элемента' }
//@button {'Name': 'КнопкаНоваяОбычнаяГруппаБезОтображенияГоризонтальная', 'Text': '-', Hint:'Добавить обычную группу без отображения горизонтальную (ИР)', 'Image': '', 'Anchor':'RightTop', 'Offset': '-30,25', 'Width': 15, 'Height': 20, 'BackColor': '', 'Filter': '^Тип элемента' }
// Окно "Конструктор форматной строки"
//@button {'Name': 'КнопкаУстановитьФорматПолнойДаты', 'Text': 'Полная дата', Hint:'Установить формат полной даты фиксированной ширины (ИР)', 'Image': '', 'Anchor':'LeftTop', 'Offset': '130,5', 'Width': 90, 'Height': 20, 'BackColor': '', 'Filter': '^Конструктор форматной строки' }
// Окно "Остановка по ошибке"                                                                                                                                                           
//@button {'Name': 'КнопкаВставитьОшибкуИзБуфера', 'Text': 'Вставить', Hint:'Вставить текст ошибки из буфера обмена и окна сообщений и включить остановку (ИР)', 'Image': '', 'Anchor': 'LeftTop', 'Offset': '170,60', 'Width': 70, 'Height': 18, 'BackColor': '', 'Filter': '^Остановка по ошибке$' }
// Окно "Редактирование типа данных"
//@button {'Name': 'УстановитьФильтрВыбораТипа', 'Text': 'Установить фильтр', Hint:'Установить фильтр. Для команды - из имени родительского объекта. Для реквизита - из слов синонима свойства, для которого выбирается тип (ИР)', 'Image': '', 'Anchor': 'LeftTop', 'Offset': '155,4', 'Width': 110, 'Height': 18, 'BackColor': '', 'Filter': '^Редактирование типа данных$' }
//@button {'Name': 'КнопкаТолькоПомеченные', 'Text': 'Помеченные', Hint:'Открыть список только помеченных типов (ИР)', 'Image': '', 'Anchor': 'LeftTop', 'Offset': '270,4', 'Width': 80, 'Height': 18, 'BackColor': '', 'Filter': '^Редактирование типа данных$' }
//@button {'Name': 'КнопкаВыбратьЕдинственным', 'Text': 'Выбрать один', Hint:'Выбрать текущий тип единственным и закрыть окно (ИР)', 'Image': '', 'Anchor': 'RightBottom', 'Offset': '-150,-32', 'Width': 80, 'Height': 20, 'BackColor': '', 'Filter': '^Редактирование типа данных$' }
// Окно "Предметы отладки"
//@button {'Name': 'ВыбратьИПодключитьПредметОтладки', 'Text': 'Список ИР', Hint:'Выбрать и подключить предмет отладки из расширенного списка (ИР)', 'Image': '', 'Anchor':'LeftTop', 'Offset': '180,10', 'Width': 65, 'Height': 18, 'BackColor': '', 'Filter': '^Предметы отладки$' }
//@button {'Name': 'ОтключитьВсеПредметыОтладки', 'Text': 'Отключить все', Hint:'Отключить все подключенные предметы отладки (ИР)', 'Image': '', 'Anchor':'LeftTop', 'Offset': '250,10', 'Width': 90, 'Height': 18, 'BackColor': '', 'Filter': '^Предметы отладки$' }
//@button {'Name': 'ЗапретитьАвтоподключениеОтладки', 'Text': 'Запретить', Hint:'Снять все флажки автоподключения предметов отладки (ИР)', 'Image': '', 'Anchor':'LeftBottom', 'Offset': '280,-32', 'Width': 70, 'Height': 20, 'BackColor': '', 'Filter': '^Предметы отладки$' }
// Окно "Автоматическое подключение"
//@button {'Name': 'КнопкаЗапрещноВключение', 'Text': 'Флажок запрещен при подключенном приложении ИР', Hint:'Перекрытый флажок нельзя включать при подключенном приложении ИР', 'Image': '', 'Anchor':'LeftTop', 'Offset': '10,22', 'Width': 300, 'Height': 18, 'BackColor': '', 'Filter': '^Автоматическое подключение$' }
// Окно "Точки останова"
//@button {'Name': 'КнопкаНайтиТочкуОстанова', 'Text': 'Список ИР', Hint:'Найти точку останова в расширенном списке и перейти к ее строке в модуле (ИР)', 'Image': '', 'Anchor':'RightTop', 'Offset': '-270,10', 'Width': 70, 'Height': 18, 'BackColor': '', 'Filter': '^Точки останова$' }
//@button {'Name': 'ВставитьТочкиОстановаИзРезультатовПоиска', 'Text': 'Из результатов поиска', Hint:'Вставить точки останова из уже выделенных в результатах поиска строк копируя настройки текущей точки (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-350,10', 'Width': 130, 'Height': 18, 'BackColor': '', 'Filter': '^Точки останова$' }
// Окно "Закладки"
//@button {'Name': 'КнопкаНайтиЗакладку', 'Text': 'Список ИР', Hint:'Найти закладку в расширенном списке и перейти к ее строке в модуле (ИР)', 'Image': '', 'Anchor':'RightTop', 'Offset': '-200,10', 'Width': 70, 'Height': 18, 'BackColor': '', 'Filter': '^Закладки$' }
// Окно "Выбор объекта"
//@button {'Name': 'КнопкаНайтиВСпискеОбъектов', 'Text': 'Список ИР', Hint:'Найти объект в расширенном списке и активировать его строку в родном списке (ИР)', 'Image': '', 'Anchor':'RightTop', 'Offset': '-5,90', 'Width': 80, 'Height': 18, 'BackColor': '', 'Filter': '^Выбор объекта.*' }
//@button {'Name': 'КнопкаТолькоПомеченные', 'Text': 'Помеченные', Hint:'Открыть список только помеченных опций (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-5,115', 'Width': 80, 'Height': 18, 'BackColor': '', 'Filter': '^Выбор объекта.*' }
// Окно "Поиск ссылок"
//@button {'Name': 'КнопкаИскатьСсылки', 'Text': 'Искать ИР', Hint:'Найти ссылки и активировать первую строку. В результатах работает команда "Перейти к определению" (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-5,80', 'Width': 90, 'Height': 18, 'BackColor': '', 'Filter': '^Поиск ссылок' }
//@button {'Name': 'КнопкаИскатьФункциональныеОпции', 'Text': 'Функц. опции', Hint:'Найти ссылки и активировать первую строку функциональной опции. В результатах работает команда "Перейти к определению" (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-5, 105', 'Width': 90, 'Height': 18, 'BackColor': '', 'Filter': '^Поиск ссылок' }
// Окно "Выбор картинки"
//@button {'Name': 'КнопкаНайтиКартинку', 'Text': 'Список ИР', Hint:'Найти картинку в расширенном списке и активировать его строку в родном списке (ИР)', 'Image': '', 'Anchor':'LeftBottom', 'Offset': '210,-103', 'Width': 80, 'Height': 20, 'BackColor': '', 'Filter': '^Выбор картинки' }
// Окно "Отбор по подсистемам"
//@button {'Name': 'НастроитьОтборПоПодсистемам', 'Text': 'Выбрать ИР', Hint:'Выбрать подсистемы в расширенном списке с памятью последних помеченных, но без считывания текущих пометок (ИР)', 'Image': '', 'Anchor':'RightTop', 'Offset': '-5,110', 'Width': 80, 'Height': 18, 'BackColor': '', 'Filter': '^Отбор по подсистемам|Подсистемы$' }
// Окно "Выбор типа данных"
//@button {'Name': 'КнопкаВыборТипаДанных', 'Text': 'Список ИР', Hint:'Выбрать тип из расширенного списка с памятью (ИР)', 'Image': '', 'Anchor':'RightTop', 'Offset': '-5,60', 'Width': 80, 'Height': 18, 'BackColor': '', 'Filter': '^Выбор типа данных$' }
// Окно "Редактирование параметров выбора"
//@button {'Name': 'КнопкаУстановитьТипПараметраВыбора', 'Text': 'Установить тип', Hint:'Установить тип параметру выбора (ИР)', 'Image': '', 'Anchor':'LeftTop', 'Offset': '110,40', 'Width': 110, 'Height': 18, 'BackColor': '', 'Filter': '^Редактирование параметров выбора$' }
// Окно "Сравнение модулей"
//@button {'Name': 'ОткрытьСравнениеВерсийМетода', 'Text': 'Сравнить ИР', Hint:'Сравнить версии метода (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-60,-20', 'Width': 85, 'Height': 18, 'BackColor': '', 'Filter': '^(Настройка объединения|Сравнение) модулей.*' }
// Окно "Различие между"
//@button {'Name': 'ОткрытьСравнениеТекстов', 'Text': 'Сравнить ИР', Hint:'Сравнить тексты (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-60,-20', 'Width': 85, 'Height': 18, 'BackColor': '', 'Filter': '^Различие между.*' }
// Окно "Укажите новое имя (процедуры|функции|переменной)"
//@button {'Name': 'ПереименоватьСлово', 'Text': 'Переименовать ИР', Hint:'Переименовать слово (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '20,-30', 'Width': 120, 'Height': 20, 'BackColor': '', 'Filter': 'Укажите новое имя (процедуры|функции|переменной)' }
// Окно "Укажите имя новой процедуры"
//@button {'Name': 'ВыделитьМетод', 'Text': 'Выделить ИР', Hint:'Выделить метод (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '20,-30', 'Width': 100, 'Height': 20, 'BackColor': '', 'Filter': 'Укажите имя новой процедуры' }
// Окно "Событие"
//@button {'Name': 'ПерейтиКСтрокеМодуляИзСобытия', 'Text': 'Перейти', Hint:'Перейти в модуль из описания ошибки (ИР)', 'Image': '', 'Anchor': 'LeftTop', 'Offset': '15,125', 'Width': 60, 'Height': 20, 'BackColor': '', 'Filter': '^Событие$' }
//@button {'Name': 'ОткрытьПользователяИБ', 'Text': 'Пользователь', Hint:'Открыть пользователя ИБ (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '10,-32', 'Width': 80, 'Height': 20, 'BackColor': '', 'Filter': '^Событие$' }
//@button {'Name': 'ОткрытьОбъектМетаданныхИзСобытия', 'Text': 'Метаданные', Hint:'Найти в дереве конфигурации метаданные (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '100,-32', 'Width': 70, 'Height': 20, 'BackColor': '', 'Filter': '^Событие$' }
//@button {'Name': 'ОтобратьТранзакциюИзСобытия', 'Text': 'Транзакция', Hint:'Установить в журнале отбор по транзакции (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '180,-32', 'Width': 70, 'Height': 20, 'BackColor': '', 'Filter': '^Событие$' }
// Окно "Пользователь"
//@button {'Name': 'РедактироватьПользователя', 'Text': 'Изменить ИР', Hint:'Редактировать пользователя в расширенной форме (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '15,-34', 'Width': 80, 'Height': 20, 'BackColor': '', 'Filter': '^Пользователь$' }
//@button {'Name': 'ОткрытьЖурналПоПользователю', 'Text': 'Журнал', Hint:'Открыть журнал регистрации с отбором по пользователю (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '100,-34', 'Width': 60, 'Height': 20, 'BackColor': '', 'Filter': '^Пользователь$' }
//@button {'Name': 'СброситьПарольПользователю', 'Text': 'Сбросить пароль', Hint:'Включить аутентификацию 1С и сбросить пароль (ИР)', 'Image': '', 'Anchor': 'LeftTop', 'Offset': '200, 5', 'Width': 100, 'Height': 18, 'BackColor': '', 'Filter': '^Пользователь$' }
// Окно "Отбор" журнала регистрации
//@button {'Name': 'УстановитьОтборТолькоОшибки', 'Text': 'Только ошибки', Hint:'Установить отбор "Только ошибки кроме обновления конфигурации БД" и закрыть окно. Исходно все уровни важности должны быть включены. (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '90,-32', 'Width': 90, 'Height': 20, 'BackColor': '', 'Filter': '^Отбор$' }
// Окно "Глобальный поиск по текстам"
//@button {'Name': 'НайтиВМодуляхИзГлобальногоПоиска', 'Text': 'Найти в модулях', Hint:'Открыть расширенный поиск по кэшу модулей (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-6,130', 'Width': 94, 'Height': 20, 'BackColor': '', 'Filter': '^Глобальный поиск по текстам$' }
// Окно "О программе"
//@button {'Name': 'ПоказатьИнфоКонфигуратора', 'Text': 'Инфо процесса', Hint:'Показать расширенную информацию о процессе конфигуратора (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '20,-34', 'Width': 90, 'Height': 20, 'BackColor': '', 'Filter': '^О программе' }
//@button {'Name': 'ПоказатьИнфоИР', 'Text': 'Инфо ИР', Hint:'Показать информацию о подключенном приложении ИР', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '120,-34', 'Width': 60, 'Height': 20, 'BackColor': '', 'Filter': '^О программе' }
// Окно "Перейти по номеру строки"
//@button {'Name': 'ПерейтиПоСсылкеИзБуфераИзМодальногоОкна', 'Text': 'Из буфера', Hint:'Перейти по ссылке из буфера обмена (ИР)', 'Image': '', 'Anchor': 'LeftTop', 'Offset': '10,24', 'Width': 60, 'Height': 20, 'BackColor': '', 'Filter': 'Перейти по номеру строки' }
// Окно "Главное"                            
//@button {'Name': 'ПерейтиПоСсылкеИзБуфера', 'Text': 'Перейти', Hint:'Перейти по ссылке из буфера обмена (ИР)', 'AddToMenu': 'main_menu', 'Anchor': 'RightTop', 'Offset': '0,0', 'Width': 0, 'Height': 0, 'BackColor': '', 'Filter': '0ы8й/'} 
// Окно "Процедуры и функции"
//@button {'Name': 'КнопкаСписокОбщихМетодов', 'Text': 'Общие ИР', Hint:'Список общих методов с параметрами, типами, расширениями (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-5,150', 'Width': 85, 'Height': 18, 'BackColor': '', 'Filter': '^Процедуры и функции$' }
//@button {'Name': 'КнопкаСписокМетодовМодуля', 'Text': 'Список ИР', Hint:'Список методов модуля с параметрами, типами, расширениями (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Offset': '-5,180', 'Width': 85, 'Height': 18, 'BackColor': '', 'Filter': '^Процедуры и функции$' }
//@button {'Name': 'КнопкаПерейтиКОпределению', 'Text': 'Перейти ИР', Hint:'Пробуй более функциональную команду "Перейти к определению" нажатием Ctrl+F12 в модуле (ИР)', 'Image': '', 'Anchor': 'LeftBottom', 'Offset': '10,-30', 'Width': 85, 'Height': 20, 'BackColor': '', 'Filter': '^Объект перехода$' }
// Окно "Процедуры и функции модуля" Турбоконф https://turboconf.ru/Tasks/9925
//@button {'Name': 'КнопкаСписокОбщихМетодов', 'Text': 'Общие ИР', Hint:'Список общих методов с параметрами, типами, расширениями (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Location': '185, 20', 'Width': 60, 'Height': 20, 'AddToForm': 'MethodsForm', 'ParentControl': 'panel1', 'Filter': '0ы8й/' }
//@button {'Name': 'КнопкаСписокМетодовМодуля', 'Text': 'Список ИР', Hint:'Список методов модуля с параметрами, типами, расширениями (ИР)', 'Image': '', 'Anchor': 'RightTop', 'Location': '250, 20', 'Width': 60, 'Height': 20, 'AddToForm': 'MethodsForm', 'ParentControl': 'panel1', 'Filter': '0ы8й/'}
// Окно "Отчет сравнения метаданных"
//@button {'Name': 'СравнитьИОформитьОтчет', 'Text': 'Сравнить ИР', Hint:'Сравнить текстовые отчеты (ИР)', 'Image': '', 'Anchor':'LeftBottom', 'Offset': '10,-31', 'Width': 80, 'Height': 20, 'BackColor': '', 'Filter': '^Отчет сравнения метаданных$' }
// Окно "Навигатор по метаданным" Турбоконф https://turboconf.ru/Tasks/9925
//@_button {'Name': 'КнопкаПерейтиИзНавигатора', 'Text': 'Перейти ИР', Hint:'Перейти к текущему объекту метаданных(ИР)', 'Image': '', 'Anchor': 'RightTop', 'Location': '200, 2', 'Width': 70, 'Height': 20, 'AddToForm': 'JumpToForm', 'ParentControl': 'panel1', 'Filter': '0ы8й/' }

//#Дублировать в файл C:\Portable\TurboConf\user_scripts\RDT.os

// Настройки
Перем ПапкаПортативногоИР;

Перем ТурбоКонф;
Перем МинимальнаяВерсияИР;
Перем МинимальнаяВерсияТурбоКонф;
Перем ВерсияАдаптера;
Перем ЗаголовокКонфигуратора;
Перем ВыделенныйТекст;
Перем ПозицияВТексте; 
Перем НомерСтрокиТекста;
Перем НомерКолонкиТекста;
Перем ТекстМодуля;
Перем ЯзыкПрограммы;
Перем ТипЭлементаИнтерфейса;
Перем ЗаголовокПриложенияИР; 

Функция НазваниеСкрипта()
	Возврат "ИР адаптер " + ВерсияАдаптера;
КонецФункции

Функция НазваниеПриложения()
	Возврат "ИР";
КонецФункции

Функция НазваниеПодсистемы()
	Возврат "Инструменты разработчика Tormozit";
КонецФункции

// Просил добавить в API https://turboconf.ru/Tasks/9025
//  Сохраним историю границ выделения таким замороченным способом. Выделенный диапазон должен быть непустым. На историю переходов не влияет.
//  Полезно вызывать перед вставкой области, которая содержит выделенную пользователем область.
// 
// Возвращаемое значение:
//  Число - разница длин между старым и новым текстом модуля, возникает из-за ошибки платформы - при вставке текста из буфера, начинающегося с первой пустой строки перед ним иногда вставляются пробелы
//
Функция СохранитьГраницыВыделенияДляОтмены()

	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ВыделенныйТекст = "";
	ТекстМодуляДо = ТурбоКонф.ПолучитьТекстМодуля(ВыделенныйТекст, 0); 
	//ТурбоКонф.ВставитьТекст(ВыделенныйТекст); // Так не запоминает в истории
	//ТурбоКонф.ВставитьТекст(ВыделенныйТекст + " ");
	//ТурбоКонф.Клавиша(Клавиши.Back);
	////ТурбоКонф.ВыделитьТекст(Начало, Конец); // Почему то вызывает прокрутку окна чтобы выделенный диапазон стал в самый низ https://turboconf.ru/Tasks/8888
	Если ПустаяСтрока(ВыделенныйТекст) Тогда
		// Если выделенный текст пустой, то вставится текущее содержимое буфера обмена или текущей строки
		Результат = 0;
	Иначе
		ТурбоКонф.КонтролКлавиша(Клавиши.C);
		ТурбоКонф.КонтролКлавиша(Клавиши.V); 
		
		// Ждем завершения операции конфигуратора с буфером обмена
		
		// Способ 1
		ТурбоКонф.Ждать(100);   
		
		// Способ 2
		// Глючит https://turboconf.ru/Tasks/9302
		//ТурбоКонф.КонтролКлавиша(Клавиши.F);
		//ТурбоКонф.ОткрытьЗакрытьОкно("Поиск", 2000);     
		
		ТекстМодуляПосле = ТурбоКонф.ПолучитьТекстМодуля("", 0);
		Результат = СтрДлина(ТекстМодуляПосле) - СтрДлина(ТекстМодуляДо);
	КонецЕсли;
	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала;
	Сообщить("СохранитьГраницыВыделенияДляОтмены " + Длительность + "мс");
	Возврат Результат;
	
КонецФункции

Процедура ОповеститьПользователяОПриостановке(Знач ПодключениеИР = Неопределено)
	Если ПодключениеИР <> Неопределено Тогда
		ПодключениеИР.Visible = Истина;
	КонецЕсли;
	ТурбоКонф.ПоказатьУведомление("Работа TurboConf ПРИОСТАНОВЛЕНА на время диалога с приложением " + НазваниеПриложения(), 3000);
КонецПроцедуры

Процедура ОповеститьПользователяОВозобновлении()
	ТурбоКонф.ПоказатьУведомление("Работа TurboConf ВОЗОБНОВЛЕНА после диалога с приложением " + НазваниеПриложения(), 3000);
	//ТурбоКонф.ПоказатьВсплывающееУведомление("Работа TurboConf ВОЗОБНОВЛЕНА после диалога с приложением", 3000); // Для отладки
КонецПроцедуры

Процедура РедактироватьТекст(Знач ИмяЯзыкаПрограммы = "")
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР); 
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	ЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	Если ЗаголовокОкна = "Выражение" Тогда
		УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
		Выражение = ТурбоКонф.ПолучитьЗначение();
		//ТурбоКонф.УстановитьФокусНаЭлемент("Рассчитать", "кнопка");
		//ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
		//ТурбоКонф.Клавиша(Клавиши.F2);
		Если КликнутьПоЭлементу("Показать значение в отдельном окне", "кнопка") Тогда
			Окно = ТурбоКонф.ЖдатьОкно("Просмотр значения выражения", 500, Ложь);
			Если Окно = 0 Тогда
				Возврат;
			КонецЕсли; 
			Текст = ТурбоКонф.ПолучитьЗначение();
			ЗакрытьМодальноеОкно(); 
		Иначе
			УстановитьФокусВПервуюТаблицуИлиСписок();
			ЯчейкиТекущейСтроки = ЯчейкиТекущейСтроки(3);
			Если ЯчейкиТекущейСтроки.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			Текст = СтрокаБезПоследнегоФрагментаЛкс(ЯчейкиТекущейСтроки[1], " Значение");
		КонецЕсли;
		Текст = ОткрытьРедакторТекста(Текст, Выражение, ИмяЯзыкаПрограммы);
		Если Текст = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ОткрытьОкноУстановкиЗначенияВВидеВыражения();
		ТурбоКонф.ВставитьТекст(МодулиИР.ирОбщий.ТекстВВыражениеВстроенногоЯзыкаЛкс(Текст));
		ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
		УстановитьФокусНаКнопкуСправка();
		ТурбоКонф.Клавиша(Клавиши.Tab);
		РезультатУстановкиЗначения = ТурбоКонф.ПолучитьТекстТекущегоЭлемента();
		Если Найти(РезультатУстановкиЗначения, "Изменение значения выполнено успешно") = 0 Тогда
			Возврат;
		КонецЕсли;
		ТурбоКонф.Клавиша(Клавиши.Escape);
	ИначеЕсли ЗаголовокОкна = "Просмотр значения выражения" Тогда
		ТурбоКонф.УстановитьФокусНаЭлемент("OK", "кнопка"); // английские буквы
		ТурбоКонф.Клавиша(Клавиши.Tab);
		Текст = ТурбоКонф.ПолучитьЗначение();
		ОткрытьРедакторТекста(Текст, Выражение, ИмяЯзыкаПрограммы, Истина);
	Иначе
		Если ЗаголовокОкна = "Динамический список" Тогда
			Если Не ТурбоКонф.УстановитьФокусНаЭлемент("", "документ") Тогда
				Возврат;
			КонецЕсли;
			РазобратьПозициюВТексте();
		КонецЕсли;
		Если Истина
			И ЗаголовокОкна <> "Ввод выражения"
			И ЗаголовокОкна <> "Параметры точки останова"
			И Не ЗначениеЗаполнено(ТекстМодуля)
		Тогда
			ТекстМодуля = "ВЫБРАТЬ -0";
		КонецЕсли;
		ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,,, Ложь);
		Если ПолеТекстаПрограммы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ЯзыкПрограммы = ПолеТекстаПрограммы.ЯзыкПрограммы;
		Значение = Ложь;
		ОповеститьПользователяОПриостановке(ПодключениеИР);
		Окно = ТурбоКонф.ПолучитьАктивноеОкно();
		ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("^Текст.*", 2000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
		// ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх(".*", 2000, Конфигуратор.ГлавноеОкно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
		ПодключениеИР.Visible = Истина;
		Попытка
			Если ЯзыкПрограммы = 0 Тогда
				ПолеТекстаПрограммы.КончитьОбработкуКоманды();
				ПолеТекстаПрограммы.РазобратьТекущийКонтекст();
				Значение = ПолеТекстаПрограммы.ОткрытьРедакторСтроковогоЛитерала();
			Иначе
				ПолеТекстаПрограммы.мЗаменяемыйДиапазон = Неопределено;
				Значение = МодулиИР.ирКлиент.ОткрытьТекстЛкс(ТекстМодуля, "", "", Ложь, Неопределено, Неопределено, Ложь, Истина, ПолеТекстаПрограммы.ПолеТекста.ВыделениеДвумерное());
				ПолеТекстаПрограммы.УстановитьТекст(Значение,,, Истина);
				Значение = Значение <> Неопределено И ТекстМодуля <> Значение;
			КонецЕсли;
		Исключение
			ПоказатьВсплывающееУведомление(ОписаниеОшибки());
		КонецПопытки;
		ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
		Если Значение Тогда
			ТурбоКонф.Ждать(100); // Иначе при закрытии по CTRL+ENTER ПолучитьТекстМодуля() возвращает пусто
			ПередатьИзмененияИзПоляТекстаВОкноМодуля(ПолеТекстаПрограммы);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Функция ОткрытьРедакторТекста(Знач Текст, Знач Заголовок, Знач ИмяЯзыкаПрограммы = "", Знач ТолькоПросмотр = Ложь) Экспорт
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Истина
		И Найти(Текст, Символы.ПС) = 0
		И ПустаяСтрока(ИмяЯзыкаПрограммы)
	Тогда
		ИмяЯзыкаПрограммы = "Обычный";
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР); 
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	ОповеститьПользователяОПриостановке(ПодключениеИР);
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("^Текст.*", 2000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
	Попытка
		Текст = МодулиИР.ирКлиент.ОткрытьТекстЛкс(Текст, Заголовок, ИмяЯзыкаПрограммы, ТолькоПросмотр, Неопределено, Неопределено, Ложь, Истина);
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
		Текст = Неопределено;
	КонецПопытки;
	ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
	Возврат Текст;
КонецФункции

Функция УстановитьФокусНаКнопкуСправка() Экспорт
	Возврат ТурбоКонф.УстановитьФокусНаЭлемент("Справка", "кнопка");
КонецФункции

// Если выделенный фрагмент непустой, то текущая позиция будет сохранена в истории переходов вызовом СохранитьГраницыВыделенияДляОтмены
// Параметры:
//    ПолеТекстаПрограммы - ОбработкаОбъект.ирКлсПолеТекстаПрограммы - 
Процедура ПередатьИзмененияИзПоляТекстаВОкноМодуля(Знач ПолеТекстаПрограммы, Знач ПроверитьНеизменность = Истина, Знач ВесьМодульДляAPI5 = Ложь, Знач ДобавкаПослеМетодаДляAPI5 = "") Экспорт
	
	// Нельзя такую проверку делать, т.к. для поля текста запроса оно всегда истинно
	//Если ПолеТекстаПрограммы.мЗамещающийФрагмент = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	СтароеЗначениеБуфераОбмена = ТурбоКонф.ПолучитьБуферОбмена();
	НовыйТекстМодуляИзКонфигуратора = ТурбоКонф.ПолучитьТекстМодуля(ВыделенныйТекст, 0);
	Если ПроверитьНеизменность Тогда
		Если Истина
			И ЗначениеЗаполнено(НовыйТекстМодуляИзКонфигуратора) 
			И НовыйТекстМодуляИзКонфигуратора <> ТекстМодуля 
		Тогда
			ПолеТекстаПрограммы.мЗамещающийФрагмент = Неопределено;
			ПоказатьВсплывающееУведомление("Текст в окне конфигуратора был изменен с начала редактирования. Вставка не выполнена. Фрагмент помещен в буфер обмена");
			Если ЯзыкПрограммы = 0 Тогда
				ТекстЛитерала = ПолеТекстаПрограммы.ВыделитьТекстовыйЛитерал();
			Иначе
				ТекстЛитерала = ПолеТекстаПрограммы.ПолеТекста.ПолучитьТекст();
			КонецЕсли;
			ТурбоКонф.УстановитьБуферОбмена(ТекстЛитерала);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если Ложь
		Или ТурбоКонф.ПолучитьВерсиюAPI() < 6 
		Или ТурбоКонф.РежимСовместимости()
	Тогда
		Если Истина
			И ЯзыкПрограммы = 0 
			И Не ВесьМодульДляAPI5 
			И ПолеТекстаПрограммы.мМетодМодуля <> Неопределено 
			И ПолеТекстаПрограммы.мКонечнаяСтрока <= ПолеТекстаПрограммы.мНомерПоследнейСтрокиТелаМетода + 1 // для форматирования
		Тогда
			// Заменяем только текущий метод
			ПолеТекстаПрограммы.РазобратьТекущийКонтекст();
			ТекстВставки = ПолеТекстаПрограммы.ОпределениеМетодаБезОписания() + ДобавкаПослеМетодаДляAPI5;
			НачальнаяКолонкаМетода = 1 + СтрДлина(ТекстВставки) - СтрДлина(СокрЛ(ТекстВставки));
			ТекстВставки = СокрЛ(ТекстВставки);
			НомерСтрокиОпределенияМетода = СтрЧислоСтрок(Лев(ТекстМодуля, ПолеТекстаПрограммы.мМетодМодуля.ПозицияОпределения) + "й");
			ПерейтиВПозицию(НачальнаяКолонкаМетода, НомерСтрокиОпределенияМетода); 
			ТурбоКонф.КонтролШифтКлавиша(Клавиши.OemCloseBrackets);
		Иначе
			// Заменяем весь модуль и теряем свертки, точки останова, закладки
			ТекстВставки = ПолеТекстаПрограммы.ПолеТекста.ПолучитьТекст();
			КомандаВыделитьВсе();
			ТурбоКонф.Ждать(200);
		КонецЕсли;
	Иначе
		СмещениеНачала = 0;
		ЗаменяемыйДиапазон = ПолеТекстаПрограммы.мЗаменяемыйДиапазон;
		Если ВыделенныйТекст <> "" Тогда
			СмещениеНачала = СохранитьГраницыВыделенияДляОтмены();
		ИначеЕсли Истина
			И ЗаменяемыйДиапазон <> Неопределено
			И ЗаменяемыйДиапазон.Свойство("НомерСтроки") 
		Тогда
			ТурбоКонф.ПерейтиВПозицию(1, ЗаменяемыйДиапазон.НомерСтроки); // Для сохранения позиции в истории переходов
		КонецЕсли;
		Если ЗаменяемыйДиапазон <> Неопределено Тогда
			ТекстВставки = ПолеТекстаПрограммы.мЗамещающийФрагмент;
			ПолеТекстаПрограммы.мЗамещающийФрагмент = Неопределено;
			ТурбоКонф.ВыделитьТекст(СмещениеНачала + ЗаменяемыйДиапазон.Начало - 1, СмещениеНачала + ЗаменяемыйДиапазон.Конец - 1);
		Иначе
			ТекстВставки = ПолеТекстаПрограммы.ПолеТекста.ПолучитьТекст();
			ТурбоКонф.ВыделитьТекст(0, СтрДлина(ТурбоКонф.ПолучитьТекстТекущегоЭлемента()));
		КонецЕсли;
	КонецЕсли;
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Попытка
		ТурбоКонф.ВставитьТекст(ТекстВставки);
	Исключение
		Если ЛиВФоновомЗадании() Тогда
			// (System.Threading.ThreadStateException): Текущий поток должен быть задан как поток однопоточного контейнера (STA), чтобы вызовы OLE стали возможны. Проверьте, что ваша функция Main помечена атрибутом STAThreadAttribute.}
			ОписаниеОшибки = ОписаниеОшибки();
			Сообщить(ОписаниеОшибки, СтатусСообщения.Внимание);
			ПоказатьВсплывающееУведомление("Вызовите команду ПоказатьПараметрыМетода дважды для перевода окна подсказки в блокирующий режим");
		Иначе
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;
	ДлительностьВставки = ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала;
	Сообщить("Вставка блока " + ДлительностьВставки + "мс");
	Если ДлительностьВставки > 3000 Тогда
		ПоказатьВсплывающееУведомление("Вставка текста в окно конфигуратора замедлилась. Для ускорения рекомендуется перезапустить конфигуратор.");
	КонецЕсли;
	ПередатьГраницыВыделенияИзПолеТекстаПрограммы(ПолеТекстаПрограммы);
	УстановитьБуферОбмена(СтароеЗначениеБуфераОбмена);
КонецПроцедуры

Процедура ПередатьГраницыВыделенияИзПолеТекстаПрограммы(Знач ПолеТекстаПрограммы) Экспорт
	Если Ложь
		Или ТурбоКонф.ПолучитьВерсиюAPI() < 6 
		Или ТурбоКонф.РежимСовместимости()
	Тогда
		ВыделениеДвумерное = ПолеТекстаПрограммы.ПолеТекста.ВыделениеДвумерное();
		ПерейтиВПозицию(ВыделениеДвумерное.НачальнаяКолонка, ВыделениеДвумерное.НачальнаяСтрока);
	Иначе 
		ВыделениеОдномерное = ПолеТекстаПрограммы.ПолеТекста.ВыделениеОдномерное();
		ТурбоКонф.ВыделитьТекст(ВыделениеОдномерное.Начало - 1, ВыделениеОдномерное.Конец - 1);
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьФильтрВыбораТипа() Экспорт
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗакрытьМодальноеОкно();
	ТурбоКонф.Ждать(20);
	ЗначениеТипа = ТурбоКонф.ПолучитьЗначение();
	ЭтоКоманда = Ложь;
	Для СчетчикШагов = 1 По 10 Цикл
		ТурбоКонф.ШифтКлавиша(Клавиши.Tab);  
		ТурбоКонф.Ждать(20);
		ТипЭлементаСвойства = ПолучитьТипТекущегоЭлемента();
		Текст = ТурбоКонф.ПолучитьЗначение();
		Если Найти(Текст, "анель") > 0 Тогда
			ИмяСвойстваПредставления = "Синоним";
			ЭтоКоманда = Истина;
			Прервать; 
		ИначеЕсли Ложь
			Или Текст = "Использовать" 
			Или Текст = "Не использовать" 
		Тогда
			// Реквизит метаданных
			ИмяСвойстваПредставления = "Синоним";
			Прервать; 
		ИначеЕсли Текст = "Не проверять" Тогда
			// Реквизит формы
			ИмяСвойстваПредставления = "Заголовок";
			Прервать; 
		КонецЕсли;
	КонецЦикла; 
	Если ЭтоКоманда Тогда
		ТурбоКонф.Клавиша(Клавиши.Tab);  
		АктивироватьДеревоОсновнойКонфигурации();
		ПолноеИмяМД = СсылкаНаОбъектМДВДеревеКонфигурации(ПодключениеИР);
		ТурбоКонф.АльтКлавиша(Клавиши.Enter);
		НажатьКлавишуЦикл(Клавиши.Tab, 4);
		Фрагменты = СтрРазделитьЛкс(ПолноеИмяМД);
		Если Фрагменты.Количество() < 3 Тогда
			// Общая команда
			Возврат;
		КонецЕсли;
		Текст = Фрагменты[1];
	Иначе
		АктивироватьСвойствоВПалитреСвойств(ИмяСвойстваПредставления);
		Текст = ТурбоКонф.ПолучитьЗначение();
		АктивироватьСвойствоВПалитреСвойств("Тип");
	КонецЕсли;
	ЗначениеТипаНовое = ТурбоКонф.ПолучитьЗначение();
	Если ЗначениеТипаНовое <> ЗначениеТипа Тогда
		Возврат;
	КонецЕсли; 
	Сообщить("ИмяСвойстваПредставления=" + ИмяСвойстваПредставления);
	ТурбоКонф.Клавиша(Клавиши.F4);          
	ТурбоКонф.ЖдатьОкно("Редактирование типа данных", 1000, Ложь);
	ТурбоКонф.КонтролАльтКлавиша(Клавиши.M);
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЭтоКоманда Тогда
		МодулиИР = МодулиИР(ПодключениеИР); 
		Ошибка = "";
		КорниСлов = МодулиИР.ирОбщий.КорниСловЛкс(Текст, Истина,, Ошибка);
		Если ЗначениеЗаполнено(КорниСлов) Тогда
			Текст = КорниСлов;
		КонецЕсли;
	КонецЕсли;
	УстановитьЗначениеПолюВвода(Текст, Ложь, Клавиши.Space);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеПриложения(), "Ошибка запроса корней слов из https://sinonim.org : " + Ошибка);
	КонецЕсли;
КонецПроцедуры

Процедура ВыбратьИзПомеченныхЭлементовСписка() Экспорт
	ТекущийТип = ТурбоКонф.ПолучитьЗначение();
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter); 
	ТурбоКонф.ЖдатьЗакрытияОкна(Окно,, 1000);
	ТурбоКонф.Ждать(50);
	ЗначениеТипа = ТурбоКонф.ПолучитьЗначение();
	ТурбоКонф.Клавиша(Клавиши.F4); 
	СтароеОкно = ТурбоКонф.ПолучитьАктивноеОкно();
	ТурбоКонф.ЖдатьСменуАктивногоОкна(СтароеОкно, 1000, Ложь);
	ИменаПомеченных = СтрРазделитьЛкс(ЗначениеТипа, ",", Истина);
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(ИменаПомеченных);
	Список.СортироватьПоЗначению();
	ИменаПомеченных = Список.ВыгрузитьЗначения();
	Индекс = ВыбратьЭлементСписка(ИменаПомеченных, ТекущийТип,,, "Помеченные элементы");
	Если Индекс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ВыбранноеИмя = ИменаПомеченных[Индекс];
	СвернутьДеревоИПерейтиВНачало();
	АктивироватьСтрокуДерева(ВыбранноеИмя);
	ТурбоКонф.Ждать(100); // Чтобы успела сработать установка фокуса в поле фильтра. Не всегда достаточно 100мс
	УстановитьФокусВПервуюТаблицуИлиСписок();
КонецПроцедуры

Процедура УстановитьТипПараметраВыбора() Экспорт
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЧислоКолонок = 2;
	МодулиИР = МодулиИР(ПодключениеИР); 
	// Для выхода из режима редактирования строки
	НажатьКлавишуЦикл(Клавиши.Tab, ЧислоКолонок); 
	УстановитьФокусВПервуюТаблицуИлиСписок();
	НажатьКлавишуЦикл(Клавиши.Left, 1);
	ИмяПараметраВыбора = СтрокаБезПоследнегоФрагментаЛкс(ТурбоКонф.ПолучитьИмяЭлемента(), " Имя");
	//Сообщить("ИмяПараметраВыбора="+ИмяПараметраВыбора);
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter); 
	ТурбоКонф.ЖдатьЗакрытияОкна(Окно,, 1000); 
	СтароеИмя = ТурбоКонф.ПолучитьИмяЭлемента();
	АктивироватьТекущийОбъектВДеревеКонфигурации(); 
	ТурбоКонф.Ждать(50);
	Если СтароеИмя = ТурбоКонф.ПолучитьИмяЭлемента() Тогда
		// Это реквизит объекта метаданных
		АктивироватьСвойствоВПалитреСвойств("Тип");
		ИмяТипаСсылки = ТурбоКонф.ПолучитьЗначение();
	Иначе
		// Это поле формы
		ТурбоКонф.Клавиша(Клавиши.Enter);
		ТурбоКонф.Клавиша(Клавиши.F12);
		НажатьКлавишуЦикл(Клавиши.Right, 4);
		//ТурбоКонф.Ждать(50);
		ИмяТипаСсылки = СтрокаБезПоследнегоФрагментаЛкс(ТурбоКонф.ПолучитьИмяЭлемента(), " Тип");
		ТурбоКонф.Клавиша(Клавиши.F12);
		ТурбоКонф.Клавиша(Клавиши.Enter);
	КонецЕсли;
	Сообщить("ИмяТипаСсылки="+ИмяТипаСсылки);
	АктивироватьСвойствоВПалитреСвойств("Параметры выбора"); // ПараметрыВыбора - только для поля формы работает 
	ТурбоКонф.Клавиша(Клавиши.F4);
	ТурбоКонф.ЖдатьОкно("Редактирование параметров выбора", 1000, Истина);
	ИмяПоляБД = ПоследнийФрагментЛкс(ИмяПараметраВыбора);
	ИмяТаблицыБД = СтрЗаменить(ИмяТипаСсылки, "Ссылка.", ".");
	ИмяТипаПоля = МодулиИР.ирОбщий.ИмяТипаПоляТаблицыБДЛкс(ИмяТаблицыБД, ИмяПоляБД);
	Если ИмяТипаПоля = Неопределено Тогда
		ПоказатьВсплывающееУведомление(СтрШаблон("Поле (%1) не найдено в таблице БД (%2)", ИмяПоляБД, ИмяТаблицыБД));
		Возврат;
	КонецЕсли;
	УстановитьФокусВПервуюТаблицуИлиСписок();
	Если ТурбоКонф.ПолучитьИмяЭлемента() <> ИмяПараметраВыбора + " Имя" Тогда
		НайтиСтрокуВОкне(ИмяПараметраВыбора,, Истина);
	КонецЕсли;
	НажатьКлавишуЦикл(Клавиши.Right, ЧислоКолонок);
	ТурбоКонф.Клавиша(Клавиши.F2);
	ТурбоКонф.ШифтКлавиша(Клавиши.F4);
	ТурбоКонф.Клавиша(Клавиши.F4);
	ТурбоКонф.ЖдатьОкно("Выбор типа данных", 1000, Истина);
	ТурбоКонф.Ждать(20);
	Сообщить("ИмяТипаПоля="+ ИмяТипаПоля);
	НайтиСтрокуВОкне(ИмяТипаПоля,, Истина);
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter); 
КонецПроцедуры

// Свойство активируется через фильтрацию по подстроке. Поэтому в редких случаях возможна стабильная активная неправильного элемента
Процедура АктивироватьСвойствоВПалитреСвойств(Знач ИмяСвойства, Знач ЧислоПолейШапки = 0, Знач ТребоватьПоле = Ложь) Экспорт
	ТурбоКонф.Клавиша(Клавиши.Home);
	ТурбоКонф.Ждать(20);
	//ТурбоКонф.Клавиша(Клавиши.Subtract); // Иногда он ошибочно считает что группа раскрыта
	//ТурбоКонф.Ждать(20);
	ТурбоКонф.Клавиша(Клавиши.Add);
	ТурбоКонф.Ждать(20);
	//ВызватьИсключение 1;
	ТурбоКонф.КонтролАльтКлавиша(Клавиши.I);
	ТурбоКонф.Ждать(20); 
	// В свойствах общего модуля почему то активным с точки зрения UIAutomation становится поле первого свойства вместо фильтра
	//УстановитьЗначениеПолюВвода(ИмяСвойства,, Клавиши.Space);
	ТурбоКонф.ВставитьТекст(ИмяСвойства);
	//Возврат;

	// На случай нескольких свойств в результате фильтра - всплепую берем верхний. 
	ТурбоКонф.АльтКлавиша(Клавиши.Enter);
	ТурбоКонф.Ждать(20);
	Если ТребоватьПоле Тогда
		Для Сч=1 По 5 Цикл
			ТипТекущегоЭлемента = ПолучитьТипТекущегоЭлемента();
			Если Ложь
				Или ТипТекущегоЭлемента = ТипЭлемента.Поле 
				Или ТипТекущегоЭлемента = ТипЭлемента.ПолеСоСписком
			Тогда
				Прервать;
			КонецЕсли;
			СтарыйИД = ТурбоКонф.ПолучитьRuntimeIdСтрокой();
			ТурбоКонф.Клавиша(Клавиши.Tab);
			Если ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 20, Ложь) = СтарыйИД Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТурбоКонф.КонтролАльтКлавиша(Клавиши.I);
	ТурбоКонф.Ждать(10);
	ТурбоКонф.ШифтКлавиша(Клавиши.F4);
	ТурбоКонф.Ждать(10);
	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	ТурбоКонф.Ждать(10);
	
	// Лечим пропажу фокуса ввода в поле значения свойства
	ТурбоКонф.Клавиша(Клавиши.Up);
	ТурбоКонф.Клавиша(Клавиши.Down);
	ТурбоКонф.Ждать(10);
КонецПроцедуры

Процедура ВыбратьТипДанных() Экспорт
	Если НайтиВСписке() Тогда
		ТурбоКонф.КонтролКлавиша(Клавиши.Enter); 
	КонецЕсли;
КонецПроцедуры

//&ТолькоТекстовыеДокументы
Процедура КонструкторМетода()
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Запрос" Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь,, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОповеститьПользователяОПриостановке(ПодключениеИР);
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("^Конструктор метода.*", 5000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
	Значение = Ложь;
	// ПодключениеИР.Visible = Истина;
	Попытка
		Значение = ПолеТекстаПрограммы.ОткрытьКонструкторМетода();
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
	Если Значение = Ложь Тогда
		Возврат;
	ИначеЕсли Значение = "Ошибка" Тогда
		ВосстановитьОкноПриложения(ПодключениеИР);
	Иначе
		ПередатьИзмененияИзПоляТекстаВОкноМодуля(ПолеТекстаПрограммы,,, Символы.ПС + Символы.ПС + Значение);
	КонецЕсли;
		
КонецПроцедуры

//&ТолькоТекстовыеДокументы
//&ВосстанавливатьБуферОбмена
//&ЗапроситьИнформациюОДокументе
Процедура ФорматироватьТекст()
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь,, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;             
	Если ПолеТекстаПрограммы.ЯзыкПрограммы = 0 Тогда 
		Если Не ЗначениеЗаполнено(ВыделенныйТекст) Тогда
			ПоказатьВсплывающееУведомление("Необходимо выделить блок текста", 2000);
			Возврат;
		КонецЕсли;
		Если ПолеТекстаПрограммы.ФорматироватьТекстВстроенногоЯзыка(Ложь) Тогда
			ПередатьИзмененияИзПоляТекстаВОкноМодуля(ПолеТекстаПрограммы, Ложь, ПолеТекстаПрограммы.мКонечнаяСтрока > ПолеТекстаПрограммы.мНомерПоследнейСтрокиТелаМетода + 1);
		КонецЕсли;
	ИначеЕсли ПолеТекстаПрограммы.ЯзыкПрограммы = 1 Тогда 
		Если ПолеТекстаПрограммы.ФорматироватьТекстЯзыкаЗапросов() Тогда 
			ПередатьИзмененияИзПоляТекстаВОкноМодуля(ПолеТекстаПрограммы, Ложь, Истина);
		КонецЕсли;
	КонецЕсли;
		         
КонецПроцедуры

Процедура ВосстановитьОкноПриложения(ПодключениеИР)
	// ПодключениеИР нельзя из кэша брать, т.к. там активное окно конфигуратора заново получается
	СтароеАктивноеОкно = ТурбоКонф.ПолучитьАктивноеОкно();
	ПодключениеИР.Visible = Истина; 
	МодулиИР = МодулиИР(ПодключениеИР);
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	// В 8.3.9- заголовок окна будет с добавкой слева
	ФиктивноеОкно = 1;
	Если Не ЗначениеЗаполнено(Конфигуратор) Тогда
		ОкноКонфигуратора = ФиктивноеОкно;
	Иначе
		ОкноКонфигуратора = Конфигуратор.ГлавноеОкно;
	КонецЕсли;
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх(МодулиИР.ирОбщий.ТекстДляРегВыраженияЛкс(ЗаголовокПриложенияИР), 2000, ОкноКонфигуратора, РежимОткрытияВнешнегоОкна.ГлавноеОкно,
		Истина, ИдентификаторПроцессаИР);
	ЗавершитьВызовВнешнегоОкнаАсинх(ФиктивноеОкно, ИдентификаторПроцессаИР);
	
	// Подождем получения фокуса окном приложения ИР, что иногда не сразу происходит https://turboconf.ru/Tasks/8912
	ЖдатьПотерюАктивностиОкна(СтароеАктивноеОкно);
КонецПроцедуры

// .
//
// Параметры:
//  СтароеАктивноеОкно	 - Число - 
//  ЧислоСекунд			 - Число - 
// 
// Возвращаемое значение:
//  Булево - Истина если окно потеряло фокус
//
Функция ЖдатьПотерюАктивностиОкна(Знач СтароеАктивноеОкно = Неопределено, Знач ЧислоСекунд = 2, Знач НадежныйРежим = Ложь) Экспорт
	Если СтароеАктивноеОкно = Неопределено Тогда
		СтароеАктивноеОкно = ТурбоКонф.ПолучитьАктивноеОкно();
	КонецЕсли;
	Если ТурбоКонф.ПолучитьВерсиюAPI() < 6 Или НадежныйРежим Тогда
		МоментНачала = ТекущаяДата();
		Пока Истина
			И ТурбоКонф.ПолучитьАктивноеОкно() = СтароеАктивноеОкно 
			И ТекущаяДата() <= МоментНачала + ЧислоСекунд - 1 // Не больше ЧислоСекунд секунд ждем
		Цикл
			ТурбоКонф.Ждать(100);
		КонецЦикла;
		Результат = ТурбоКонф.ПолучитьАктивноеОкно() <> СтароеАктивноеОкно;
	Иначе 
		Результат = ТурбоКонф.ЖдатьСменуАктивногоОкна(СтароеАктивноеОкно, ЧислоСекунд * 1000, Ложь); // Не надеждно https://turboconf.ru/Tasks/9997
		//Сообщить("Резу="+ Результат);
		//Сообщить("СтароеАктивноеОкно="+ СтароеАктивноеОкно);
	КонецЕсли;
	Возврат Результат;
КонецФункции

//&ЗапроситьИнформациюОДокументе
Процедура КопироватьСсылку()
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		ТекстЯчейки = ТурбоКонф.ПолучитьИмяЭлемента();
		ЗаголовокКолонки = " Элемент";
		ИмяЭлементаФормы = "";
		Если СтрЗаканчиваетсяНа(ТекстЯчейки, ЗаголовокКолонки) Тогда
			ИмяЭлементаФормы = СтрокаБезПоследнегоФрагментаЛкс(ТекстЯчейки, ЗаголовокКолонки);
			АктивироватьТекущийОбъектВДеревеКонфигурации();
		КонецЕсли;
		Ссылка = СсылкаНаОбъектМДВДеревеКонфигурации(ПодключениеИР);
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяЭлементаФормы) Тогда
			Ссылка = Ссылка + ".Элементы." + ИмяЭлементаФормы;
			ВернутьсяВПредыдущееМестоКонфигуратора();
		КонецЕсли;
	Иначе 
		Если Не ЗначениеЗаполнено(ПолеТекстаПрограммы.мИмяМодуля) Тогда
			// ПоказатьВсплывающееУведомление("Поддерживается копирование ссылок только в развернутых модулях");
			Возврат;
		КонецЕсли;
		// №1 расширенная ссылка
		Ссылка = "";
		Ссылка = Ссылка + Символы.ПС + "1. " + ПолеТекстаПрограммы.СсылкаСтрокиМодуля(, Истина);
		// №2 стандартный формат платформы
		Ссылка = Ссылка + Символы.ПС + "2. " + ПолеТекстаПрограммы.СсылкаСтрокиМодуля(, Ложь) + ": <Стандартная>";
		// №3 - полное имя метода
		Если ПолеТекстаПрограммы.мМетодМодуля <> Неопределено Тогда
			Ссылка = Ссылка + Символы.ПС + "3. см. " + ПолеТекстаПрограммы.ПолноеИмяМетода();
		КонецЕсли;
		Ссылка = СокрЛП(Ссылка);
	КонецЕсли;
	УстановитьБуферОбмена(Ссылка);
	ТурбоКонф.ОтжатьМодификаторы();
	УказательУведомления = ПоказатьВсплывающееУведомление("Скопирована ссылка - " + Ссылка);
	//УказательУведомления = ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Скопирована ссылка - " + Ссылка,, ЭтотОбъект, "ПерейтиКОпределениюИзУведомления",, "Перейти");
КонецПроцедуры

// Пока нет способа выполнить в другом конфигураторе https://turboconf.ru/Tasks/9986
Процедура ПерейтиКОпределениюИзУведомления(Знач Параметры)
	ПерейтиКОпределению(Ложь);
КонецПроцедуры  

Функция СсылкаНаОбъектМДВДеревеКонфигурации(Знач ПодключениеИР, Знач ТолькоВерхнийУровень = Ложь, выхИмяРасширения = "") Экспорт
	МодулиИР = МодулиИР(ПодключениеИР);
	
	//ТурбоКонф.КонтролКлавиша(Клавиши.F);
	//ТурбоКонф.ЖдатьОкно("Поиск объектов метаданных", 1000, Истина);
	//ЗакрытьМодальноеОкно(, Клавиши.Enter);
	//ОткрытьРезультатыПоиска();
	//НайденныйОбъект = ВыделенныйТекст(); // Копируются сразу все результаты
	//ВернутьсяВПредыдущееМестоКонфигуратора();
	//ВернутьсяВПредыдущееМестоКонфигуратора();
	//ЭтоРасширение = Найти(НайденныйОбъект, "Расширение конфигурации ");
	ЭтоРасширение = Ложь; // Так ссылка на объект расширения может быть неполной, зато очень быстро выполняется копирование
	
	Если Не ЭтоРасширение И ОткрытьКонтекстноеМенюДереваМетаданных() Тогда
		ИмяЭлементаДереваНачальное = ТурбоКонф.ПолучитьИмяЭлемента();
		Если КликнутьПоЭлементу("Справочная информация", "элемент меню") Тогда
			СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
			ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 100, Истина);
			// Частично дублируем логику см. ИмяМодуляДокумента Мультиметка250108_112016
			Заголовок = МодулиИР.ирОбщий.ПервыйФрагментЛкс(ТурбоКонф.ПолучитьЗаголовокКонфигуратора(Конфигуратор.ГлавноеОкно), "- Конфигуратор -", Ложь);
			СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
			ЗакрытьДочернееОкноКонфигуратора();
			ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 100, Истина);
			ИмяЭлементаДереваНовое = ТурбоКонф.ПолучитьИмяЭлемента();
			Если ИмяЭлементаДереваНовое <> ИмяЭлементаДереваНачальное Тогда
				ВернутьсяВПредыдущееМестоКонфигуратора();
			КонецЕсли;
			Если ПустаяСтрока(Заголовок) Тогда
				ПоказатьВсплывающееУведомление("Разверните дочерние окна конфигуратора для ускорения получения ссылки на объект метаданных");
			Иначе
				ЧастиДвоеточия = СтрРазделитьЛкс(Заголовок, ":", Истина);
				ИмяКорневогоТипа = ИдентификаторИзПредставленияЛкс(СтрокаБезПоследнегоФрагментаЛкс(ЧастиДвоеточия[0], " "));
				Если ИмяКорневогоТипа = "Конфигурация" Тогда
					ПолноеИмяОбъекта = "ОбщаяФорма." + ЧастиДвоеточия[1];
				Иначе
					ИмяОбъекта = ПоследнийФрагментЛкс(ЧастиДвоеточия[0], " ");
					ПолноеИмяОбъекта = ИмяКорневогоТипа + "." + ИмяОбъекта;  
					Если Истина
						И ЧастиДвоеточия.Количество() > 1 
						И ЧастиДвоеточия[1] <> "Справочная информация"
					Тогда
						ПолноеИмяОбъекта = ПолноеИмяОбъекта + ".Форма." + ИдентификаторИзПредставленияЛкс(ЧастиДвоеточия[1]);
					КонецЕсли;
				КонецЕсли;
				Возврат ПолноеИмяОбъекта;
			КонецЕсли; 
		ИначеЕсли Истина
			И Не ТурбоКонф.НайтиЭлементПоИмени("Открыть макет", "элемент меню")
			И КликнутьПоЭлементу("Поиск ссылок в объекте", "элемент меню") 
		Тогда
			ТурбоКонф.КонтролАльтКлавиша(Клавиши.O);
			Текст = ТурбоКонф.ПолучитьТекстДокумента(0, 0, 0, 0);
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.УстановитьТекст(Текст);
			Для НомерСтроки = -ТекстовыйДокумент.КоличествоСтрок() По 0 Цикл // Обратный обход
				СтрокаСообщения = ТекстовыйДокумент.ПолучитьСтроку(-НомерСтроки);
				ПолноеИмяОбъекта = МодулиИР.ирОбщий.ТекстМеждуМаркерамиЛкс(СтрокаСообщения, """", """", Ложь, Ложь, Ложь, Ложь);
				Если ЗначениеЗаполнено(ПолноеИмяОбъекта) Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;  
			Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Поиск ссылок" Тогда
				ЗакрытьДочернееОкноКонфигуратора();
			Иначе
				ВернутьсяВПредыдущееМестоКонфигуратора();
				Возврат ПолноеИмяОбъекта;
			КонецЕсли;
		Иначе
			ЗакрытьДочернееОкноКонфигуратора();
		КонецЕсли;
	КонецЕсли;
	
	Фрагменты = ПутьВДеревеТабличногоПоля(ПодключениеИР);
	Если Ложь
		Или Фрагменты.Количество() < 2 
		Или Найти(Фрагменты[0], " ") > 0 // неполное дерево
	Тогда 
		АктивироватьСтрокуДерева(Фрагменты);
		Возврат "";
	КонецЕсли;
	Если Фрагменты[1] = "Общие" Тогда
		Фрагменты.Удалить(1);
	КонецЕсли;
	ПозицияФрагмента = Фрагменты.Найти("Табличные части");
	Если ПозицияФрагмента <> Неопределено Тогда
		Если Фрагменты.Количество() > ПозицияФрагмента + 2 Тогда
			Фрагменты.Вставить(ПозицияФрагмента + 2, "Реквизиты");
		КонецЕсли;
	КонецЕсли;
	ПозицияФрагмента = Фрагменты.Найти("Перерасчеты");
	Если ПозицияФрагмента <> Неопределено Тогда
		Если Фрагменты.Количество() > ПозицияФрагмента + 2 Тогда
			Фрагменты.Вставить(ПозицияФрагмента + 2, "Измерения");
		КонецЕсли;
	КонецЕсли;
	Для Счетчик = 1 По Цел(Фрагменты.Количество() / 2) Цикл
		ИндексФрагмента = 2*(Счетчик - 1) + 1;
		ИмяМножественное = ИдентификаторИзПредставленияЛкс(Фрагменты[ИндексФрагмента],,, "");
		ЕдинственноеИмя = МодулиИР.ирОбщий.ЕдинственноеИмяМДЛкс(ИмяМножественное);
		Если ЕдинственноеИмя = Неопределено Тогда
			ПоказатьВсплывающееУведомление("Неизвестный тип метаданных """ + ИмяМножественное + """");
			Возврат "";
		КонецЕсли;
		Фрагменты[ИндексФрагмента] = ЕдинственноеИмя;
	КонецЦикла;
	ИмяКонфигурации = Фрагменты[0];
	Фрагменты.Удалить(0); // Имя конфигурации/расширения
	СсылкаВосстановления = СтрСоединить(Фрагменты, ".");
	Пока ТолькоВерхнийУровень И Фрагменты.Количество() > 2 Цикл
		Фрагменты.Удалить(Фрагменты.ВГраница());
	КонецЦикла;
	Ссылка = СтрСоединить(Фрагменты, ".");
	ИмяОсновнойКонфигурации = ИмяОсновнойКонфигурации(ПодключениеИР);
	Если ИмяОсновнойКонфигурации <> ИмяКонфигурации Тогда
		выхИмяРасширения = ИмяКонфигурации;
		СсылкаВосстановления = ИмяКонфигурации + " " + СсылкаВосстановления;
		Ссылка = ИмяКонфигурации + " " + Ссылка;
	КонецЕсли;
	ТурбоКонф.Перейти(СсылкаВосстановления);
	Возврат Ссылка;
КонецФункции

//.
// Возвращаемое значение:
//   Булево - успешность открытия меню 
Функция ОткрытьКонтекстноеМенюДереваМетаданных() Экспорт
	Если ПолучитьТипТекущегоЭлемента() <> ТипЭлемента.ЭлементСписка Тогда
		Возврат Ложь;
	КонецЕсли;
	ОткрытьКонтекстноеМеню();
	Попытка
		ТипАктивногоЭлемента = ТурбоКонф.ПолучитьТипАктивногоЭлемента();
	Исключение
		// < 6.3.9145.3319
		ТипАктивногоЭлемента = Неопределено;
	КонецПопытки;
	Сообщить("ТипАктивногоЭлемента=" + ТипАктивногоЭлемента);
	ЛиОткрылосьКонтекстноеМенюДереваМетаданных = Ложь
		Или ТипАктивногоЭлемента = ТипЭлемента.ЭлементМеню // Не работает
		Или ТурбоКонф.НайтиЭлементПоИмени("Свойства", "элемент меню")
		Или ТурбоКонф.НайтиЭлементПоИмени("Добавить", "элемент меню")
		//Или ТурбоКонф.НайтиЭлементПоИмени("Вывести список...", "элемент меню")
		//Или ПолучитьТипТекущегоЭлемента() = ТипЭлемента.ЭлементМеню // турбоконф не видит активность контекстного меню
		;
	Возврат ЛиОткрылосьКонтекстноеМенюДереваМетаданных;
КонецФункции

Функция ИдентификаторТекущегоЭлементаОкна() Экспорт
	Результат = ТурбоКонф.ПолучитьRuntimeIdСтрокой();
	//Сообщить("ИД элемента = " + Результат); // Иногда Турбоконф начинает возвращать одинаковые значения в любых местах
	Возврат Результат;
КонецФункции

// Связанный метод - АктивироватьСтрокуДерева
Функция ПутьВДеревеТабличногоПоля(_ПодключениеИР = Неопределено, Знач РазрешитьВТаблице = Ложь) Экспорт
	Фрагменты = Новый Массив;
	КонтекстИнтерфейса = КонтекстИнтерфейса();
	Если Истина
		И КонтекстИнтерфейса.ЛиТаблица
		И (Ложь
			Или Не КонтекстИнтерфейса.Иерархический
			Или ПустаяСтрока(КонтекстИнтерфейса.ИмяКлючевойКолонки))
		//И Не (Истина
		//	И ПолучитьТипТекущегоЭлемента() = ТипЭлемента.Неизвестный // ячейка табличного документа, дерево с колонками (структура элементов или реквизитов упр. формы)
		//	И ТурбоКонф.ПолучитьНазваниеТипаТекущегоЭлемента() = "сетка данных")
	Тогда
		Возврат Фрагменты;
	КонецЕсли;
	Если Истина
		И КонтекстИнтерфейса.ЛиТаблица 
		И Не СтрЗаканчиваетсяНа(ТурбоКонф.ПолучитьИмяЭлемента(), " " + КонтекстИнтерфейса.ИмяКлючевойКолонки)
	Тогда
		ЯчейкиТекущейСтроки = ЯчейкиТекущейСтроки(3);
		Если Ложь
			Или ЯчейкиТекущейСтроки = Неопределено 
			Или Не КликнутьПоЭлементу(ЯчейкиТекущейСтроки[КонтекстИнтерфейса.ИндексКлючевойКолонки], ТурбоКонф.ПолучитьНазваниеТипаТекущегоЭлемента()) 
		Тогда
			Возврат Фрагменты;
		КонецЕсли;
	КонецЕсли;
	ШаблонЗамены = "\<[^\>]*\>";
	//МодулиИР = МодулиИР(ПодключениеИР);
	ИмяТекЭлемента = Неопределено;
	Пока ИмяТекЭлемента <> ТурбоКонф.ПолучитьИмяЭлемента() Цикл
		ИмяЭлемента = ТурбоКонф.ПолучитьИмяЭлемента();
		Если Не ЗначениеЗаполнено(ИмяЭлемента) Тогда
			Прервать;
		КонецЕсли;
		//ИмяЭлемента = МодулиИР.ирОбщий.ЗаменитьРегВыражениеЛкс(ИмяЭлемента, ШаблонЗамены, "", Ложь);
		ИмяЭлемента = ЗаменитьРегВыражение(ИмяЭлемента, ШаблонЗамены, "");
		Фрагменты.Вставить(0, ИмяЭлемента);
		ТурбоКонф.КонтролКлавиша(Клавиши.Up);
		ИмяТекЭлемента = ИмяЭлемента;
	КонецЦикла;
	Возврат Фрагменты;
КонецФункции    

Функция ЗаменитьРегВыражение(ГдеЗаменять, ЧтоЗаменять, ЧемЗаменять)
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(ЧтоЗаменять);
	РегулярноеВыражение = Новый ("РегулярноеВыражение", ПараметрыКонструктора);
	Возврат РегулярноеВыражение.Заменить(ГдеЗаменять, ЧемЗаменять);
КонецФункции

//.
// Параметры:
//   ЧислоКолонок - Число - 
// Возвращаемое значение:
//   Массив из Строка, Неопределено - 6.3.9130.13871
Функция ЯчейкиТекущейСтроки(Знач ЧислоКолонок) Экспорт
	ВидимыеЭлементы = ПолучитьВидимыеЭлементыСписка(Истина);
	Если ВидимыеЭлементы = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	ЯчейкиТекущейСтроки = ЯчейкиТекущейСтрокиСпискаИзВидимыхЭлементов(ВидимыеЭлементы, ЧислоКолонок);
	Возврат ЯчейкиТекущейСтроки;
КонецФункции 

//.
// Параметры:
//   Путь - Строка, Массив из Строка - путь полученный функцией ПутьВДеревеТабличногоПоля
Функция АктивироватьСтрокуДерева(Знач Путь) Экспорт
	Если Не ЛиАктивноГлавноеОкно() Тогда
		КонтекстИнтерфейса = КонтекстИнтерфейса();
		Если Не КонтекстИнтерфейса.ПоддерживаетПоиск Тогда
			ПоказатьВсплывающееУведомление("Список не поддерживает поиск");
			ТурбоКонф.КонтролАльтКлавиша(Клавиши.M);
			Если ПолучитьТипТекущегоЭлемента() = ТипЭлемента.Поле Тогда
				УстановитьЗначениеПолюВвода(ПоследнийФрагментЛкс(Путь), Ложь);
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(Путь) = Тип("Строка") Тогда
		Путь = СтрРазделитьЛкс(Путь);
	КонецЕсли;
	ИмяТипаЭлемента = ТурбоКонф.ПолучитьНазваниеТипаТекущегоЭлемента();
	Счетчик = 1;
	Для Каждого Фрагмент Из Путь Цикл
		Если Не КликнутьПоЭлементу(Фрагмент, ИмяТипаЭлемента) Тогда
			НайтиСтрокуВОкне(Фрагмент, Ложь);
			Если Найти(ТурбоКонф.ПолучитьИмяЭлемента(), Фрагмент) = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		Если Счетчик <> Путь.Количество() Тогда
			ТурбоКонф.Клавиша(Клавиши.Add);
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Процедура СвернутьДругиеСтроки(Знач ПутьСтарый = Неопределено)
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПутьТекущий = ПутьВДеревеТабличногоПоля(ПодключениеИР);
	Если Не ЗначениеЗаполнено(ПутьТекущий) Тогда
		ПродолжитьОбработкуНажатияКлавиш();
		Возврат;
	КонецЕсли;
	ТурбоКонф.КонтролШифтКлавиша(Клавиши.Subtract);
	Если ПутьСтарый <> Неопределено Тогда
	    АктивироватьСтрокуДерева(ПутьСтарый);
	КонецЕсли;
    АктивироватьСтрокуДерева(ПутьТекущий);
	//ТурбоКонф.ОтжатьМодификаторы();
КонецПроцедуры

// 8мс, 20мс при открытом окне "Служебные сообщения"
Функция ПолучитьТипТекущегоЭлемента()
	Возврат ТурбоКонф.ПолучитьТипТекущегоЭлемента(); // Вероятно ошибка OScript https://turboconf.ru/Tasks/8430
	// Возврат ТурбоКонф.ПолучитьНазваниеТипаТекущегоЭлемента(); 
КонецФункции

Функция ЭтоДокумент(Знач ТипПоля = "") 
	Если Не ЗначениеЗаполнено(ТипПоля) Тогда
		ТипПоля = ПолучитьТипТекущегоЭлемента();
	КонецЕсли;
	Возврат ТипПоля = ТипЭлемента.Документ;
	// Возврат ТипПоля = "документ";
КонецФункции

Функция ЭтоПоле(Знач ТипПоля = "")
	Если Не ЗначениеЗаполнено(ТипПоля) Тогда
		ТипПоля = ПолучитьТипТекущегоЭлемента();
	КонецЕсли;
	Возврат ТипПоля = ТипЭлемента.Поле;
	// Возврат ТипПоля = "поле";
КонецФункции

Функция ЭтоПолеСоСписком(Знач ТипПоля = "")
	Если Не ЗначениеЗаполнено(ТипПоля) Тогда
		ТипПоля = ПолучитьТипТекущегоЭлемента();
	КонецЕсли;
	Возврат ТипПоля = ТипЭлемента.ПолеСоСписком;
	// Возврат ТипПоля = "поле со списком";
КонецФункции

//&ТолькоТекстовыеДокументы
Процедура НайтиИспользование()
	ТурбоКонф.ПродолжитьОбработкуНажатияКлавиш = Истина;
	ОткрытьКонтекстноеМеню();
	ШтатнаяКомандаДоступна = ТурбоКонф.ПолучитьДоступностьЭлемента("Найти использование", "элемент меню");
	ЗакрытьДочернееОкноКонфигуратора();
	Если ШтатнаяКомандаДоступна Тогда
		Возврат;
	КонецЕсли;
	Если ПерейтиКОпределению() Тогда
		ТурбоКонф.КонтролКлавиша(Клавиши.Right);
	КонецЕсли;
КонецПроцедуры

//&-ВосстанавливатьБуферОбмена
//&ЗапроситьИнформациюОДокументе
Функция ПерейтиКОпределению(Знач РазрешитьСсылкуИзТекущейПозиции = Истина)
	ТипЭлементаИнтерфейса = ТурбоКонф.ПолучитьТипТекущегоЭлемента();
	СтароеЗначениеБуфераОбмена = ТурбоКонф.ПолучитьБуферОбмена();
	ЭтоДокумент = ЭтоДокумент(ТипЭлементаИнтерфейса);
	Если Не ЭтоДокумент Тогда
		ТекстМодуля = ВыделенныйТекст(Ложь);
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(, ЭтоДокумент И РазрешитьСсылкуИзТекущейПозиции, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ЭтоВызовИзПриложенияИР = Ложь;
	ИмяФайлаБуфера = ВосстановитьЗначениеСеансаКонфигуратора("ИмяФайлаБуфера");
	ФайлБуфера = Новый Файл(ИмяФайлаБуфера);
	Если ФайлБуфера.Существует() Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ИмяФайлаБуфера);
		ЗначениеИзБуфера = СокрЛП(ТекстовыйДокумент.ПолучитьТекст());
		УдалитьФайлы(ИмяФайлаБуфера);
		ЭтоВызовИзПриложенияИР = Истина;
		РазрешитьСсылкуИзТекущейПозиции = Ложь;
		СохранитьЗначениеСеансаКонфигуратора("БлокировкаПриложенияИР", Ложь);
	Иначе 
		ЗначениеИзБуфера = СтароеЗначениеБуфераОбмена;
		Если Не ЗначениеЗаполнено(ТекстМодуля) Тогда
			ТекстМодуля = ЗначениеИзБуфера;
		КонецЕсли;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	Сообщить("Ссылка из буфера = " + ЗначениеИзБуфера);
	//Если ТипЭлементаИнтерфейса = ТипЭлемента.Кнопка Тогда 
		// Работает лишь иногда. Ошибка платформы https://turboconf.ru/Tasks/10147
		ТекстКнопки = СтрокаБезПоследнегоФрагментаЛкс(ТурбоКонф.ПолучитьИмяЭлемента(), " Колонка1");
		Если Ложь
			Или ТекстКнопки = "Записать" 
			Или ТекстКнопки = "Записать и закрыть" 
			Или ТекстКнопки = "Провести" 
			Или ТекстКнопки = "Провести и закрыть" 
			Или ТекстКнопки = "Отменить проведение" 
		Тогда
			ПерейтиПоСсылкеМД(МодулиИР.ирОбщий.СсылкаСтрокиМодуляЛкс(МодулиИР.ирКэш.Получить().ИмяМодуляПсевдокодаПлатформы(),, "ФормаОбъекта_Записать"));
			Возврат Истина;
		ИначеЕсли ТекстКнопки = "Удалить" Тогда
			ПерейтиПоСсылкеМД(МодулиИР.ирОбщий.СсылкаСтрокиМодуляЛкс(МодулиИР.ирКэш.Получить().ИмяМодуляПсевдокодаПлатформы(),, "Объект_Удалить"));
			Возврат Истина;
		КонецЕсли;
	//КонецЕсли;
	Значение = Неопределено; 
	СтруктураСсылки = Неопределено; 
	ПолеТекстаПрограммы = Неопределено;
	ИмяРасширения = "";
	Если ЗначениеЗаполнено(НомерСтрокиТекста) Тогда
		ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,,, Истина,,,, ИмяРасширения);
		Если ПолеТекстаПрограммы = Неопределено Тогда
			// Берем текущую строку окна сообщений
			ТурбоКонф.Клавиша(Клавиши.Home);
			ТурбоКонф.ШифтКлавиша(Клавиши.End);
			//Значение = ВыделенныйТекст(); // Ненадежно
			ТурбоКонф.ПолучитьТекстМодуля(ВыделенныйТекст, 0); // Читаем выделенный текст
			Если МодулиИР.ирОбщий.НайтиРегВыражениеЛкс(ВыделенныйТекст, "^\{\(\d+, \d+\)\}: ").Количество() > 0 Тогда
				ШаблонСсылкиНаСтрокуЗапроса = "(\{[^\}]+\}):[^\n]+\n(?:\{[^\}]+\}:[^\n]+\n)*по причине:\n(" + МодулиИР.ирОбщий.ТекстДляРегВыраженияЛкс(ВыделенныйТекст) + "\n[^\n]+)";
				СсылкаСтрокиЗапроса = МодулиИР.ирОбщий.НайтиРегВыражениеЛкс(ТекстМодуля, ШаблонСсылкиНаСтрокуЗапроса);
				Если СсылкаСтрокиЗапроса.Количество() Тогда
					ПолеТекстаПрограммы = ПолеТекстаПрограммыБезКонтекста(ПодключениеИР);
					Значение = ПолеТекстаПрограммы.СсылкаСтрокиМодуляИзОшибкиВТекущемЗапросе(СсылкаСтрокиЗапроса.Получить(0).Группа0, СсылкаСтрокиЗапроса.Получить(0).Группа1);
					РазрешитьСсылкуИзТекущейПозиции = Ложь;
				КонецЕсли;
			Иначе
				Вхождения = НайтиОбъектыМДВТекстеОкнаСообщений(МодулиИР, ВыделенныйТекст);
				Если Вхождения.Количество() > 0 Тогда
					Значение = Вхождения.Получить(0).Группа0;
					РазрешитьСсылкуИзТекущейПозиции = Ложь;
				КонецЕсли;
			КонецЕсли;
			ТекстМодуля = ВыделенныйТекст;
		Иначе
			ПолеТекстаПрограммы.ЗапомнитьИсточникПерехода();
			Если РазрешитьСсылкуИзТекущейПозиции Тогда 
				Значение = ПолеТекстаПрограммы.ПерейтиКОпределению(,, Ложь);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ИмяОсновнойКонфигурации = ИмяОсновнойКонфигурации(ПодключениеИР);
		КлючКэшаИмениКонфигурации = КлючКэшаИмениКонфигурацииДляПоля(2);
		ИмяРасширения = ВосстановитьЗначениеСеансаКонфигуратора(КлючКэшаИмениКонфигурации);
		Если ПустаяСтрока(ИмяРасширения) Тогда
			СсылкаМД = СсылкаНаОбъектМДВДеревеКонфигурации(ПодключениеИР, Истина, ИмяРасширения);
			Если ЗначениеЗаполнено(ИмяРасширения) Тогда
				ТекстМодуля = Сред(СсылкаМД, СтрДлина(ИмяРасширения) + 2);
			ИначеЕсли ЗначениеЗаполнено(СсылкаМД) Тогда
				ИмяРасширения = ИмяОсновнойКонфигурации;
			КонецЕсли;
			СохранитьЗначениеСеансаКонфигуратора(КлючКэшаИмениКонфигурации, ИмяРасширения);
		КонецЕсли;
		Сообщить("ИмяКонфигурации = " + ИмяРасширения);
		Если ИмяРасширения = ИмяОсновнойКонфигурации Тогда
			// Копируем значение свойства "Тип" из палитры свойств
			ТурбоКонф.АльтКлавиша(Клавиши.Enter);
			//ТурбоКонф.Клавиша(Клавиши.Tab);
			//ТурбоКонф.Клавиша(Клавиши.Tab);
			//ТурбоКонф.Клавиша(Клавиши.Tab);
			АктивироватьСвойствоВПалитреСвойств("Тип");
			ТекстМодуля = ВыделенныйТекст(Ложь);
			АктивироватьДеревоОсновнойКонфигурации();
		КонецЕсли;
		ИмяРасширения = "";
	КонецЕсли;
	Если Значение = Неопределено Тогда
		СтруктураСсылки = МодулиИР.ирОбщий.СтруктураСсылкиСтрокиМодуляЛкс(ЗначениеИзБуфера);
		Если Истина
			И СтруктураСсылки <> Неопределено 
			И Не РазрешитьСсылкуИзТекущейПозиции 
			И СтрЧислоСтрок(ЗначениеИзБуфера) > 1
			И Лев(ЗначениеИзБуфера, 1) <> "1" //
			И Не ЭтоВызовИзПриложенияИР // Иначе окно приложения ИР будет скрываться
		Тогда
			ОповеститьПользователяОПриостановке(ПодключениеИР);
			СтрокаСтека = Неопределено;
			ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
			ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
			Окно = ТурбоКонф.ПолучитьАктивноеОкно();
			Попытка
				ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("Стек", 2000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
				СтрокаСтека = МодулиИР.ирКлиент.ОткрытьВыборСтрокиСтекаЛкс(ЗначениеИзБуфера);
			Исключение
				ПоказатьВсплывающееУведомление(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
			Если СтрокаСтека = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			ЗначениеИзБуфера = СтрокаСтека.Ссылка;
			СтруктураСсылки = МодулиИР.ирОбщий.СтруктураСсылкиСтрокиМодуляЛкс(ЗначениеИзБуфера);
		КонецЕсли;
	КонецЕсли;
	Если Истина
		И ПолеТекстаПрограммы = Неопределено 
		И (Ложь
			Или РазрешитьСсылкуИзТекущейПозиции 
			Или ТекстМодуля = ЗначениеИзБуфера)
	Тогда 
		Если Лев(ТекстМодуля, 1) = "(" Тогда
			// В реквизитах управляемой формы иногда текст обрамлен скобками
			ТекстМодуля = СтрЗаменить(ТекстМодуля, "(", "");
			ТекстМодуля = СтрЗаменить(ТекстМодуля, ")", "");
		КонецЕсли;
		Значение = ТекстМодуля;
		Значение = МодулиИР.ирОбщий.ИменаМетаданныхИзОписанияТиповЛкс(Значение);
		Если Значение.Количество() = 0 Тогда
			// Текст параметризуемой команды
			Фрагменты = СтрРазделить(ТекстМодуля, " ", Ложь);
			Если Фрагменты.Количество() < 20 Тогда
				Для каждого Фрагмент Из Фрагменты Цикл
					ОбъектМД = ПодключениеИР.Метаданные.НайтиПоПолномуИмени(Фрагмент);
					Если ОбъектМД <> Неопределено Тогда
						Значение.Добавить(МодулиИР.ирОбщий.ПолноеИмяМДСРасширениемЛкс(ОбъектМД));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Значение.СортироватьПоЗначению();
			Значение.СортироватьПоПредставлению();
		КонецЕсли;
		Если Значение.Количество() = 0 И ЗначениеЗаполнено(ТекстМодуля) Тогда
			Значение = Неопределено;
			СтруктураСсылки = МодулиИР.ирОбщий.СтруктураСсылкиСтрокиМодуляЛкс(ТекстМодуля);
			Если СтруктураСсылки <> Неопределено Тогда 
				ТекстМодуля = СтруктураСсылки.ТекстСсылки;
				Значение = ТекстМодуля;
			КонецЕсли; 
			Если Значение = Неопределено Тогда
				Вхождения = МодулиИР.ирОбщий.НайтиРегВыражениеЛкс(ТекстМодуля, "^([_ЁА-ЯA-Z0-9]+)\s\(([^\(\)]+)\)$"); // шБукваЦифра
				Если Вхождения.Количество() Тогда
					Группы = Вхождения.Получить(0).Группы;
					ПространствоИмен = Группы.Получить(1);
					Пакет = МодулиИР.ирОбщий.НайтиЭлементКоллекцииЛкс(ПодключениеИР.Метаданные.ПакетыXDTO, "ПространствоИмен", ПространствоИмен);
					Если Пакет <> Неопределено Тогда
						Значение = "ПакетXDTO." + Пакет.Имя + "." + Группы.Получить(0);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если Значение = Неопределено Тогда
				Значение = ТекстМодуля;
				Если Не ЗначениеЗаполнено(НомерСтрокиТекста) Тогда 
					// Отделять пробелом нужно для ячеек табличных документов. В их имя в конце добавляется адрес через пробел, например "<ТекстЯчейки> A3" 
					ТекстМодуля = СтрРазделить(ТекстМодуля, " ")[0];
				КонецЕсли;
				ТекстМодуля = "//" + ТекстМодуля; 
				ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, СтрДлина(ТекстМодуля), ВыделенныйТекст,,, Ложь);
				Если ПолеТекстаПрограммы <> Неопределено Тогда
					ПолеТекстаПрограммы.КончитьОбработкуКоманды();
					Значение = ПолеТекстаПрограммы.ПерейтиКОпределению(,, Ложь);
				КонецЕсли;
				Если Значение = Неопределено Тогда
					Значение = ТекстМодуля;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ПродолжатьОбработку = Истина;
	Представление = "";
	Если ТипЗнч(Значение) = Тип("COMОбъект") Тогда
		//! Значение = 0 // СписокЗначений
		Если Значение.Количество() = 0 Тогда
			Значение = Неопределено;
		Иначе
			Если Значение.Количество() = 1 Тогда
				НоваяЦельПерехода = Значение.Получить(0);
			Иначе
				ОповеститьПользователяОПриостановке(ПодключениеИР);
				НоваяЦельПерехода = Неопределено;
				ЗаголовокФормыВыбора = "Выберите переход";
				ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
				Окно = ТурбоКонф.ПолучитьАктивноеОкно();
				Попытка
					ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх(ЗаголовокФормыВыбора, 2000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
					НоваяЦельПерехода = МодулиИР.ирКлиент.ВыбратьЭлементСпискаЗначенийЛкс(Значение,, Истина, ЗаголовокФормыВыбора, Ложь, Истина);
				Исключение
					ПоказатьВсплывающееУведомление(ОписаниеОшибки());
				КонецПопытки;
				ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
			КонецЕсли;
			Если НоваяЦельПерехода = Неопределено Тогда
				ПродолжатьОбработку = Ложь;
			Иначе
				РезультатПереходаИР = Ложь;
				Если РезультатПереходаИР = Истина Тогда 
					Значение = Истина; 
				Иначе
					Значение = НоваяЦельПерехода.Значение;
					Представление = НоваяЦельПерехода.Представление;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	Результат = Ложь;
	Если ПродолжатьОбработку Тогда
		// ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
		Сообщить("Ссылка из текущей позиции = " + Значение);
		ЗапомнитьМетод = Истина; 
		Результат = Истина;
		Если Значение = Истина Тогда
			// ИР совершил переход в своем поле модуля
			ПерейтиВПозицию(,, ПолеТекстаПрограммы);
			ВыполнитьКомандуИзСсылкиПослеПерехода(ПолеТекстаПрограммы, СтруктураСсылки);
		// ИначеЕсли Значение = "Справка" Тогда // Мертвая ветка
		// 	ВосстановитьОкноПриложения(ПодключениеИР); 
		// 	ПродолжатьОбработку = Ложь;
		ИначеЕсли Ложь
			Или СтрНачинаетсяС(Представление, "Модуль прямой") 
			Или СтрНачинаетсяС(Представление, "Метод прямой") 
			Или СтрНачинаетсяС(Представление, "Переменная прямой")
		Тогда
			ТурбоКонф.Клавиша(Клавиши.F12);
			Окно = ТурбоКонф.ЖдатьОкно("Объект перехода", 500, Ложь);
			Если Окно > 0 Тогда
				ТурбоКонф.Клавиша(Клавиши.Enter);
			КонецЕсли; 
		ИначеЕсли СтрНачинаетсяС(Представление, "Создать метод") Тогда
			ОповеститьПользователяОПриостановке(ПодключениеИР);
			ЗаголовокФормыВыбора = "Конструктор метода";
			ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
			Окно = ТурбоКонф.ПолучитьАктивноеОкно();
			Попытка
				ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх(ЗаголовокФормыВыбора, 2000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
				РезультатСозданияМетода = ПолеТекстаПрограммы.ОткрытьКонструкторИзВызоваМетода();
			Исключение
				ПоказатьВсплывающееУведомление(ОписаниеОшибки());
			КонецПопытки;
			ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
			Если РезультатСозданияМетода <> Неопределено Тогда
				ПередатьИзмененияИзПоляТекстаВОкноМодуля(ПолеТекстаПрограммы,,, Символы.ПС + Символы.ПС + Значение);
			КонецЕсли;
		ИначеЕсли СтрНачинаетсяС(Представление, "Колонка БД") Тогда
			ВосстановитьОкноПриложения(ПодключениеИР);
			МодулиИР.ирКлиент.ОткрытьКолонкуБДЛкс(Значение);
		ИначеЕсли СтрНачинаетсяС(Представление, "ГиперСсылка") Тогда
			ЗапуститьПриложение(Значение);
		ИначеЕсли Истина
			И ПустаяСтрока(НомерСтрокиТекста)
			И ПустаяСтрока(Представление)
			И Значение = "*"
			И ЛиАктивноГлавноеОкно() 
		Тогда
			// Чтобы открылась панель свойств текущего объекта метаданных из списка. Например в списке "Движения" окна объекта метаданных
			ТурбоКонф.АльтКлавиша(Клавиши.Enter);
			ТурбоКонф.Клавиша(Клавиши.Escape);
			//СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
			ТурбоКонф.АльтКлавиша(Клавиши.F9);
			//ЖдатьСменуТекущегоЭлемента(СтарыйИД);
			ЗакрытьДочернееОкноКонфигуратора();
		Иначе
			Результат = Ложь;
			Если Ложь
				Или Не ЗначениеЗаполнено(Значение)
				//Или (Истина 
				//	И МодулиИР.ирОбщий.СтруктураСсылкиСтрокиМодуляЛкс(Значение) = Неопределено
				//	И Не ЭтоПолноеИмяМД(МодулиИР, Значение))  
			Тогда
				Значение = ЗначениеИзБуфера;
				Если Истина
					И МодулиИР.ирОбщий.СтруктураСсылкиСтрокиМодуляЛкс(Значение) = Неопределено
					И Не ЭтоПолноеИмяМД(МодулиИР, Значение) 
				Тогда
					ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(),
						"Нет ссылки для перехода. В текущей позиции пусто. В буфере обмена не найдено. Открыть справку.", 5000,
						ЭтотОбъект, "ОткрытьСправкуКоманды", Новый Структура("Команда", "ПерейтиКОпределению"));
					ПродолжатьОбработку = Ложь;
				КонецЕсли;
			ИначеЕсли Значение = "*" Тогда
				ТекстСтроки = ПолеТекстаПрограммы.ПолеТекста.ПолучитьСтроку(ПолеТекстаПрограммы.мНачальнаяСтрока);
				СтруктураСсылки = МодулиИР.ирОбщий.СтруктураСсылкиСтрокиМодуляЛкс(ТекстСтроки);
				Если СтруктураСсылки <> Неопределено Тогда
					Значение = СтруктураСсылки.ТекстСсылки;
				Иначе
					ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(),
						"Нет ссылки для перехода. В текущей позиции не найдено. Открыть справку.", 5000,
						ЭтотОбъект, "ОткрытьСправкуКоманды", Новый Структура("Команда", "ПерейтиКОпределению"));
					ПродолжатьОбработку = Ложь; 
				КонецЕсли;
			КонецЕсли;
			Если ПродолжатьОбработку Тогда
				Если ПерейтиПоСсылкеМД(Значение, ИмяРасширения, ЭтоВызовИзПриложенияИР Или Не РазрешитьСсылкуИзТекущейПозиции) Тогда
					ЗапомнитьМетод = Ложь;
					Результат = Истина;
				Иначе
					// Скорее всего бесполезно
					ТурбоКонф.АктивироватьОкно(Конфигуратор.ОкноВызоваСкрипта);
					ТурбоКонф.Клавиша(Клавиши.F12);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ПродолжатьОбработку И ЗапомнитьМетод Тогда
			ФоновыеЗадания.Выполнить(ЭтотОбъект, "ЗапомнитьМетод");
		КонецЕсли;
	КонецЕсли;
	УстановитьБуферОбмена(СтароеЗначениеБуфераОбмена); // Почему то после этого перестает работать чтение из буфера обмена. Проверено на реквизитах управляемой формы. Похоже на баг Турбоконфа
	ТурбоКонф.ОтжатьМодификаторы(); // Иначе будет иногда залипать CTRL после перехода
	Возврат Результат;
КонецФункции   

// Добавляем текущий метод в историю
Процедура ЗапомнитьМетод(Знач СначалаЖдать = Истина) Экспорт
	Если СначалаЖдать Тогда
		ТурбоКонф.Ждать(200);
	КонецЕсли;
	РазобратьПозициюВТексте();
	Если ПозицияВТексте = 0 Тогда
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь,,,,,,, Истина);
КонецПроцедуры   

Процедура АктивироватьДеревоОсновнойКонфигурации() Экспорт
	ТурбоКонф.КонтролШифтКлавиша(Клавиши.C); // Активируем окно основной конфигурации
КонецПроцедуры   

Процедура ОткрытьСправкуКоманды(Параметры) Экспорт
	Если Параметры.Команда = "ПерейтиКОпределению" Тогда
		ЗапуститьПриложение("https://fastcode.im/Templates/Shared/bc4da1a446444e249e02b6f9b5467296");
	КонецЕсли;
КонецПроцедуры

//.
// Параметры:
//   ОкноВозвратаФокуса - Число - если фокус не нужно устанавливать, то передать 0 или 1
//   ИдентификаторПроцесса -  - 
Процедура ЗавершитьВызовВнешнегоОкнаАсинх(Знач ОкноВозвратаФокуса = Неопределено, Знач ИдентификаторПроцесса = 0, Знач ПодключениеИР = Неопределено) Экспорт
	Если ОкноВозвратаФокуса = Неопределено Тогда
		ОкноВозвратаФокуса = Конфигуратор.ОкноВызоваСкрипта;
	КонецЕсли;
	Попытка
		ТурбоКонф.ЗавершитьВызовВнешнегоОкнаАсинх(ОкноВозвратаФокуса,, ИдентификаторПроцесса); // Вроде бы избыточная передача идентификатора
	Исключение
		// ниже 6.0.8819.34377
		ТурбоКонф.ЗавершитьВызовВнешнегоОкнаАсинх(ОкноВозвратаФокуса);
	КонецПопытки;
	Если ПодключениеИР <> Неопределено Тогда
		ОповеститьПользователяОВозобновлении();
		ПодключениеИР.Visible = Ложь;
	КонецЕсли;
КонецПроцедуры

// Ускоренный вариант Турбоконф.ПерейтиВПозицию для случая непервой колонки.
//        Пришлось делать, т.к. Турбоконф не мог сам сделать это простое улучшение. https://turboconf.ru/Tasks/9031
// Параметры:
//   НомерКолонкиТекста -  - 
//   НомерСтрокиТекста -  - 
//   ПолеТекстаПрограммы - - если указано, то производится еще разворачивание блока
//   Строгое -  - 
//   ЗапомнитьСтаруюПозицию - Булево - пока отключен
Процедура ПерейтиВПозицию(Знач НомерКолонкиТекста = 0, Знач НомерСтрокиТекста = 0, Знач ПолеТекстаПрограммы = Неопределено, Знач Строгое = Ложь, Знач ЗапомнитьСтаруюПозицию = Истина)
	Если Не ЛиАктивноГлавноеОкно() Тогда
		// https://turboconf.ru/Tasks/9185
		Возврат;
	КонецЕсли;
	Если Ложь
		Или ТурбоКонф.ПолучитьВерсиюAPI() < 6 
		Или ТурбоКонф.РежимСовместимости() 
		Или НомерКолонкиТекста = 1
	Тогда
		ТурбоКонф.ПерейтиВПозицию(НомерКолонкиТекста, НомерСтрокиТекста);
	ИначеЕсли ПолеТекстаПрограммы <> Неопределено Тогда
		Если Не ЗапомнитьСтаруюПозицию Тогда
			//// Если позиция отсутствует, то переходим сразу в нужное место, чтобы текущая позиция не попала в историю переходов конфигуратора
			//// Но при этом не делается вертикальное центрировании строки
			//ВыделениеОдномерное = ПолеТекстаПрограммы.ПолеТекста.ВыделениеОдномерное();
			//ВременнаяПозиция = ВыделениеОдномерное.Начало - 1;
			//ТурбоКонф.ВыделитьТекст(ВременнаяПозиция, ВременнаяПозиция); // Почему то делает текущую строку самой нижней в области просмотра
		КонецЕсли;
		Если Не Строгое Тогда
			ВыделениеДвумерное = ПолеТекстаПрограммы.ПолеТекста.ВыделениеДвумерное();
			ТурбоКонф.ПерейтиВПозицию(1, ВыделениеДвумерное.НачальнаяСтрока); // Нужно для запоминания позиции в истории переходов конфигуратора и для центрирования по высоте
		КонецЕсли;
		ВыделениеОдномерное = ПолеТекстаПрограммы.ПолеТекста.ВыделениеОдномерное();
		РазвернутьБлокМодуля(ВыделениеОдномерное.Начало - 1, ВыделениеОдномерное.Конец - 1,, Строгое);
	Иначе 
		Позиция = 0; 
		ТекстДокумента = ТурбоКонф.ПолучитьТекстДокумента(0, 0, Позиция, Позиция);
		Если ЗначениеЗаполнено(ТекстДокумента) Тогда
			ТурбоКонф.ПерейтиВПозицию(1, НомерСтрокиТекста);
			Позиция = Позиция + НомерКолонкиТекста - 1;
			ТурбоКонф.ВыделитьТекст(Позиция, Позиция); // Почему то делает текущую строку самой нижней в области просмотра
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//&ТолькоТекстовыеДокументы
Процедура ПерейтиВНачалоРодителяВМодуле()
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте,,,, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ПолеТекстаПрограммы.ПерейтиВНачалоРодителя() Тогда 
		Возврат;
	КонецЕсли;
	ПерейтиВПозицию(,, ПолеТекстаПрограммы);
КонецПроцедуры

//&ТолькоТекстовыеДокументы
Процедура ПерейтиКГраницеКонструкцииНазад()
	ПерейтиКГраницеКонструкции();
КонецПроцедуры     

//&ТолькоТекстовыеДокументы
Процедура ПерейтиКГраницеКонструкцииВперед()
	ПерейтиКГраницеКонструкции();
КонецПроцедуры

//&ТолькоТекстовыеДокументы
Процедура ПерейтиКГраницеКонструкции()
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Попытка
		ТурбоКонф.ПродолжитьОбработкуНажатияКлавиш = Истина;
	Исключение
		ПоказатьВсплывающееУведомление("Рекомендуется отключить команды ""Перейти к границе конструкции"", т.к. в Турбоконф 6.1- они блокируют штатные команды конфигуратора", 5000);
	КонецПопытки;
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте,,,, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ПолеТекстаПрограммы.ПерейтиКГраницеКонструкции() Тогда 
		Возврат;
	КонецЕсли;
	ПродолжитьОбработкуНажатияКлавиш(Ложь);
	ПерейтиВПозицию(,, ПолеТекстаПрограммы, Истина);
КонецПроцедуры

//&ТолькоТекстовыеДокументы
Процедура ВернутьсяИзПереходаИР()
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля,,,, Истина);
	Если Не ПолеТекстаПрограммы.ВернутьсяИзПерехода() Тогда 
		Возврат;
	КонецЕсли;
	ПерейтиВПозицию(,, ПолеТекстаПрограммы);
	//ВернутьсяВПредыдущееМестоКонфигуратора();
КонецПроцедуры

Функция ЭтоПолноеИмяМД(Знач МодулиИР, Значение, ИмяРасширения = "")
	Если Лев(Значение, 1) = "{" Тогда
		Возврат Ложь;
	КонецЕсли;
	Фрагменты = СтрРазделить(Значение, " ");
	Если Фрагменты.Количество() = 2 Тогда
		ПоследнийФрагмент = Фрагменты[1]; // Убираем имя расширения
	Иначе
		ПоследнийФрагмент = Значение;
	КонецЕсли;
	Результат = МодулиИР.ирОбщий.ЛиКорневойТипМетаданныхЛкс(СтрРазделить(ПоследнийФрагмент, ".")[0]);
	Если Результат И Фрагменты.Количество() = 2 Тогда
		ИмяРасширения = Фрагменты[0];
		Значение = Фрагменты[1]; // Убираем имя расширения
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ЭтоСсылкаСтрокиМодуля(Значение)
	Возврат Лев(Значение, 1) = "{"; 
КонецФункции

// Переходит по сссылке на объект метаданных или строку модуля
Функция ПерейтиПоСсылкеМД(Знач СсылкаСтроки = "", Знач ИмяРасширения = "", Знач ЗапретитьКонтекстПоискаСсылок = Истина, Знач ТолькоОткрытьПанельСвойств = Ложь)
	// СтароеЗначениеБуфераОбмена = ТурбоКонф.ПолучитьБуферОбмена();
	ПодключениеИР = ПодключениеИР(,, Ложь);
	МодулиИР = МодулиИР(ПодключениеИР);
	
	// Пробуем перейти в рамках текущего модуля
	ПереходПоСсылкеВыполнен = Ложь;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля,,,,,,,,,,, СсылкаСтроки, ПереходПоСсылкеВыполнен);
	Если ПереходПоСсылкеВыполнен Тогда
		ПерейтиВПозицию(,, ПолеТекстаПрограммы);
		СтруктураСсылки = МодулиИР.ирОбщий.СтруктураСсылкиСтрокиМодуляЛкс(СсылкаСтроки);
		ВыполнитьКомандуИзСсылкиПослеПерехода(ПолеТекстаПрограммы, СтруктураСсылки);
		Возврат Истина;
	КонецЕсли;
	
	// Если Не ЗначениеЗаполнено(СсылкаСтроки) Тогда
	// 	СсылкаСтроки = СтароеЗначениеБуфераОбмена;
	// КонецЕсли;
	Если ЭтоПолноеИмяМД(МодулиИР, СсылкаСтроки, ИмяРасширения) Тогда
		Если Не ЗапретитьКонтекстПоискаСсылок И ПолучитьТипТекущегоЭлемента() = ТипЭлемента.Документ Тогда
			Текст = ТурбоКонф.ПолучитьТекстМодуля("", ПозицияВТексте);
			Вхождения = НайтиОбъектыМДВТекстеОкнаСообщений(МодулиИР, Лев(Текст, ПозицияВТексте));
			Если Вхождения.Количество() > 0 Тогда
				// В окне сообщений в результате поиска ссылок на объект
				ПоследнееВхождение = Вхождения.Получить(Вхождения.Количество() - 1);
				Если ПоследнееВхождение.Группа1 <> Неопределено Тогда // только ссылки НА 
					БазовыйОбъект = ПоследнееВхождение.Группа0;
					Сообщить("БазовыйОбъект=" + БазовыйОбъект); 
					Если Истина
						И СтрЗаканчиваетсяНа(СсылкаСтроки, ".Состав")
						И (Ложь
							//Или СтрНачинаетсяС(СсылкаСтроки, "ФункциональнаяОпция.") // Закомментировал, т.к. ссылки в дочерних объектах некорректно обрабатывает
							Или СтрНачинаетсяС(СсылкаСтроки, "Подсистема.")
							Или СтрНачинаетсяС(СсылкаСтроки, "ПланОбмена."))
					Тогда
						Если ПерейтиПоСсылкеМД(БазовыйОбъект) Тогда
							ТурбоКонф.Клавиша(Клавиши.Enter);
							ТурбоКонф.Ждать(50);
							Если СтрНачинаетсяС(СсылкаСтроки, "Подсистема.") Тогда
								НажатьКлавишуЦикл(Клавиши.PageUp, 20,, Истина);
								НажатьКлавишуЦикл(Клавиши.PageDown, 1,, Истина);
								//КликнутьПоЭлементу("Основные", "вкладка");
								//КликнутьПоЭлементу("Подсистемы", "элемент вкладки"); // Не находит 
							ИначеЕсли СтрНачинаетсяС(СсылкаСтроки, "ФункциональнаяОпция.") Тогда
								НажатьКлавишуЦикл(Клавиши.PageUp, 20,, Истина);
								НажатьКлавишуЦикл(Клавиши.PageDown, 2,, Истина);
								//КликнутьПоЭлементу("Основные", "вкладка");
								//КликнутьПоЭлементу("Функциональные опции", "элемент вкладки"); // Не находит 
							ИначеЕсли СтрНачинаетсяС(СсылкаСтроки, "ПланОбмена.") Тогда
								НажатьКлавишуЦикл(Клавиши.PageDown, 20,, Истина);
								НажатьКлавишуЦикл(Клавиши.PageUp, 1,, Истина);
								//КликнутьПоЭлементу("Основные", "вкладка");
								//КликнутьПоЭлементу("Обмен данными", "элемент вкладки"); // Не находит 
							Иначе
								Возврат Ложь;
							КонецЕсли;
							Фрагменты = СтрРазделить(СсылкаСтроки, ".");
							ТурбоКонф.Ждать(20);
							НайтиСтрокуВОкне(Фрагменты[Фрагменты.ВГраница() - 1], Истина);
							Возврат Истина;
						Иначе
							Возврат Ложь;
						КонецЕсли;
					Иначе 
						// Свойства открываемые через палитру свойств
						ТурбоКонф.Клавиша(Клавиши.Enter);
						ТурбоКонф.АльтКлавиша(Клавиши.Enter);
						АктивироватьСвойствоВПалитреСвойств(МодулиИР.ирОбщий.ПредставлениеИзИдентификатораЛкс(ПоследнийФрагментЛкс(СсылкаСтроки)));
						СтарыйИД = ТурбоКонф.ПолучитьRuntimeIdСтрокой();
						Если ПолучитьТипТекущегоЭлемента() = ТипЭлемента.Поле Тогда
							ТурбоКонф.Клавиша(Клавиши.F4);
						Иначе
							ТурбоКонф.Клавиша(Клавиши.Enter);
						КонецЕсли;
						ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 1000, Ложь);
						УстановитьФокусВПервуюТаблицуИлиСписок(Истина);
						Возврат АктивироватьСтрокуДерева(БазовыйОбъект);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ИмяСвойства = "";
		МаркерСтандартный = ".Стандартный.";
		ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, "//",,,,, Ложь);
		ЧастиИмениФормы = ПолеТекстаПрограммы.ЧастиПолногоИмениЭлементаФормы(СсылкаСтроки);
		ЧастиИмениМакета = ПолеТекстаПрограммы.ЧастиПолногоИмениЭлементаМакета(СсылкаСтроки);
		Если ЧастиИмениФормы <> Неопределено Тогда
			СсылкаСтроки = ЧастиИмениФормы.ИмяФормы;
			ПутьКЭлементуФормы = ЧастиИмениФормы.ПутьКЭлементу;
		ИначеЕсли ЧастиИмениМакета <> Неопределено Тогда
			СсылкаСтроки = ЧастиИмениМакета.ИмяМакета;
			ИмяЭлементаМакета = ЧастиИмениМакета.ПутьКЭлементу;
		ИначеЕсли СтрЧислоВхождений(СсылкаСтроки, ".") = 2 И СтрНачинаетсяС(СсылкаСтроки, "Перечисление.") Тогда
			Фрагменты = СтрРазделить(СсылкаСтроки, ".");
			Фрагменты.Вставить(2, "ЗначениеПеречисления");
			СсылкаСтроки = СтрСоединить(Фрагменты, ".");
		ИначеЕсли Истина
			И СтрЧислоВхождений(СсылкаСтроки, ".") = 2 
			И МодулиИР.ирОбщий.ЛиКорневойТипОбъектаСПредопределеннымЛкс(МодулиИР.ирОбщий.ПервыйФрагментЛкс(СсылкаСтроки))
		Тогда
			Фрагменты = СтрРазделить(СсылкаСтроки, ".");
			Фрагменты.Удалить(2);
			СсылкаСтроки = СтрСоединить(Фрагменты, ".");
		ИначеЕсли Найти(СсылкаСтроки, МаркерСтандартный) > 0 Тогда
			Фрагменты = СтрРазделитьЛкс(СсылкаСтроки, МаркерСтандартный);
			СсылкаСтроки = Фрагменты.Получить(0);
			ИмяРеквизита = Фрагменты.Получить(1);
		ИначеЕсли СтрНачинаетсяС(СсылкаСтроки, "ПакетXDTO.") Тогда
			ИмяТипаХДТО = ПоследнийФрагментЛкс(СсылкаСтроки);
			СсылкаСтроки = СтрокаБезПоследнегоФрагментаЛкс(СсылкаСтроки);
		ИначеЕсли СтрНачинаетсяС(СсылкаСтроки, "ПодпискаНаСобытие.") Тогда
			Фрагменты = СтрРазделитьЛкс(СсылкаСтроки);
			Если Фрагменты.Количество() > 2 Тогда
				ИмяСвойства = "Обработчик";
				Фрагменты.Удалить(2);
			КонецЕсли;
			СсылкаСтроки = СтрСоединить(Фрагменты, ".");
		ИначеЕсли СтрНачинаетсяС(СсылкаСтроки, "РегламентноеЗадание.") Тогда
			Фрагменты = СтрРазделитьЛкс(СсылкаСтроки);
			Если Фрагменты.Количество() > 2 Тогда
				ИмяСвойства = "Имя метода";
				Фрагменты.Удалить(2);
			КонецЕсли;
			СсылкаСтроки = СтрСоединить(Фрагменты, ".");
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяРасширения) Тогда
			СсылкаСтроки = ИмяРасширения + " " + СсылкаСтроки;
		КонецЕсли;                          
		// Активируем дерево конфигурации, чтобы запомнить текущую позицию в нем
		АктивироватьДеревоОсновнойКонфигурации();
		Если ПустаяСтрока(ТурбоКонф.ПолучитьИмяЭлемента()) Тогда
			// Может не быть активного элемента дерево после изменения фильтра
			ТурбоКонф.Клавиша(Клавиши.Up);
		КонецЕсли;
		БылВременныйСдвиг = Ложь;
		ФрагментыИмени = СтрРазделить(СсылкаСтроки, ".");
		НижнееИскомоеИмя = ФрагментыИмени[ФрагментыИмени.ВГраница()]; 
		Если ЗначениеЗаполнено(ИмяРасширения) Тогда
			БылВременныйСдвиг = НижнееИскомоеИмя = ТурбоКонф.ПолучитьИмяЭлемента();
			Если БылВременныйСдвиг Тогда
				// Временно переходим на соседний элемент дерева, чтобы точно отследить успешность перехода, если уже стоим на нужном элементе
				ТурбоКонф.Клавиша(Клавиши.Up);
			КонецЕсли;
			Попытка
				ТурбоКонф.Перейти(СсылкаСтроки);
			Исключение
				//Сообщить("Ошибка перехода к объекту метаданных """ + СсылкаСтроки + """: " + ОписаниеОшибки(), СтатусСообщения.Внимание);
			КонецПопытки; 
			ТурбоКонф.ОтжатьВсеМодификаторы(); // Антибаг Турбоконфа, который иногда оставляет зажатыми клавиши после неуспешного перехода
		Иначе
			// Отказался от штатной функции, т.к. она некорректно переходит к слову Распоряжение, если выше в списке есть слово АктивноеРаспоряжение, а также использует буфер обмена
			НайтиОбъектМетаданныхВДереве(СсылкаСтроки);
		КонецЕсли;
		Если Не ТолькоОткрытьПанельСвойств Тогда
			АктивироватьДеревоОсновнойКонфигурации(); // Антибаг Турбоконфа, который иногда ставит фокус не в эту панель
			ТурбоКонф.Ждать(10);
			ТекущееИмя = ТурбоКонф.ПолучитьИмяЭлемента();
			Успех = НижнееИскомоеИмя = ТекущееИмя; // ПолучитьRuntimeIdСтрокой() тут нельзя использовать, т.к. он может повторяться (видимо опирается на номер видимого элемента списка)
			Если Не Успех И ТурбоКонф.ПолучитьТипТекущегоЭлемента() = ТипЭлемента.ЭлементСписка Тогда
				Если БылВременныйСдвиг Тогда
					ТурбоКонф.Клавиша(Клавиши.Down); 
				КонецЕсли; 
				ОткрытьРезультатыПоиска();
				АктивироватьПанельСвойствОбъектаИзРезультатовПоиска();
				//ЗакрытьДочернееОкноКонфигуратора();
				Если ЛиПолноеИмяМакета(СсылкаСтроки, МодулиИР) Тогда
					АктивироватьСвойствоВПалитреСвойств("Макет");
					ТурбоКонф.Клавиша(Клавиши.Enter);
				ИначеЕсли ЛиПолноеИмяФормы(СсылкаСтроки, МодулиИР) Тогда
					АктивироватьСвойствоВПалитреСвойств("Форма");
					ТурбоКонф.Клавиша(Клавиши.Enter);
				ИначеЕсли МодулиИР.ирОбщий.СтрНайтиЛкс(СсылкаСтроки, ".Роль.") > 0 Тогда
					АктивироватьСвойствоВПалитреСвойств("Права");
					ТурбоКонф.Клавиша(Клавиши.Enter);
				Иначе
					ПоказатьВсплывающееУведомление("Не удалось перейти к """ + СсылкаСтроки + """, но открыта панель свойств объекта. Отключите фильтр по подсистемам в дереве метаданных.");
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
			Если Ложь
				Или МодулиИР.ирОбщий.СтрНайтиЛкс(СсылкаСтроки, ".Команда.") > 0 
				Или МодулиИР.ирОбщий.СтрНачинаетсяСЛкс(СсылкаСтроки, "ОбщаяКоманда.") 
				Или МодулиИР.ирОбщий.СтрНачинаетсяСЛкс(СсылкаСтроки, "ПодпискаНаСобытие.")
				Или МодулиИР.ирОбщий.СтрНачинаетсяСЛкс(СсылкаСтроки, "РегламентноеЗадание.")
			Тогда 
				ТурбоКонф.АльтКлавиша(Клавиши.Enter); 
				Сообщить("ИмяСвойства="+ИмяСвойства);
				Если ЗначениеЗаполнено(ИмяСвойства) Тогда
					ТурбоКонф.Ждать(20);
					АктивироватьСвойствоВПалитреСвойств(ИмяСвойства);
				КонецЕсли;
			ИначеЕсли Ложь
				Или СтрНачинаетсяС(СсылкаСтроки, "ОбщаяФорма.")
				Или СтрНачинаетсяС(СсылкаСтроки, "ОбщаяКартинка.")
				Или СтрНачинаетсяС(СсылкаСтроки, "ПакетXDTO.")
				Или СтрНачинаетсяС(СсылкаСтроки, "ОбщийМодуль.")
				Или СтрЧислоВхождений(СсылкаСтроки, ".") > 1
			Тогда
				ТурбоКонф.Клавиша(Клавиши.Enter); 
			ИначеЕсли СтрЧислоВхождений(СсылкаСтроки, ".") = 1 И СтрНачинаетсяС(СсылкаСтроки, "Перечисление.") Тогда
				ТурбоКонф.Клавиша(Клавиши.Multiply);
			КонецЕсли;
		КонецЕсли;
		// УстановитьБуферОбмена(СтароеЗначениеБуфераОбмена);
		Если ЗначениеЗаполнено(ПутьКЭлементуФормы) Тогда
			ЭтоУправляемаяФорма = АктивироватьСтраницуДиалогРедактораФормы();
			Если ЭтоУправляемаяФорма Тогда
				МаркерЭлементаФормы = "Элементы."; 
				Если Найти(ПутьКЭлементуФормы, МаркерЭлементаФормы) > 0 Тогда
					ИмяЭлементаФормы = Сред(ПутьКЭлементуФормы, СтрДлина(МаркерЭлементаФормы) + 1);
					НайтиСтрокуВОкне(ИмяЭлементаФормы);
					ИмяТекущегоЭлемента = ТурбоКонф.ПолучитьИмяЭлемента();
					Сообщить("ИмяТекущегоЭлемента=" + ИмяТекущегоЭлемента);
					Если ИмяТекущегоЭлемента <> ИмяЭлементаФормы + " Элемент" Тогда
						// Т.к. поиск делается по подстроке, то может быть найдено не то, что нужно. Поэтому оставляем дерево открытым.
						ПоказатьВсплывающееУведомление("Если найден неверный элемент, нажмите F3 для поиска следующего варианта");
					КонецЕсли;
				КонецЕсли;
			Иначе
				МаркерЭлементаФормы = "ЭлементыФормы."; 
				Если Найти(ПутьКЭлементуФормы, МаркерЭлементаФормы) > 0 Тогда
					ИмяЭлементаФормы = Сред(ПутьКЭлементуФормы, СтрДлина(МаркерЭлементаФормы) + 1);
					ИмяЭлементаФормы = " (" + ИмяЭлементаФормы + ") ";
					ТурбоКонф.КонтролШифтКлавиша(Клавиши.L); // Список элементов управления формы
					//ТурбоКонф.ЖдатьОкно("Список элементов управления формы", 1000, Истина); // Не работает
					Если НайтиУзелДерева(ПодключениеИР, ИмяЭлементаФормы) Тогда
						ТурбоКонф.Клавиша(Клавиши.Escape);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если СтрНачинаетсяС(ПутьКЭлементуФормы, "<") Тогда
				// Обработчик события
				ПутьКЭлементуФормы = МодулиИР.ирОбщий.ТекстБезКрайнихСимволовЛкс(ПутьКЭлементуФормы);
				ФрагментыПути = СтрРазделитьЛкс(ПутьКЭлементуФормы);
				ФрагментыПути.Удалить(0); // "Событие"
				ИмяЭлементаФормы = ФрагментыПути[0];
				Если ЭтоУправляемаяФорма Тогда
					Если ЗначениеЗаполнено(ИмяЭлементаФормы) Тогда
						НайтиСтрокуВОкне(ИмяЭлементаФормы);
						ИмяТекущегоЭлемента = ТурбоКонф.ПолучитьИмяЭлемента();
						Сообщить("ИмяТекущегоЭлемента=" + ИмяТекущегоЭлемента);
					Иначе
						ТурбоКонф.Клавиша(Клавиши.Home);
					КонецЕсли;
				Иначе
					Если ЗначениеЗаполнено(ИмяЭлементаФормы) Тогда
						ИмяЭлементаФормы = " (" + ИмяЭлементаФормы + ") ";
						ТурбоКонф.КонтролШифтКлавиша(Клавиши.L); // Список элементов управления формы
						Если НайтиУзелДерева(ПодключениеИР, ИмяЭлементаФормы) Тогда
							ТурбоКонф.Клавиша(Клавиши.Escape);
						КонецЕсли;
					Иначе
						ТурбоКонф.Клавиша(Клавиши.Escape); // Активируем никакой элемент формы, т.е. свойства самой формы
					КонецЕсли;
				КонецЕсли;
				ТурбоКонф.КонтролАльтКлавиша(Клавиши.Enter);
				АктивироватьСвойствоВПалитреСвойств(ФрагментыПути[ФрагментыПути.ВГраница()],, Истина);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ИмяЭлементаМакета) Тогда
			СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
			ТурбоКонф.ОткрытьМеню("Таблица", "Имена", "Имена...");
			ЖдатьСменуТекущегоЭлемента(СтарыйИД);
			Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Имена" Тогда
				УстановитьЗначениеПолюВвода(ИмяЭлементаМакета);
				КликнутьПоЭлементу("Выбрать", "кнопка");
				ТурбоКонф.Клавиша(Клавиши.Escape);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ИмяТипаХДТО) Тогда
			Если НайтиУзелДерева(ПодключениеИР, ИмяТипаХДТО, Истина) Тогда
				ТурбоКонф.Клавиша(Клавиши.Escape);
			КонецЕсли;
		КонецЕсли;
		Возврат Истина; 
	КонецЕсли;
	СтруктураСсылки = МодулиИР.ирОбщий.СтруктураСсылкиСтрокиМодуляЛкс(СсылкаСтроки);
	Если СтруктураСсылки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Модуль открывает только если точка останова уже была в списке до вызова команды. Иначе открывает модуль последней точки останова.
	// Не возращает успешность. Не поддерживает модули расширений и внешних обработок.
	// ТурбоКонф.ОткрытьМодуль(СсылкаСтроки, ИмяФайлаВнешнейОбработки); 
	// Возврат Истина;
	
	ЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	Если Ложь
		Или ЗаголовокОкна = "Событие" 
		Или ЗаголовокОкна = "Выражение"
	Тогда
		ЗакрытьМодальноеОкно();
	КонецЕсли;
	Успех = Ложь;
	НомерВерсииПлатформы = МодулиИР.ирКэш.НомерВерсииПлатформыЛкс();
	ИмяВременногоФайла = "";
	ОткрытьЧерезСписокТочекОстанова = Истина;
	Если ЗначениеЗаполнено(СтруктураСсылки.Расширение) Тогда
		// Пока есть проблема https://turboconf.ru/Tasks/10166
	Иначе
		ОткрытьЧерезСписокТочекОстанова = Ложь;
		Если ЛиПолноеИмяФормы(СтруктураСсылки.Модуль, МодулиИР) Тогда
			Если Не ОткрытьМодульЧерезПалитруСвойств("Форма", СтруктураСсылки.Модуль, Успех) Тогда
				Возврат Ложь;
			КонецЕсли;
			АктивироватьСтраницуМодульРедактораФормы();
		ИначеЕсли Ложь
			Или МодулиИР.ирОбщий.СтрНайтиЛкс(СтруктураСсылки.Модуль, ".Команда.") > 0 
			Или МодулиИР.ирОбщий.СтрНачинаетсяСЛкс(СтруктураСсылки.Модуль, "ОбщаяКоманда.") 
		Тогда
			Если Не ОткрытьМодульЧерезПалитруСвойств("Модуль команды", СтруктураСсылки.Модуль, Успех) Тогда
				Возврат Ложь;
			КонецЕсли;
		ИначеЕсли МодулиИР.ирОбщий.СтрНачинаетсяСЛкс(СтруктураСсылки.Модуль, "ОбщийМодуль.") Тогда
			Если Не ОткрытьМодульЧерезПалитруСвойств("Модуль", СтруктураСсылки.Модуль, Успех) Тогда
				Возврат Ложь;
			КонецЕсли;
		ИначеЕсли МодулиИР.ирОбщий.СтрКончаетсяНаЛкс(СтруктураСсылки.Модуль, ".МодульМенеджера") Тогда
			Если Не ОткрытьМодульЧерезПалитруСвойств("Модуль менеджера", СтруктураСсылки.Модуль, Успех) Тогда
				Возврат Ложь;
			КонецЕсли;
		ИначеЕсли МодулиИР.ирОбщий.СтрКончаетсяНаЛкс(СтруктураСсылки.Модуль, ".МодульОбъекта") Тогда
			Если Не ОткрытьМодульЧерезПалитруСвойств("Модуль объекта", СтруктураСсылки.Модуль, Успех) Тогда
				Возврат Ложь;
			КонецЕсли;
		ИначеЕсли МодулиИР.ирОбщий.СтрКончаетсяНаЛкс(СтруктураСсылки.Модуль, ".МодульНабораЗаписей") Тогда
			Если Не ОткрытьМодульЧерезПалитруСвойств("Модуль набора записей", СтруктураСсылки.Модуль, Успех) Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			ОткрытьЧерезСписокТочекОстанова = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ОткрытьЧерезСписокТочекОстанова Тогда
		// Через список точек останова
		ИмяВременногоФайла = СохранитьТочкиОстановаВФайл();
		Если Не ЗначениеЗаполнено(ИмяВременногоФайла) Тогда
			Возврат Ложь;
		КонецЕсли;
		ЛиНекорректнаяСсылка = Ложь;
		СтруктураСсылки = МодулиИР.ирКлиент.ДобавитьВФайлТочекОстановаЛкс(ИмяВременногоФайла, СсылкаСтроки);
		СтароеАктивноеОкно = Неопределено;
		Если Не ЗагрузитьФайлТочекОстанова(ИмяВременногоФайла, СтароеАктивноеОкно) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если НомерВерсииПлатформы < 803024 Тогда
			ЧислоКолонок = 3;
			ИмяЯчейки = СтруктураСсылки.УсловиеОстанова + " Условие";
		Иначе
			ЧислоКолонок = 4;
			ИмяЯчейки = "условие: " + СтруктураСсылки.УсловиеОстанова + " Условие срабатывания";
		КонецЕсли;
		НачМомент = ТекущаяДата();
		ПредСтрока = Неопределено;
		Пока ТекущаяДата() - НачМомент < 2 Цикл
			ТурбоКонф.Клавиша(Клавиши.Home);
			ТурбоКонф.Ждать(50); // Файл загружается асинхронно. Менее чем за 100мс он обычно не успевает загрузиться
			//ТурбоКонф.Клавиша(Клавиши.PageDown); // Нельзя так делать, т.к. первая строка может уйти за видимую область
			Пока Истина Цикл 
				Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Конфигуратор" Тогда
					ЛиНекорректнаяСсылка = Истина;
					Прервать;
				КонецЕсли; 
				Если ПустаяСтрока(ТурбоКонф.ПолучитьИмяЭлемента()) Тогда
					Прервать;
				КонецЕсли;
				ТекстПоследнейСтроки = ИдентификаторТекущегоЭлементаОкна();
				ВидимыеЭлементы = ПолучитьВидимыеЭлементыСписка();
				Если ВидимыеЭлементы <> Неопределено Тогда
					ТекстПоследнейСтроки = ТекстПоследнейСтроки + "," + СтрСоединить(ВидимыеЭлементы.ИменаЭлементов, ",");
				КонецЕсли;
				Если ПредСтрока = ТекстПоследнейСтроки Тогда
					// Дошли до конца таблицы
					Прервать;
				КонецЕсли;
				ПредСтрока = ТекстПоследнейСтроки;
				// МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
				Если КликнутьПоЭлементу(ИмяЯчейки, Неопределено) Тогда // Было 1000мс (исправлено). Иногда возвращает ложь, хотя клик выполняет
					// Сообщить("Время клика " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска));
					//ТурбоКонф.Клавиша(Клавиши.Escape);
					Успех = Истина;
					Прервать;
				Иначе
					ТурбоКонф.Клавиша(Клавиши.PageDown);
					ТурбоКонф.Ждать(20);
				КонецЕсли;
			КонецЦикла;
			Если Успех Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не Успех Тогда
			Если ЛиНекорректнаяСсылка Тогда
				ЗакрытьМодальноеОкно();
				ПоказатьВсплывающееУведомление("Модуль не найден: " + СтруктураСсылки.Модуль);
				ЗакрытьДочернееОкноКонфигуратора();
			КонецЕсли;
			// ТурбоКонф.Клавиша(Клавиши.Escape);
		Иначе
			СтароеОкно = ТурбоКонф.ПолучитьАктивноеОкно();
			//ТурбоКонф.Клавиша(Клавиши.Return); // В 8.3.20- не работает TODO переделать на КликПоЭлементу. В 8.3.24+ не работает.
			КликнутьПоЭлементу("Перейти к исходному коду", "кнопка");
			НачМомент = ТекущаяДата();
			Пока ТекущаяДата() - НачМомент < 2 И Не ЭтоДокумент() Цикл
				ТурбоКонф.Ждать(20);
			КонецЦикла;
			ТурбоКонф.Клавиша(Клавиши.F9);
			ТурбоКонф.Ждать(20);
			Если СтруктураСсылки.НомерСтроки > 1 Тогда
				ТурбоКонф.ШифтКлавиша(Клавиши.End);
			КонецЕсли;
			Если НомерВерсииПлатформы >= 803024 Тогда
				ТурбоКонф.Клавиша(Клавиши.F9);
				ТурбоКонф.АльтКлавиша(Клавиши.F9);
				ЗакрытьДочернееОкноКонфигуратора();
			КонецЕсли;
			Попытка
				СтарыйИД = ИдентификаторТекущегоЭлементаОкна(); // Тут часто возвникает ошибка - Время ожидания операции истекло. (Исключение из HRESULT: 0x80131505)
			Исключение
			КонецПопытки; 
			ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 200, Ложь);
			//ТурбоКонф.Ждать(200); // Иначе может вернуться пустой текст модуля
		КонецЕсли;
	КонецЕсли;
	
	Если Успех Тогда
		БлокРазвернут = Ложь;
		ИмяМетода = СтруктураСсылки.Метод;
		ТекстМодуля = ТурбоКонф.ПолучитьТекстМодуля(ВыделенныйТекст, ПозицияВТексте);
		Если Не ЗначениеЗаполнено(ТекстМодуля) Тогда
			ПоказатьВсплывающееУведомление("Получен пустой текст модуля", 3000);
		Иначе
			ЗапомнитьСтаруюПозицию = ЗначениеЗаполнено(ПозицияВТексте); // Вредно замоминать нулевую позицию
			ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,, Истина,,,,,, Истина, СсылкаСтроки);
			ПерейтиВПозицию(,, ПолеТекстаПрограммы,, ЗапомнитьСтаруюПозицию);
			Если Истина
				И ЗначениеЗаполнено(ИмяМетода)
				И (Ложь
					Или СтруктураСсылки.СмещениеСтрокиМетода <> 0
					Или Найти(НРег(ВыделенныйТекст), НРег(" " + ИмяМетода + "(")) = 0)
			Тогда
				БлокРазвернут = Истина;
				ВыполнитьКомандуИзСсылкиПослеПерехода(ПолеТекстаПрограммы, СтруктураСсылки);
			КонецЕсли;
			Если Не БлокРазвернут Тогда 
				РазвернутьБлокМодуля(,, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяВременногоФайла) Тогда
		УдалитьФайлы(ИмяВременногоФайла); // Нельзя сразу делать, т.к. загрузка идет асинхронно
	КонецЕсли;
	ТурбоКонф.ОтжатьМодификаторы(); // Иначе будет иногда залипать CTRL после перехода из формы приложения ИР к строке модуля, например после первого в окне конфигуратора вызова "Перейти в последние методы"
	Возврат Успех;

КонецФункции

Процедура АктивироватьПанельСвойствОбъектаИзРезультатовПоиска() Экспорт
	ТурбоКонф.Клавиша(Клавиши.Enter);
	ТурбоКонф.АльтКлавиша(Клавиши.Enter);
КонецПроцедуры

Функция ЗагрузитьФайлТочекОстанова(Знач ИмяФайла, Знач СтароеАктивноеОкно = Неопределено) Экспорт
	Результат = ОткрытьФайл(ИмяФайла, "Загрузить точки останова из файла", СтароеАктивноеОкно);
	Возврат Результат;
КонецФункции

//.
// Параметры:
//   СсылкаСтроки - Строка - 
//   МодулиИР - Application {V83.Application}, Неопределено - 
// Возвращаемое значение:
//   Булево - 
Функция ЛиПолноеИмяМакета(Знач СсылкаСтроки, Знач МодулиИР) Экспорт
	Результат = Ложь
		Или МодулиИР.ирОбщий.СтрНайтиЛкс(СсылкаСтроки, ".Макет.") > 0
		Или МодулиИР.ирОбщий.СтрНачинаетсяСЛкс(СсылкаСтроки, "ОбщийМакет.") > 0;
	Возврат Результат;
КонецФункции

//.
// Параметры:
//   СсылкаСтроки - Строка - 
//   МодулиИР - Application {V83.Application}, Неопределено - 
// Возвращаемое значение:
//   Булево - 
Функция ЛиПолноеИмяФормы(Знач СсылкаСтроки, Знач МодулиИР) Экспорт
	Результат = Ложь
		Или МодулиИР.ирОбщий.СтрНайтиЛкс(СсылкаСтроки, ".Форма.") > 0
		Или МодулиИР.ирОбщий.СтрНачинаетсяСЛкс(СсылкаСтроки, "ОбщаяФорма.") > 0;
	Возврат Результат;
КонецФункции

// .
// Возвращаемое значение:
//   Булево - ЭтоУправляемаяФорма
Функция АктивироватьСтраницуДиалогРедактораФормы() Экспорт
	СтарыйТипЭлементаИнтерфейса = "";
	Для Сч=1 По 3 Цикл
		ТипЭлементаИнтерфейса = ПолучитьТипТекущегоЭлемента();
		ЭтоУправляемаяФорма = ТипЭлементаИнтерфейса = СтарыйТипЭлементаИнтерфейса;
		Если ЭтоУправляемаяФорма Или СтарыйТипЭлементаИнтерфейса = ТипЭлемента.Документ Тогда
			Прервать;
		КонецЕсли;
		СтарыйТипЭлементаИнтерфейса = ТипЭлементаИнтерфейса;
		ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
		ТурбоКонф.Ждать(20);
	КонецЦикла;
	Если ЭтоУправляемаяФорма Тогда
		ТурбоКонф.АльтКлавиша(Клавиши.D3); // Активируем странцу "Форма" редактора формы и в ней таблицу "Элементы"
		//ТурбоКонф.АльтКлавиша(Клавиши.D4); // Активируем странцу "Форма" редактора формы и в ней таблицу "Реквизиты"
		ТурбоКонф.Ждать(30);
	КонецЕсли;
	Возврат ЭтоУправляемаяФорма;
КонецФункции 

Процедура АктивироватьСтраницуМодульРедактораФормы() Экспорт
	СтарыйТипЭлементаИнтерфейса = "";
	Для Сч=1 По 3 Цикл
		ТипЭлементаИнтерфейса = ПолучитьТипТекущегоЭлемента();
		ЭтоУправляемаяФорма = ТипЭлементаИнтерфейса = СтарыйТипЭлементаИнтерфейса;
		Если ЭтоУправляемаяФорма Или ТипЭлементаИнтерфейса = ТипЭлемента.Документ Тогда
			Прервать;
		КонецЕсли;
		СтарыйТипЭлементаИнтерфейса = ТипЭлементаИнтерфейса;
		ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
		ТурбоКонф.Ждать(20);
	КонецЦикла;
	Если ЭтоУправляемаяФорма Тогда
		Если ТипЭлементаИнтерфейса <> ТипЭлемента.Документ Тогда
			ТурбоКонф.АльтКлавиша(Клавиши.D2); // Активируем странцу "Модуль" редактора формы
			ТурбоКонф.Ждать(50);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

Функция ОткрытьМодульЧерезПалитруСвойств(Знач ИмяСвойстваМодуля, Знач Модуль, выхУспех) Экспорт
	Если Не ПерейтиПоСсылкеМД(СтрокаБезПоследнегоФрагментаЛкс(Модуль),,, Истина) Тогда
		Возврат Ложь;
	КонецЕсли;
	АктивироватьСвойствоВПалитреСвойств(ИмяСвойстваМодуля);
	//КликнутьПоЭлементу("Открыть", "ссылка"); // Не работает
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ТурбоКонф.Клавиша(Клавиши.Enter);
	ЖдатьСменуТекущегоЭлемента(СтарыйИД, 100);
	ЖдатьАктивацииДокумента();
	выхУспех = Истина;
	Возврат Истина;
КонецФункции

Процедура ЖдатьАктивацииДокумента(Знач ДлительностьОжидания = 100) Экспорт
	АтомВремени = 10;
	Для Сч=1 По ДлительностьОжидания/АтомВремени Цикл
		Если ПолучитьТипТекущегоЭлемента() = ТипЭлемента.Документ Тогда
			Прервать;
		КонецЕсли;
		ТурбоКонф.Ждать(АтомВремени);
		Прервать;
	КонецЦикла;
КонецПроцедуры

//.
// Параметры:
//   МодулиИР - Application {V83.Application}, Неопределено - 
//   Текст - Строка - 
// Возвращаемое значение:
//   ТаблицаЗначений - COM
Функция НайтиОбъектыМДВТекстеОкнаСообщений(МодулиИР, Знач Текст) Экспорт
	Возврат МодулиИР.ирОбщий.НайтиРегВыражениеЛкс(Текст, "^Объект ""([^""]+)"" (использован)?", "", Истина, Истина, Истина);
КонецФункции

//.
// Параметры:
//   ПодключениеИР -  - 
//   ТекстИскомогоЭлемента -  - 
//   СвернутьДерево -  - 
// Возвращаемое значение:
//   Булево - успех
Функция НайтиУзелДерева(Знач ПодключениеИР = Неопределено, Знач ТекстИскомогоЭлемента, Знач СвернутьДерево = Ложь) Экспорт
	Если СвернутьДерево Тогда
		ПутьСтарый = ПутьВДеревеТабличногоПоля(ПодключениеИР);
	КонецЕсли;
	НайтиСтрокуВОкне(ТекстИскомогоЭлемента, Истина);
	ИмяТекущегоЭлемента = ТурбоКонф.ПолучитьИмяЭлемента();
	Сообщить("ИмяТекущегоЭлемента=" + ИмяТекущегоЭлемента);
	Успех = ИмяТекущегоЭлемента = ТекстИскомогоЭлемента;
	Если Не Успех Тогда
		ПоказатьВсплывающееУведомление("Если найден неверный элемент, нажмите F3 для поиска следующего варианта");
	КонецЕсли;
	Если СвернутьДерево Тогда
		СвернутьДругиеСтроки(ПутьСтарый);
	КонецЕсли;
	Возврат Успех;
КонецФункции

//.
// Параметры:
//   ИскомаяСтрока -  - 
//   РазвернутьДеревоИПерейтиВНачало -  - 
//   ЖдатьЧерезЗаголовокОкна -  - 
// Возвращаемое значение:
//   Булево - 
Функция НайтиСтрокуВОкне(Знач ИскомаяСтрока, Знач РазвернутьДеревоИПерейтиВНачало = Ложь, Знач ЖдатьЧерезЗаголовокОкна = Истина) Экспорт
	Если ЛиТаблицаПуста() Тогда
		Возврат Ложь;
	КонецЕсли;
	Если РазвернутьДеревоИПерейтиВНачало Тогда
		РазвернутьДеревоИПерейтиВНачало();
	КонецЕсли; 
	//Сообщить("ИскомаяСтрока=" + ИскомаяСтрока);
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ТурбоКонф.КонтролКлавиша(Клавиши.F);
	Если ЖдатьЧерезЗаголовокОкна Тогда
		ТурбоКонф.ЖдатьОкно("Поиск", 1000, Истина, Истина); // Где то не работало
	Иначе
		ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 1000, Истина); // Не работает в окне "Выбор типа данных" (из окна "Редактирование параметров выбора") и "Выбор объекта"
	КонецЕсли;
	//УстановитьЗначениеПолюВвода(ИскомаяСтрока); // Тут нет смысла в этом более затратном способе, т.к. и без него модифицированность включается
	ТурбоКонф.УстановитьЗначение(ИскомаяСтрока);
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ТурбоКонф.Клавиша(Клавиши.Enter);
	ЖдатьСменуТекущегоЭлемента(СтарыйИД);
	Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Конфигуратор" Тогда
		// Могли уже стоять в строке с вхождением
		КликнутьПоЭлементу("OK", "кнопка");
	КонецЕсли;
	ТекстЯчейки = ТурбоКонф.ПолучитьИмяЭлемента();
	//Сообщить("ТекстЯчейки"+ТекстЯчейки);
	Результат = Найти(ТекстЯчейки, ИскомаяСтрока) > 0;
	Возврат Результат;
КонецФункции  

Функция НайтиОбъектМетаданныхВДереве(Знач ПолноеИмяОбъекта) Экспорт
	ИмяОбъекта = ПоследнийФрагментЛкс(ПолноеИмяОбъекта);
	ТурбоКонф.КонтролКлавиша(Клавиши.F);
	ТурбоКонф.ЖдатьОкно("Поиск объектов метаданных", 1000, Истина);
	//УстановитьЗначениеПолюВвода(ИскомаяСтрока); // Тут нет смысла в этом более затратном способе, т.к. и без него модифицированность включается
	ТурбоКонф.УстановитьЗначение(ИмяОбъекта);

	// Вроде бы этот вариант быстрее
	ТурбоКонф.Клавиша(Клавиши.Tab);
	Если Не ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Истина); // Включаем "Искать в именах"
	КонецЕсли;
	ТурбоКонф.Клавиша(Клавиши.Tab);
	Если ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Ложь); // Выключаем "Искать в синонимах"
	КонецЕсли;
	ТурбоКонф.Клавиша(Клавиши.Tab);
	Если ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Ложь); // Выключаем "Искать в комментариях"
	КонецЕсли;
	ТурбоКонф.Клавиша(Клавиши.Tab);
	Если ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Ложь); // Выключаем "Учитывать регистр"
	КонецЕсли;
	ТурбоКонф.Клавиша(Клавиши.Tab);
	Если Не ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Истина); // - Слово целиком
	КонецЕсли;   
	//
	//ТурбоКонф.УстановитьФокусНаЭлемент("Именах", "флажок");
	//ТурбоКонф.УстановитьСостояниеФлажка(Истина);
	//ТурбоКонф.УстановитьФокусНаЭлемент("Синонимах", "флажок");
	//ТурбоКонф.УстановитьСостояниеФлажка(Ложь);
	//ТурбоКонф.УстановитьФокусНаЭлемент("Комментариях", "флажок");
	//ТурбоКонф.УстановитьСостояниеФлажка(Ложь);
	//ТурбоКонф.УстановитьФокусНаЭлемент("Учитывать регистр", Ложь);
	//ТурбоКонф.УстановитьСостояниеФлажка(Ложь);
	//ТурбоКонф.УстановитьФокусНаЭлемент("Слово целиком", "флажок");
	//ТурбоКонф.УстановитьСостояниеФлажка(Истина); 
	
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ТурбоКонф.Клавиша(Клавиши.Enter);
	ЖдатьСменуТекущегоЭлемента(СтарыйИД);
	ОткрытьРезультатыПоиска();
	ТурбоКонф.Ждать(10);
	Успех = НайтиСтрокуВОкне(ПолноеИмяОбъекта);
	Если Успех Тогда
		АктивироватьПанельСвойствОбъектаИзРезультатовПоиска();
	КонецЕсли;
	Возврат Успех;
КонецФункции

Функция ПоследнийФрагментЛкс(Знач ПолноеИмяОбъекта, Знач Разделитель = ".") Экспорт
	Фрагменты = СтрРазделитьЛкс(ПолноеИмяОбъекта, Разделитель);
	ИмяОбъекта = Фрагменты[Фрагменты.ВГраница()];
	Возврат ИмяОбъекта;
КонецФункции

Процедура РазвернутьДеревоИПерейтиВНачало() Экспорт
	ТурбоКонф.Клавиша(Клавиши.Home);
	ТурбоКонф.КонтролШифтКлавиша(Клавиши.Add);
	ТурбоКонф.Клавиша(Клавиши.Add); // Для окна "Выражение"
КонецПроцедуры

Процедура СвернутьДеревоИПерейтиВНачало() Экспорт
	ТурбоКонф.Клавиша(Клавиши.Home);
	ТурбоКонф.КонтролШифтКлавиша(Клавиши.Subtract);
КонецПроцедуры

//.
// Параметры:
//    ПолеТекстаПрограммы - ОбработкаОбъект.ирКлсПолеТекстаПрограммы - 
//    СсылкаСтроки - Структура - 
Процедура ВыполнитьКомандуИзСсылкиПослеПерехода(Знач ПолеТекстаПрограммы, Знач СтруктураСсылки) Экспорт
	Если Истина
		И СтруктураСсылки <> Неопределено
		И СтруктураСсылки.Команда = "ПодавитьПроверки" 
	Тогда
		СтрокаТекста = ПолеТекстаПрограммы.ПолеТекста.ПолучитьСтроку(ПолеТекстаПрограммы.мКонечнаяСтрока);
		Сообщить("Строка текста = " + СтрокаТекста);
		ИнструкцияПодавленияПроверки = ПолеТекстаПрограммы.ИнструкцияПодавленияПроверки();
		Если Найти(СтрокаТекста, ИнструкцияПодавленияПроверки) = 0 Тогда
			ТурбоКонф.Клавиша(Клавиши.End);
			ТурбоКонф.ВставитьТекст(" " + ИнструкцияПодавленияПроверки);
		КонецЕсли;
	ИначеЕсли Истина
		И СтруктураСсылки <> Неопределено
		И СтрНачинаетсяС(СтруктураСсылки.Команда, "УказатьВызывающийМодуль:")
	Тогда
		ВызывающийМодуль = СтрРазделить(СтруктураСсылки.Команда, ":")[1];
		ПолеТекстаПрограммы.УказатьВызывающийМодуль(ВызывающийМодуль);
		Если ПолеТекстаПрограммы.мЗамещающийФрагмент = Неопределено Тогда
			ПередатьГраницыВыделенияИзПолеТекстаПрограммы(ПолеТекстаПрограммы);
		Иначе
			ПередатьИзмененияИзПоляТекстаВОкноМодуля(ПолеТекстаПрограммы, Ложь, Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция СохранитьТочкиОстановаВФайл() 
	Попытка
		СтарыйИД = ИдентификаторТекущегоЭлементаОкна(); // Тут часто возвникает ошибка - Время ожидания операции истекло. (Исключение из HRESULT: 0x80131505)
	Исключение
	КонецПопытки; 
	СтароеАктивноеОкно = ТурбоКонф.ПолучитьАктивноеОкно();
	ТурбоКонф.АльтКлавиша(Клавиши.F9); 
	
	// Такой способ не совместим с прикрепленным режимом окна в 8.3.24+
	//Окно = ТурбоКонф.ЖдатьОкно("Точки останова", 3000, Истина); // На 8.3.23- окно можно открываться очень долго, если есть точка останова из большого расширения (например ИР), которое не открыто
	//Если Окно = 0 Тогда
	//	Возврат "";
	//КонецЕсли;
	//
	ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 3000, Истина); // На 8.3.23- окно можно открываться очень долго, если есть точка останова из большого расширения (например ИР), которое не открыто
	
	//СтарыйИД = ТурбоКонф.ПолучитьRuntimeId();
	ТурбоКонф.Ждать(20);
	ТурбоКонф.КонтролКлавиша(Клавиши.s);
	Окно = ТурбоКонф.ЖдатьОкно("Сохранить точки останова в файл", 2000, Истина);
	Если Окно = 0 Тогда
		Возврат "";
	КонецЕсли;
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ТурбоКонф.УстановитьЗначение(ИмяВременногоФайла);
	ТурбоКонф.Клавиша(Клавиши.Enter);
	НачМомент = ТекущаяДата();
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	Пока ТекущаяДата() - НачМомент < 2 Цикл
		Попытка
			ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
			Прервать;
		Исключение
		КонецПопытки;
		ТурбоКонф.Ждать(20);
	КонецЦикла;
	Если ПустаяСтрока(ТекстовыйДокумент.ПолучитьТекст()) Тогда
		УдалитьФайлы(ИмяВременногоФайла);
		Возврат "";
	КонецЕсли;
	Возврат ИмяВременногоФайла; 
КонецФункции

Функция ОткрытьФайл(Знач ИмяФайла, Знач Заголовок = "Открытие", СтароеАктивноеОкно = Неопределено)
	ТурбоКонф.КонтролКлавиша(Клавиши.o);
	Окно = ТурбоКонф.ЖдатьОкно(, 1000, Истина);
	Если Окно = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	ТурбоКонф.УстановитьЗначение(ИмяФайла);
	//СтарыйИД = ИдентификаторТекущегоЭлементаОкна(); // Тут часто возникает ошибка - Время ожидания операции истекло. (Исключение из HRESULT: 0x80131505)
	СтароеАктивноеОкно = ТурбоКонф.ПолучитьАктивноеОкно();
	ТурбоКонф.Клавиша(Клавиши.Enter);  
	Если Не ЖдатьПотерюАктивностиОкна(СтароеАктивноеОкно) Тогда
		Возврат Ложь;
	КонецЕсли;
	//// Загрузка выполняется асинхронно. Поэтому тут не будем проверять успешность загрузки
	//Попытка
	//	СтарыйИД = ИдентификаторТекущегоЭлементаОкна(); // Тут часто возвникает ошибка - Время ожидания операции истекло. (Исключение из HRESULT: 0x80131505)
	//Исключение
	//КонецПопытки; 
	Возврат Истина;
КонецФункции

Процедура ВставитьТочкиОстановаИзРезультатовПоиска()
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ТурбоКонф.Ждать(20);
	ЯчейкиТекущейСтроки = ЯчейкиТекущейСтроки(5);
	ЗакрытьДочернееОкноКонфигуратора();
	ОткрытьРезультатыПоиска();
	//Текст = ВыделенныйТекст(); // Платформа всегда копирует все строки
	ОткрытьКонтекстноеМеню();
	КликнутьПоЭлементу("Вывести список...", "элемент меню");
	ТурбоКонф.ЖдатьОкно("Вывести список", 1000, Истина);
	ЗакрытьМодальноеОкно(, Клавиши.Enter, Истина);
	КомандаВыделитьВсе();
	ТурбоКонф.Копировать();
	Текст = ТурбоКонф.ПолучитьБуферОбмена();
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	ТурбоКонф.Ждать(20);
	ЗакрытьДочернееОкноКонфигуратора();
	ИмяФайла = СохранитьТочкиОстановаВФайл();
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь); 
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	Если ЯчейкиТекущейСтроки.Количество() Тогда
		МодульТочки = СтрЗаменить(ЯчейкиТекущейСтроки[1], " Имя модуля", "");
		НомерСтрокиТочки = СтрЗаменить(ЯчейкиТекущейСтроки[2], " Строка", "");
	КонецЕсли;
	МодулиИР.ирКлиент.ДобавитьВФайлТочекОстановаРезультатыПоискаКонфигуратораЛкс(ИмяФайла, Текст, МодульТочки, НомерСтрокиТочки);
	ОткрытьФайл(ИмяФайла, "Загрузить точки останова из файла");
КонецПроцедуры

// После открытия контекстного меню текущий элемент не сразу меняется. Поэтому опасно вызывать ЖдатьСменуТекущегоЭлемента
Процедура ОткрытьКонтекстноеМеню() Экспорт
	ТурбоКонф.КонтролШифтКлавиша(Клавиши.F10);
	ТурбоКонф.Ждать(30); // 30 иногда не хватает см. ВставитьТочкиОстановаИзРезультатовПоиска
КонецПроцедуры

// Если сработает, то сбрасывает выделение. Поэтому после выполения выделение переустанавливается.
// Поэтому настоятельно рекомендуется передавать НачалоВыделения и КонецВыделения
Процедура РазвернутьБлокМодуля(Знач НачалоВыделения = 0, Знач КонецВыделения = 0, Знач ВыделитьВсюСтроку = Ложь, Знач Строгое = Ложь)
	
	ТурбоКонф.КонтролКлавиша(Клавиши.Add);
	Если Не ЗначениеЗаполнено(КонецВыделения) Тогда
		КонецВыделения = НачалоВыделения;
	КонецЕсли;
	Если Ложь
		Или ВыделитьВсюСтроку 
		Или ТурбоКонф.ПолучитьВерсиюAPI() < 6 
		Или ТурбоКонф.РежимСовместимости()
	Тогда
		ТурбоКонф.Ждать(20);
		ТурбоКонф.ШифтКлавиша(Клавиши.End);
	Иначе 
		// Чтобы свернутый блок, внутри которого скрыта строка, развернулся
		ТурбоКонф.КонтролКлавиша(Клавиши.Left);
		ТурбоКонф.КонтролКлавиша(Клавиши.Right);

		// Неудобное позиционирование https://turboconf.ru/Tasks/8888
		Если ЗначениеЗаполнено(КонецВыделения) Тогда
			ТурбоКонф.ВыделитьТекст(НачалоВыделения, КонецВыделения);
		КонецЕсли;
		Если Не Строгое И НачалоВыделения = КонецВыделения Тогда
			ВыделитьТекущееСловоПоляДокумента();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ОткрытьОкноВыражения(выхПолеТекстаПрограммы = Неопределено, выхВыражение = "")
	Если Не ЭтоДокумент() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	выхПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь,, Истина); // Для сохранения контекста в кэше 
	Если выхПолеТекстаПрограммы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	// ТурбоКонф.АктивироватьОкно(Конфигуратор.ОкноВызоваСкрипта); // Так почему то не всегда затем получается заголовок модального окна
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	ТурбоКонф.ШифтКлавиша(Клавиши.F9);
	Попытка
		ТурбоКонф.ЖдатьОкно("Выражение", 1000, Истина);
	Исключение
		Возврат Неопределено; 
	КонецПопытки;
	Если ЗначениеЗаполнено(ВыделенныйТекст) Тогда
		выхВыражение = ВыделенныйТекст;
	Иначе 
		выхВыражение = выхПолеТекстаПрограммы.мКонтекст;
	КонецЕсли; 
	Если Прав(выхВыражение, 1) = "(" Тогда
		выхВыражение = выхВыражение + ")";
	КонецЕсли;
	// Окно сначала появляется, а затем берет фокус, даже не смотря на то, что оно модальное
	//МоментНачала = ТекущаяДата();
	//Пока ТекущаяДата() - МоментНачала = 0 Цикл
	//	Успех = Истина;
	//	Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = ЦелевойЗаголовок Тогда
	//		Прервать;
	//	КонецЕсли;
	//	Успех = Ложь;
	//	ТурбоКонф.Ждать(50);
	//КонецЦикла;
	Возврат ПодключениеИР;
КонецФункции

//&ВосстанавливатьБуферОбмена
Процедура ВычислитьВыражение() 
	Сообщить("Команда.ВычислитьВыражение");
	Если Не ПроверитьРазрешениеИР() Тогда
		ПродолжитьОбработкуНажатияКлавиш();
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	БазовоеВыражение = "";
	Если Не ЭтоДокумент() И ЛиАктивноГлавноеОкно() Тогда
		ВидимыеЭлементы = ПолучитьВидимыеЭлементыСписка(Истина);
		Если Истина
			И ВидимыеЭлементы <> Неопределено 
			И ВидимыеЭлементы.ИменаЭлементов.Количество() > 0
		Тогда
			ИмяКолонки = " Выражение";
			ИмяЭлемента = ВидимыеЭлементы.ИменаЭлементов[0];
			Если Найти(ИмяЭлемента, ИмяКолонки) > 0 Тогда
				// Это ячейка окна "Табло"
				БазовоеВыражение = СтрокаБезПоследнегоФрагментаЛкс(ЯчейкиТекущейСтрокиСпискаИзВидимыхЭлементов(ВидимыеЭлементы, 3)[0], ИмяКолонки);
				//ПерейтиКТекущейСтрокеИсполнения();
				ТурбоКонф.Клавиша(Клавиши.Escape);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ПолеТекстаПрограммы = Неопределено; // ОбработкаОбъект.ирКлсПолеТекстаПрограммы
	ТекстПоля = "";
	ПодключениеИР = ОткрытьОкноВыражения(ПолеТекстаПрограммы, ТекстПоля); 
	Если ПодключениеИР = Неопределено Тогда
		ПоказатьВсплывающееУведомление("Команда применима только во время остановки отладки в редакторе модуля или табло");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ТекстПоля) Тогда
		ТекстПоля = ТурбоКонф.ПолучитьЗначение();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(БазовоеВыражение) Тогда
		БазовоеВыражение = ТекстПоля;
	КонецЕсли;
	Если ПустаяСтрока(БазовоеВыражение) Тогда
		Возврат;
	КонецЕсли;
	Если БазовоеВыражение = ТекстПоля Тогда
		ТурбоКонф.Ждать(20);
		УстановитьФокусВПервуюТаблицуИлиСписок(); 
		МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Пока Истина Цикл
			ВидимыеЭлементы = ПолучитьВидимыеЭлементыСписка();
			Если Ложь
				Или ВидимыеЭлементы = Неопределено
				Или ВидимыеЭлементы.ИменаЭлементов.Количество() > 0
				Или ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала > 100 // Длительность ожидания
			Тогда
				Прервать;
			КонецЕсли;
			ТурбоКонф.Ждать(20);
		КонецЦикла;
		Если Истина
			И ВидимыеЭлементы <> Неопределено
			И ВидимыеЭлементы.ИменаЭлементов.Количество() > 0
		Тогда
			ТипЗначения = СтрокаБезПоследнегоФрагментаЛкс(ВидимыеЭлементы.ИменаЭлементов[2], " ");
			ТекстЯчейкиВыражения = ВидимыеЭлементы.ИменаЭлементов[0];
			Сообщить("ТипЗначенияПервичный="+ ТипЗначения);
			Сообщить("ТекстЯчейкиВыражения="+ ТекстЯчейкиВыражения);
			Если ВидимыеЭлементы.ИменаЭлементов[0] <> ТекстПоля + " Свойство" Тогда
				ТипЗначения = "";
			КонецЕсли;
			Если Ложь
				Или Найти(ТекстЯчейкиВыражения, Символы.ПС) > 0
				Или ТипЗначения = "Строка"
				Или ТипЗначения = "Число"
				Или ТипЗначения = "Булево" 
				Или ТипЗначения = "Дата"
				Или ТипЗначения = "Неопределено"
			Тогда
				ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
				ТурбоКонф.Клавиша(Клавиши.End);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ТекстВызова = ТекстВызоваФункцииРежимаОтладки(ПолеТекстаПрограммы, "РасширенноеПредставлениеЛкс");
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	Если Истина
		И Не СтрНачинаетсяС(БазовоеВыражение, ТекстВызова) 
		И ЛиТипИмеетРасширенноеПредставление(ТипЗначения)
	Тогда
		Выражение = ТекстВызова + "(" + БазовоеВыражение + ",, 1, 1 ,1 , 1,, 1)";
		УстановитьЗначениеПолюВвода(Выражение);
		ТекстыЯчеек = ЖдатьВычислениеВыражения();
		Если ЗначениеЗаполнено(ТекстыЯчеек[1]) Тогда 
			РасширенноеПредставление = МодулиИР.ирОбщий.ТекстИзВстроенногоЯзыкаЛкс(ТекстыЯчеек[1]);
			Сообщить("РасширенноеПредставлениеИсходное=" + РасширенноеПредставление);
			ИмяТипа = МодулиИР.ирОбщий.ТекстМеждуМаркерамиЛкс(РасширенноеПредставление, ")", ":");
			Если Истина
				И ЗначениеЗаполнено(РасширенноеПредставление)
				И РасширенноеПредставление <> "(*)" 
				//И Найти(РасширенноеПредставление, "(") > 0
				И ЛиТипИмеетРасширенноеПредставление(ИмяТипа)
			Тогда
				ТурбоКонф.ПоказатьПодсказку(РасширенноеПредставление);
				РасширенноеПредставление = СтрЗаменить(РасширенноеПредставление, ИмяТипа + ": ", ": ");
				ПоказатьВсплывающееУведомление(БазовоеВыражение + " = " + Символы.ПС + РасширенноеПредставление, 3000);
			КонецЕсли;
		КонецЕсли;
		ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	КонецЕсли;
	Если ЗначениеЗаполнено(БазовоеВыражение) Тогда
		УстановитьЗначениеПолюВвода(БазовоеВыражение);
		УстановитьФокусВПервуюТаблицуИлиСписок();
		ТурбоКонф.Клавиша(Клавиши.Add);
		ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
		ТурбоКонф.Клавиша(Клавиши.End)
	КонецЕсли;  
	
КонецПроцедуры

//.
// Параметры:
//   ПолеТекстаПрограммы - ОбработкаОбъект.ирКлсПолеТекстаПрограммы - 
//   ИмяФункцииМодуля - Строка - 
// Возвращаемое значение:
//   Массив - 
Функция ТекстВызоваФункцииРежимаОтладки(Знач ПолеТекстаПрограммы, Знач ИмяФункцииМодуля) Экспорт
	ТекстВызова = СтрРазделить(ПолеТекстаПрограммы.ВычисляемыйКонтекстОтладчика(), "*")[0] + ИмяФункцииМодуля;
	Возврат ТекстВызова;
КонецФункции

//.
// Параметры:
//   ТекстЯчейкиТипЗначения - Строка - 
// Возвращаемое значение:
//    - 
Функция ЛиТипИмеетРасширенноеПредставление(Знач ТипЗначения) Экспорт
	Результат = Истина
		И ТипЗначения <> "Строка"
		И ТипЗначения <> "Число"
		И ТипЗначения <> "Булево" 
		И ТипЗначения <> "Дата"
		И ТипЗначения <> "Неопределено"
		И ТипЗначения <> "Структура"
		И ТипЗначения <> "ДанныеФормыСтруктура"
		И ТипЗначения <> "СтрокаТаблицыЗначений"
		И ТипЗначения <> "СтрокаДереваЗначений"
		И ТипЗначения <> "ДанныеФормыЭлементКоллекции";
	Возврат Результат;
КонецФункции

// 6.3.9130.13871
Функция ПолучитьВидимыеЭлементыСписка(Знач РасширеннаяИнформация = Ложь) Экспорт
	Если ЛиТаблицаПуста() Тогда
		// Антибаг против пустой таблицы https://turboconf.ru/Tasks/10009
		Возврат Новый Структура("ИменаЭлементов, ГраницыЭлементов, ИндексТекущегоЭлемента", Новый Массив, Новый Массив);
	КонецЕсли;
	Попытка
		ВидимыеЭлементы = ТурбоКонф.ПолучитьВидимыеЭлементыСписка(РасширеннаяИнформация);
	Исключение
		ВидимыеЭлементы = Неопределено;
	КонецПопытки;
	Возврат ВидимыеЭлементы;
КонецФункции

//.
// Возвращаемое значение:
//   Булево - 
Функция ЛиТаблицаПуста() Экспорт
	Возврат ТурбоКонф.ПолучитьНазваниеТипаТекущегоЭлемента() = "таблицу";
КонецФункции

Процедура ВычислитьОписатьПараметрыМетода()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗакрытьМодальноеОкно();
	ПерейтиКТекущейСтрокеИсполнения();
	ПолеТекстаПрограммы = Неопределено;
	ОткрытьОкноВыражения(ПолеТекстаПрограммы);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстВызова = ТекстВызоваФункцииРежимаОтладки(ПолеТекстаПрограммы, "ДокПар");
	ИменаПараметров = ПолеТекстаПрограммы.СтрокаИменПараметровМетода();
	Выражение = "Вычислить(" + ТекстВызова + "(""" + ИменаПараметров + """))";
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	УстановитьЗначениеПолюВвода(Выражение);
	ЖдатьВычислениеВыражения();
	РедактироватьТекст("ВстроенныйЯзык");
КонецПроцедуры

Процедура ПерейтиКТекущейСтрокеИсполнения() Экспорт
	Если Не КликнутьПоЭлементу("Текущая строка", "кнопка") Тогда
		ТурбоКонф.ОткрытьМеню("Отладка", "Текущая строка");
	КонецЕсли;
КонецПроцедуры

Функция ОстановитьИсполнение() Экспорт
	Если Не КликнутьПоЭлементу("Остановить", "кнопка") Тогда
		//ТурбоКонф.ОткрытьМеню("Отладка", "Остановить");
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция ПродолжитьОтладкуИсполнения() Экспорт
	Если Не КликнутьПоЭлементу("Продолжить отладку", "кнопка") Тогда
		//ТурбоКонф.ОткрытьМеню("Отладка", "Продолжить отладку");
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Процедура ПереключитьЗамерПроизводительностиИсполнения() Экспорт
	Если Не КликнутьПоЭлементу("Замер производительности", "кнопка") Тогда
		ТурбоКонф.ОткрытьМеню("Отладка", "Замер производительности");
	КонецЕсли;
КонецПроцедуры

//.
// Параметры:
//   ЯчейкиТекущейСтроки -  - 
//   ИмяФайлаТабличногоДокумента - Строка - имя временного файла табличного документа, он будет удален
// Возвращаемое значение:
//   Булево - пользователь выбрал элемент
Функция НайтиВСписке(Знач ЯчейкиТекущейСтроки = Неопределено, Знач ИмяФайлаТабличногоДокумента = "")
	ТипЭлементаИнтерфейса = ПолучитьТипТекущегоЭлемента();
	Сообщить("ТипПоляОкна = " + ТипЭлементаИнтерфейса);
	Если Истина
		И ЗначениеЗаполнено(ТипЭлементаИнтерфейса) 
		И ТипЭлементаИнтерфейса <> ТипЭлемента.Неизвестный // ячейка таблицы
		И ТипЭлементаИнтерфейса <> ТипЭлемента.ЭлементСписка
		//И ТипЭлементаИнтерфейса <> ТипЭлемента.Флажок // появился в 6.3.9177.36444 https://turboconf.ru/Tasks/10103
		И ТурбоКонф.ПолучитьНазваниеТипаТекущегоЭлемента() <> "флажок"
	Тогда
		ПоказатьВсплывающееУведомление("Команда доступна только для списков");
		Возврат Ложь;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	КонтекстИнтерфейса = КонтекстИнтерфейса();
	Заголовок = КонтекстИнтерфейса.Заголовок;
	Если Заголовок = "Командный интерфейс" Тогда
		// Слишком много колонок
		Возврат Ложь;
	КонецЕсли;
	ЛиТаблица = КонтекстИнтерфейса.ЛиТаблица;
	ЧислоКолонок = КонтекстИнтерфейса.ЧислоКолонок;
	Иерархический = КонтекстИнтерфейса.Иерархический;
	ПоддерживаетПоиск = КонтекстИнтерфейса.ПоддерживаетПоиск;
	ИндексКлючевойКолонки = КонтекстИнтерфейса.ИндексКлючевойКолонки;
	ИмяКлючевойКолонки = КонтекстИнтерфейса.ИмяКлючевойКолонки;
	Если ЯчейкиТекущейСтроки = Неопределено Тогда
		Если Не ЛиТаблица Или Иерархический Тогда
			Попытка
				ВидимыеЯчейкиТекущейСтраницы = ТурбоКонф.ПолучитьВидимыеЭлементыСписка(Истина); // 6.3.9130.1387 Тяжелый вызов для таблицы. Повышает надежность определения текущей строки. 
			Исключение
			КонецПопытки;
		КонецЕсли;
		Если ВидимыеЯчейкиТекущейСтраницы = Неопределено Тогда
			ЯчейкиТекущейСтроки = ЯчейкиТекущейСтрокиСпискаПутемПеремещения(Иерархический);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяФайлаТабличногоДокумента) Тогда
		ТекстыЯчеек = Новый Массив;
	//ИначеЕсли КликнутьПоЭлементу("Вывести список...", "кнопка") Тогда
	//	ТурбоКонф.ЖдатьОкно("Вывести список", 1000, Истина);
	//	УстановитьФокусВПервуюТаблицуИлиСписок();
	//	ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
	//	ТурбоКонф.КонтролКлавиша(Клавиши.S); 
	//	ИмяФайлаТабличногоДокумента = ПолучитьИмяВременногоФайла(".mxl");
	//	УстановитьИмяФайлаВДиалогеВыбораФайла(ИмяФайлаТабличногоДокумента, "Сохран");
	Иначе
		ТурбоКонф.Клавиша(Клавиши.Home);
		МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Попытка
			ВидимыеЯчейки = ТурбоКонф.ПолучитьВидимыеЭлементыСписка(Истина); // 6.3.9130.1387
		Исключение
			ВидимыеЯчейки = Неопределено;
		КонецПопытки;
		
		Если ВидимыеЯчейки = Неопределено Тогда
			// Старый вариант
			ТекстыЯчеек = ТурбоКонф.ПолучитьЭлементыСписка();
			Если ТекстыЯчеек.Количество() = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
			Сообщить("ПолучитьЭлементыСписка - " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала) + " мс");
			Если ЧислоКолонок = Неопределено Тогда
				МаксЧислоКолонок = 25;
				Для ЧислоКолонок = 2 По МаксЧислоКолонок Цикл 
					УспешноеЧислоКолонок = ЧислоКолонок;
					Для ИндексЯчейки = 0 По Мин(МаксЧислоКолонок*2, ТекстыЯчеек.ВГраница() - ЧислоКолонок) Цикл
						ЗаголовокПервойСтроки = МодулиИР.ирОбщий.ПоследнийФрагментЛкс(ТекстыЯчеек[0*ЧислоКолонок + ИндексЯчейки], " ", Ложь);
						ЗаголовокВторойСтроки = МодулиИР.ирОбщий.ПоследнийФрагментЛкс(ТекстыЯчеек[1*ЧислоКолонок + ИндексЯчейки], " ", Ложь);
						Если ЗаголовокПервойСтроки <> ЗаголовокВторойСтроки Тогда
							УспешноеЧислоКолонок = Неопределено;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если УспешноеЧислоКолонок <> Неопределено Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;   
				Если УспешноеЧислоКолонок <> Неопределено Тогда
					ЧислоКолонок = УспешноеЧислоКолонок;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// Новый вариант
			ГраницыЭлементов = ВидимыеЯчейки.ГраницыЭлементов;
			Сообщить("ПолучитьВидимыеЭлементыСписка - " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала) + " мс");
			Если ЧислоКолонок = Неопределено Тогда
				ЛеваяГраницаСписка = Неопределено;
				Для ИндексЯчейки = 0 По ВидимыеЯчейки.ИменаЭлементов.ВГраница() Цикл
					ЛеваяГраницаЯчейки = ГраницыЭлементов[ИндексЯчейки*4 + 0]; // Может быть 0 в любой позиции!
					Если ЛеваяГраницаСписка = Неопределено Тогда
						ЛеваяГраницаСписка = ЛеваяГраницаЯчейки; 
						ЗаголовокПервойКолонки = МодулиИР.ирОбщий.ПоследнийФрагментЛкс(ВидимыеЯчейки.ИменаЭлементов[ИндексЯчейки], " ", Ложь);
					Иначе
						Если Истина
							И ЗаголовокПервойКолонки = МодулиИР.ирОбщий.ПоследнийФрагментЛкс(ВидимыеЯчейки.ИменаЭлементов[ИндексЯчейки], " ", Ложь)
							И ЛеваяГраницаЯчейки = ЛеваяГраницаСписка 
						Тогда
							ЧислоКолонок = ИндексЯчейки;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если ЧислоКолонок = Неопределено Тогда
					ВызватьИсключение "Не удалось определить число колонок таблицы";
				КонецЕсли;
			КонецЕсли;
			Если ВидимыеЯчейкиТекущейСтраницы <> Неопределено Тогда
				ЯчейкиТекущейСтроки = ЯчейкиТекущейСтрокиСпискаИзВидимыхЭлементов(ВидимыеЯчейкиТекущейСтраницы, ЧислоКолонок);
			КонецЕсли;

			// Сканирование списка листанием
			// работает корректно везде при выполнении всех условий:
			// - нет колонок с динамическим (зависящим от текущей строки) заголовком
			// - нет неудобно расположенных полных дублей строк
			ТекстыЯчеек = ВидимыеЯчейки.ИменаЭлементов;
			ЧислоВидимыхСтрок = ВидимыеЯчейки.ИменаЭлементов.Количество() / ЧислоКолонок;
			Если Цел(ЧислоВидимыхСтрок) <> ЧислоВидимыхСтрок Тогда
				// https://turboconf.ru/Tasks/10020
				ПоказатьВсплывающееУведомление("Турбоконф вернул некорректный список видимых ячеек");
				Возврат Ложь;
			КонецЕсли;
			ТурбоКонф.Клавиша(Клавиши.PageDown);
			//СтарыйИД = ИдентификаторТекущегоЭлементаОкна(); 
			ЧислоСтрокПересеченияСтраниц = 1000;
			Пока Истина Цикл
				ТурбоКонф.Клавиша(Клавиши.PageDown); 
				ВидимыеЯчейки = ПолучитьВидимыеЭлементыСписка();
				ИндексВидимойСтроки = 0;
				Для ОбратныйИндексСтроки = 0 По ЧислоВидимыхСтрок - 1 Цикл
					НомерСтрокиСписка = ТекстыЯчеек.Количество() / ЧислоКолонок - 1 - ОбратныйИндексСтроки;
					ЯчейкиСтрокРавны = Истина;
					Для ИндексКолонки = 0 По ЧислоКолонок - 1 Цикл
						Если ВидимыеЯчейки.ИменаЭлементов[ИндексВидимойСтроки*ЧислоКолонок+ИндексКолонки] <> ТекстыЯчеек[НомерСтрокиСписка*ЧислоКолонок+ИндексКолонки] Тогда
							ЯчейкиСтрокРавны = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если ЯчейкиСтрокРавны Тогда
						Для Сч=0 По (ОбратныйИндексСтроки+1)*ЧислоКолонок-1 Цикл
							ВидимыеЯчейки.ИменаЭлементов.Удалить(0);
						КонецЦикла;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				ДополнитьМассивЛкс(ТекстыЯчеек, ВидимыеЯчейки.ИменаЭлементов);
				//Если СтарыйИД <> ИдентификаторТекущегоЭлементаОкна() Тогда
				//	// Некорректно для переменного числа строк на странице (автовысота строки)
				//	Возврат Ложь;
				//КонецЕсли;
				Если Ложь
					Или ВидимыеЯчейки.ИменаЭлементов.Количество() = 0 
					//Или ОбратныйИндексСтроки > ЧислоСтрокПересеченияСтраниц // Оптимизация чтобы не вызывать повторно получение последней страницы
				Тогда
					Прервать;
				КонецЕсли;
				ЧислоСтрокПересеченияСтраниц = ОбратныйИндексСтроки;
			КонецЦикла;
			
			ТурбоКонф.Клавиша(Клавиши.Home);
		КонецЕсли;
	КонецЕсли;
	
	Сообщить("ЧислоКолонок="+ЧислоКолонок);  
	Если ЛиАктивноГлавноеОкно() Тогда
		МаркерСсылкиНаКонфигурацию = "Основная конфигурация ";
		МаркерСсылкиНаРасширение = "Расширение конфигурации ";
		Если Истина
			И ЧислоКолонок = 2
			И (Ложь
				Или СтрНачинаетсяС(ТекстыЯчеек[0], МаркерСсылкиНаКонфигурацию)
				Или СтрНачинаетсяС(ТекстыЯчеек[0], МаркерСсылкиНаРасширение))
		Тогда
			Заголовок = "Результаты поиска";
			ПоддерживаетПоиск = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Ищем номер строки
	ИндексЯчейкиВГруппе = 0;
	ГрязныйТекстТекущейЯчейки = "";
	НомерСтрокиСписка = Неопределено;
	Если ЯчейкиТекущейСтроки.Количество() Тогда
		ТекстИскомойЯчейки = ЯчейкиТекущейСтроки[0];
		НачальныйИндексЯчейки = ТекстыЯчеек.Найти(ТекстИскомойЯчейки);
		Если НачальныйИндексЯчейки <> Неопределено Тогда
			Для ИндексЯчейки = НачальныйИндексЯчейки По ТекстыЯчеек.ВГраница() Цикл
				Если ТекстИскомойЯчейки <> ТекстыЯчеек[ИндексЯчейки] Тогда
					Продолжить;
				КонецЕсли;
				ИндексЯчейкиВГруппе = ИндексЯчейкиВГруппе + 1;
				Если ИндексЯчейкиВГруппе = ЯчейкиТекущейСтроки.Количество() Тогда
					Если ЗначениеЗаполнено(ЧислоКолонок) Тогда
						НомерСтрокиСписка = Цел(ИндексЯчейки / ЧислоКолонок);
					КонецЕсли;
					Прервать;
				КонецЕсли;
				ТекстИскомойЯчейки = ЯчейкиТекущейСтроки[ИндексЯчейкиВГруппе];
			КонецЦикла;
		КонецЕсли;
		Сообщить("НомерСтрокиСписка="+НомерСтрокиСписка);
		
		// Ищем ключевую колонку
		ГрязныйТекстТекущейЯчейки = ЯчейкиТекущейСтроки[0];
		Если НомерСтрокиСписка <> Неопределено И ИндексКлючевойКолонки = 0 Тогда
			Для ИндексКолонки = 0 По ЧислоКолонок Цикл
				ТекстЯчейки = ТекстыЯчеек[НомерСтрокиСписка*ЧислоКолонок + ИндексКолонки];
				Если Истина
					И (Ложь
						Или НомерСтрокиСписка = 0
						Или ТекстЯчейки <> ТекстыЯчеек[(НомерСтрокиСписка-1)*ЧислоКолонок + ИндексКолонки])
					И (Ложь
						Или НомерСтрокиСписка = (ТекстыЯчеек.Количество() / ЧислоКолонок - 1)
						Или ТекстЯчейки <> ТекстыЯчеек[(НомерСтрокиСписка+1)*ЧислоКолонок + ИндексКолонки])
				Тогда 
					ИндексКлючевойКолонки = ИндексКолонки;
					ГрязныйТекстТекущейЯчейки = ТекстЯчейки;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Сообщить("ИндексКлючевойКолонки="+ИндексКлючевойКолонки);
	Сообщить("ТекстКлючевойЯчейки="+ГрязныйТекстТекущейЯчейки);
	
	Если Истина
		И НомерСтрокиСписка <> Неопределено 
		И (Ложь 
			Или Не ПоддерживаетПоиск
			Или НомерСтрокиСписка < МаксНомерСтрокиДляТочногоПозиционирования())
	Тогда
		НажатьКлавишуЦикл(Клавиши.Down, НомерСтрокиСписка);
	ИначеЕсли ПоддерживаетПоиск Тогда
		НайтиСтрокуВОкне(ЧистыйТекстЯчейки(ГрязныйТекстТекущейЯчейки, ЛиТаблица));
	КонецЕсли;
	КлючВыбраннойСтроки = ВыбратьЭлементСписка(ТекстыЯчеек, ГрязныйТекстТекущейЯчейки,, ЛиТаблица, Заголовок, ЧислоКолонок, НомерСтрокиСписка, ИмяФайлаТабличногоДокумента);
	Если ЗначениеЗаполнено(ИмяФайлаТабличногоДокумента) Тогда
		УдалитьФайлы(ИмяФайлаТабличногоДокумента);
	КонецЕсли;
	Если КлючВыбраннойСтроки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Истина
		И ТипЗнч(КлючВыбраннойСтроки) = Тип("Число") 
		И ТекстыЯчеек.Количество() > 0
	Тогда
		Если Ложь
			Или Не ПоддерживаетПоиск
			//Или Иерархический 
			Или (Истина
				И ЗначениеЗаполнено(ЧислоКолонок)
				И ЧислоКолонок > 1 
				И КлючВыбраннойСтроки < МаксНомерСтрокиДляТочногоПозиционирования())
		Тогда
			ТурбоКонф.Клавиша(Клавиши.Home);
			НажатьКлавишуЦикл(Клавиши.Down, КлючВыбраннойСтроки);
		Иначе
			ГрязныйТекстТекущейЯчейки = ТекстыЯчеек[ЧислоКолонок*КлючВыбраннойСтроки + ИндексКлючевойКолонки];
			НайтиСтрокуВОкне(ЧистыйТекстЯчейки(ГрязныйТекстТекущейЯчейки, ЛиТаблица), Истина);
		КонецЕсли;
	Иначе
		НайтиСтрокуВОкне(КлючВыбраннойСтроки, Истина);
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

Функция КонтекстИнтерфейса() Экспорт
	Заголовок = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	Если ЛиАктивноГлавноеОкно() Тогда
		Заголовок = Неопределено;
	КонецЕсли;
	ТипЭлементаИнтерфейса = ПолучитьТипТекущегоЭлемента();
	//Сообщить("ТипЭлементаИнтерфейса=" + ТипЭлементаИнтерфейса);
	//Сообщить("ПолучитьНазваниеТипаТекущегоЭлемента()=" + ТурбоКонф.ПолучитьНазваниеТипаТекущегоЭлемента());
	ЛиТаблица = Истина
		И ТипЭлементаИнтерфейса <> ТипЭлемента.ЭлементСписка
		И НЕ (Истина
			// Окна выбора сохраняемых реквизитов обычной формы
			И (Ложь
				Или Заголовок = "Выбор объекта" // Есть 2 таких окна - для объектов метаданных и для реквизитов обычной формы
				Или Заголовок = "Настройка редактирования"
				Или Заголовок = "Настройка просмотра")
			//И ТипЭлементаИнтерфейса = ТипЭлемента.Флажок // появился в 6.3.9177.36444 https://turboconf.ru/Tasks/10103
			И ТурбоКонф.ПолучитьНазваниеТипаТекущегоЭлемента() = "флажок"
			);
	ИндексКлючевойКолонки = 0;
	Иерархический = Ложь;
	ПоддерживаетПоиск = ЗначениеЗаполнено(Заголовок); // Списки встроенные в главное окно часто многие не поддерживают, например в панели "Дополнительно"
	Если Не ЛиТаблица Тогда
		ЧислоКолонок = 1;
		Если СтрНачинаетсяС(Заголовок, "Выбор объекта") Тогда
			ТурбоКонф.КонтролАльтКлавиша(Клавиши.M);
			ПоддерживаетПоиск = ПолучитьТипТекущегоЭлемента() <> ТипЭлемента.Поле;
		ИначеЕсли СтрНачинаетсяС(Заголовок, "Выбор объектов") Тогда
			ПоддерживаетПоиск = Ложь;
		ИначеЕсли Заголовок = "Выбор реквизита" Тогда
			Иерархический = Истина;
		ИначеЕсли Заголовок = "Редактирование типа данных" Тогда
			Иерархический = Истина;
		ИначеЕсли Ложь
			Или Заголовок = "Отбор по подсистемам" 
			Или Заголовок = "Подсистемы" // из общей картинки
		Тогда
			Иерархический = Истина; 
			Если ТурбоКонф.НайтиОкноПоЗаголовку("Выбор объектов") > 0 Тогда
				// https://www.hostedredmine.com/issues/999422
				ПоддерживаетПоиск = Ложь; 
			КонецЕсли;
		ИначеЕсли Заголовок = "Выбор типа данных" Тогда
		КонецЕсли;
	Иначе
		ЧислоКолонок = Неопределено;
		Если Заголовок = "Закладки" Тогда
			ЧислоКолонок = 4;
			ПоддерживаетПоиск = Ложь;
		ИначеЕсли Заголовок = "Точки останова" Тогда
			ЧислоКолонок = 5;
			ПоддерживаетПоиск = Ложь;
		ИначеЕсли Заголовок = "Настройка условного оформления" Тогда
			ЧислоКолонок = 10;
		ИначеЕсли Заголовок = "Список выбора" Тогда
			ЧислоКолонок = 2;
		ИначеЕсли Заголовок = "Выражение" Тогда
			ЧислоКолонок = 3;
			Иерархический = Истина;
			ИмяКлючевойКолонки = "Свойство";
		ИначеЕсли Заголовок = "Предметы отладки" Тогда
			ЧислоКолонок = 5;
			ПоддерживаетПоиск = Ложь; // Нет уникальный колонок
		ИначеЕсли Заголовок = "Список элементов управления формы" Тогда
			ЧислоКолонок = 2;
			Иерархический = Истина;
		ИначеЕсли Заголовок = "Размещение данных" Тогда
			ЧислоКолонок = 2;
			Иерархический = Истина;
		ИначеЕсли Заголовок = "Редактирование параметров выбора" Тогда
			ЧислоКолонок = 2;
		КонецЕсли;
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("Заголовок", Заголовок);
	Результат.Вставить("ЛиТаблица", ЛиТаблица);
	Результат.Вставить("ЧислоКолонок", ЧислоКолонок);
	Результат.Вставить("Иерархический", Иерархический);
	Результат.Вставить("ПоддерживаетПоиск", ПоддерживаетПоиск);
	Результат.Вставить("ИндексКлючевойКолонки", ИндексКлючевойКолонки);
	Результат.Вставить("ИмяКлючевойКолонки", ИмяКлючевойКолонки);
	Возврат Результат;
КонецФункции

Функция ЯчейкиТекущейСтрокиСпискаИзВидимыхЭлементов(Знач ВидимыеЭлементыСписка, Знач ЧислоКолонок) Экспорт
	Если Истина
		И ВидимыеЭлементыСписка.ИменаЭлементов.Количество() > 0 
		И ВидимыеЭлементыСписка.ГраницыЭлементов.Количество() = 0 
	Тогда
		ВызватьИсключение "Видимые элементы списка получены без флага РасширеннаяИнформация";
	КонецЕсли;
	ЯчейкиТекущейСтроки = Новый Массив; 
	ИндексТекущегоЭлемента = ВидимыеЭлементыСписка.ИндексТекущегоЭлемента;
	Если ИндексТекущегоЭлемента <> Неопределено Тогда
		ИндексПервойЯчейкиСтроки = Цел(ИндексТекущегоЭлемента/ЧислоКолонок)*ЧислоКолонок;
		Для ИндексЯчейки = ИндексПервойЯчейкиСтроки По ИндексПервойЯчейкиСтроки + ЧислоКолонок-1 Цикл
			ЯчейкиТекущейСтроки.Добавить(ВидимыеЭлементыСписка.ИменаЭлементов[ИндексЯчейки]);
		КонецЦикла;
	КонецЕсли;
	Возврат ЯчейкиТекущейСтроки;
КонецФункции

Функция ЛиАктивноГлавноеОкно(Знач ЗаголовокОкна = "")
	Если ПустаяСтрока(ЗаголовокОкна) Тогда
		ЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	КонецЕсли;
	Возврат Найти(ЗаголовокОкна, "Конфигуратор - ") > 0;
	//Возврат Истина // Так работает некорректно
	//	И Конфигуратор <> Неопределено
	//	И ТурбоКонф.ПолучитьАктивноеОкно() = Конфигуратор.ГлавноеОкно;
КонецФункции

Функция ЧистыйТекстЯчейки(Знач ГрязныйТекстТекущейЯчейки, Знач ЛиТаблица) Экспорт
	Если ЛиТаблица Тогда
		ЧистыйТекстЯчейки = СтрокаБезПоследнегоФрагментаЛкс(ГрязныйТекстТекущейЯчейки, " ");
	Иначе
		ЧистыйТекстЯчейки = ГрязныйТекстТекущейЯчейки;
	КонецЕсли;
	Возврат ЧистыйТекстЯчейки;
КонецФункции

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения.
//
Процедура ДополнитьМассивЛкс(МассивПриемник, МассивИсточник) Экспорт
	Для Каждого Значение Из МассивИсточник Цикл
		МассивПриемник.Добавить(Значение);
	КонецЦикла;
КонецПроцедуры

//.
// Возвращаемое значение:
//   Массив - 
Функция ЯчейкиТекущейСтрокиСпискаПутемПеремещения(Знач Иерархический = Ложь) Экспорт
	Если Не Иерархический Тогда
		НажатьКлавишуЦикл(Клавиши.Right, 5);
	КонецЕсли;
	ЯчейкиТекущейСтроки = Новый Массив;
	СтарыйИД = Неопределено;
	Для НомерКолонкиТекста = 1 По ?(Иерархический, 1, 10) Цикл
		НовыйИД = ИдентификаторТекущегоЭлементаОкна();
		Если СтарыйИД = НовыйИД Тогда
			Прервать;
		КонецЕсли;
		СтарыйИД = НовыйИД;
		ТекстЯчейки = ТурбоКонф.ПолучитьИмяЭлемента();
		Если ТекстЯчейки = "" И НомерКолонкиТекста = 1 Тогда
			// окно "Точки останова" - странная колонка в крайней правой позиции
		Иначе
			ЯчейкиТекущейСтроки.Вставить(0, ТекстЯчейки);
		КонецЕсли;
		ТурбоКонф.Клавиша(Клавиши.Left);
	КонецЦикла;
	Сообщить("ЧислоПозиционируемыхЯчеекВСтроке="+ЯчейкиТекущейСтроки.Количество());
	Возврат ЯчейкиТекущейСтроки;
КонецФункции

Функция МаксНомерСтрокиДляТочногоПозиционирования() Экспорт
	Возврат 100;
КонецФункции

// Слишком долгий и не надежный способ.
// Работает только если актива колонка с уникальными значениями.
Функция НомерСтрокиСписка(Знач ВосстановитьПозицию = Истина) Экспорт
	НомерСтрокиСписка = 0;
	//НовыйRuntimeIdСтрокой = Неопределено;
	НовыйТекстЯчейки = Неопределено;
	Пока Истина Цикл
		НомерСтрокиСписка = НомерСтрокиСписка + 1;
		//СтарыйRuntimeIdСтрокой = НовыйRuntimeIdСтрокой;
		СтарыйТекстЯчейки = НовыйТекстЯчейки;
		ТурбоКонф.Клавиша(Клавиши.Up);
		ТурбоКонф.Ждать(10);
		//НовыйRuntimeIdСтрокой = ИдентификаторТекущегоЭлементаОкна();
		НовыйТекстЯчейки = ТурбоКонф.ПолучитьИмяЭлемента();
		Если Истина
			//И НовыйRuntimeIdСтрокой = СтарыйRuntimeIdСтрокой // назначается по номеру в видимой области. Поэтому нельзя использовать для навигации в полном списке
			И НовыйТекстЯчейки = СтарыйТекстЯчейки
		Тогда
			Прервать;
		КонецЕсли;
		Если НомерСтрокиСписка > МаксНомерСтрокиДляТочногоПозиционирования() Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	ПоказатьВсплывающееУведомление(НомерСтрокиСписка);
	Если ВосстановитьПозицию Тогда
		НажатьКлавишуЦикл(Клавиши.Down, НомерСтрокиСписка - 1); // - Восстановим позицию
	КонецЕсли;
	Возврат НомерСтрокиСписка;
КонецФункции

//.
// Параметры:
//    ТекстыЯчеек - Массив Из Строка - 
//    ТекстТекущейЯчейки - ? - 
//    ЛиМодально - Булево - 
//    ЛиТаблица - Булево - 
//    Заголовок - Строка - 
Функция ВыбратьЭлементСписка(Знач ТекстыЯчеек, Знач ТекстТекущейЯчейки = "", Знач ЛиМодально = Истина, Знач ЛиТаблица = Ложь, Знач Заголовок = Неопределено, Знач ЧислоКолонок = Неопределено,
		Знач НомерСтрокиСписка = Неопределено, Знач ИмяФайлаТабличногоДокумента = "", Знач МожноФокусВФильтр = Истина) Экспорт
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ТекстыПолейСтрока = ОбъектВЖСОН(ТекстыЯчеек);
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	Если ЛиМодально Тогда
		КлючХраненияВыбора = "Конфигуратор." + Заголовок;
		ОповеститьПользователяОПриостановке(ПодключениеИР);
		//ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх(".*", 5000, Конфигуратор.ГлавноеОкно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР); // Так окно не получает фокус
		ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("(Список|Таблица|Введи|Выбор).*", 5000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР); // Если откроется окно ввода числа колонок, то псевдомодальность теряется
	Иначе  
		ВосстановитьОкноПриложения(ПодключениеИР);
		ИДЗадачи = "" + ТекущаяДата();
		ТурбоКонф.НачатьУправлениеМодальнымиОкнами(3000, , ИдентификаторПроцессаИР,, ИДЗадачи);
	КонецЕсли;
	Попытка
		КлючВыбранногоЭлемента = МодулиИР.ирКлиент.ОткрытьТаблицуИзМассиваИзСтрокиВнутрЛкс(ТекстыПолейСтрока, ТекстТекущейЯчейки, ЛиТаблица, ЛиМодально, ЧислоКолонок, Заголовок, КлючХраненияВыбора,
			НомерСтрокиСписка, ИмяФайлаТабличногоДокумента, МожноФокусВФильтр);
	Исключение
		Если ЛиМодально Тогда
			ПоказатьВсплывающееУведомление(ОписаниеОшибки());
		Иначе
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;
	Если ЛиМодально Тогда
		ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
	Иначе
		ТурбоКонф.ЗавершитьУправлениеМодальнымиОкнами(ИДЗадачи);
	КонецЕсли;
	Возврат КлючВыбранногоЭлемента;
КонецФункции

Функция ОбъектВЖСОН(Знач Элементы)
	ЗаписьТекста = Новый ЗаписьJSON;
	ЗаписьТекста.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьТекста, Элементы);
	ТекстыПолейСтрока = ЗаписьТекста.Закрыть();
	Возврат ТекстыПолейСтрока;
КонецФункции

Функция ОбъектИзЖСОН(Знач ТекстСлов)
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(ТекстСлов);
	ТаблицаСлов = ПрочитатьJSON(Чтение); 
	Возврат ТаблицаСлов;
КонецФункции

// Неуспешая попытка сделать замену поиска в окне Дополнительно
Процедура _НайтиСтроку() 
	// Не нашел способ проверять, что фокус в окне Дополнительно 
	// Нужна более надежная проверка https://turboconf.ru/Tasks/9471
	Если ТурбоКонф.НайтиЭлементПоИмени("Общие реквизиты", "элемент вкладки") Тогда
		НайтиВСписке(); 
	Иначе
		ТурбоКонф.КонтролКлавиша(Клавиши.F);
	КонецЕсли;
КонецПроцедуры

//&ТолькоТекстовыеДокументы
Процедура НайтиСледующийВыделенный() 
	ТурбоКонф.ПродолжитьОбработкуНажатияКлавиш = Истина;
	ФоновыеЗадания.Выполнить(ЭтотОбъект, "ПроверитьПереходКонцаДокумента");
КонецПроцедуры

//&ТолькоТекстовыеДокументы
Процедура НайтиСледующий() 
	ТурбоКонф.ПродолжитьОбработкуНажатияКлавиш = Истина;
	ФоновыеЗадания.Выполнить(ЭтотОбъект, "ПроверитьПереходКонцаДокумента");
КонецПроцедуры

// Фоновый запуск
Процедура ПроверитьПереходКонцаДокумента() Экспорт
	Попытка
		СтруктураПозицииПоиска = ВосстановитьЗначениеСеансаКонфигуратора(КлючХраненияПозицияНайденного());
		ТурбоКонф.ПолучитьТекстМодуля("", ПозицияВТексте); // Долго
		Поле = ИдентификаторТекущегоЭлементаОкна();
		Если СтруктураПозицииПоиска <> Неопределено Тогда
			Если Истина
				И Поле = СтруктураПозицииПоиска.Поле
				И ПозицияВТексте < СтруктураПозицииПоиска.Позиция 
			Тогда
				ПоказатьВсплывающееУведомление("Поиск достиг конца документа", 2000);
			КонецЕсли;
		КонецЕсли;
		СтруктураПозицииПоиска = Новый Структура;
		СтруктураПозицииПоиска.Вставить("Позиция", ПозицияВТексте);
		СтруктураПозицииПоиска.Вставить("Поле", Поле);
		СохранитьЗначениеСеансаКонфигуратора(КлючХраненияПозицияНайденного(), СтруктураПозицииПоиска);
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
	КонецПопытки;
КонецПроцедуры

Функция КлючХраненияПозицияНайденного() Экспорт
	Возврат "Конфигуратор.СтруктураПозицииПоиска";
КонецФункции

Функция ВыделенныйТекст(ТолькоВыделенный = Истина)
	// Еще есть ТурбоКонф.ПолучитьТекстТекущегоЭлемента()
	Текст = Неопределено;
	Если Не ТолькоВыделенный Тогда 
		ТипЭлементаИнтерфейса = ПолучитьТипТекущегоЭлемента();
		Если Ложь 
			Или ТипЭлементаИнтерфейса = ТипЭлемента.Поле
			Или ТипЭлементаИнтерфейса = ТипЭлемента.ПолеСоСписком
		Тогда
			Текст = ТурбоКонф.ПолучитьЗначение();
		ИначеЕсли Ложь
			Или ТипЭлементаИнтерфейса = ТипЭлемента.ЭлементСписка
			Или ТипЭлементаИнтерфейса = ТипЭлемента.ЭлементМеню
			Или ТипЭлементаИнтерфейса = ТипЭлемента.Неизвестный
		Тогда
			Текст = ТурбоКонф.ПолучитьИмяЭлемента();
		КонецЕсли;
	КонецЕсли;
	Если Текст = Неопределено Тогда 
		//ТекстСтарый = "" + Новый УникальныйИдентификатор;
		//УстановитьБуферОбмена(ТекстСтарый); // Так ниже будет ошибка чтения из буфера обмена
		ТекстСтарый = ТурбоКонф.ПолучитьБуферОбмена();
		ТурбоКонф.Копировать(); // Так дальше может возникать ошибка "Сбой при выполнении запрошенной операции с буфером обмена" 
		//ТурбоКонф.КонтролКлавиша(Клавиши.C); // Так даже 100 мс ожидания не всегда хватает для получения нового содержимого буфера
		ТурбоКонф.Ждать(100); // 50мс не хватает для первого в жизни окна вызова, например в ячейку журнала регистрации	
		Текст = ТурбоКонф.ПолучитьБуферОбмена(); 
		Если Текст = ТекстСтарый Тогда
			Текст = "";
		КонецЕсли;
	КонецЕсли;
	Сообщить("Текст " + ?(ТолькоВыделенный, "выделенный ", "") + "элемента интерфейса = " + Лев(Текст, 1000));
	Возврат Текст;
КонецФункции

//&ТолькоТекстовыеДокументы
//&ВосстанавливатьБуферОбмена
Процедура ОтладитьОбъект()
	ТребоватьОтложеннуюОтладку = "Ложь";
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте,,,, ЭтоДокумент(), Истина);
	Если ПолеТекстаПрограммы <> Неопределено Тогда
		СсылкаСтрокиМодуля = ПолеТекстаПрограммы.СсылкаСтрокиМодуля(, Ложь);
	КонецЕсли;
	ЦелевойЗаголовок = "Выражение";
	ТекстПоля = "";
	МодулиИР = МодулиИР(ПодключениеИР);
	ЛиОтладкаВТолстомКлиенте = Ложь;
	Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() <> ЦелевойЗаголовок Тогда
		ЧислоКолонокВТаблицеСтека = 4;
		ТурбоКонф.КонтролАльтКлавиша(Клавиши.C); // - Стек вызовов
		ТурбоКонф.Ждать(30);
		ТурбоКонф.Клавиша(Клавиши.Home);
		ВидимыеЭлементы = ПолучитьВидимыеЭлементыСписка();
		Если Истина
			И ВидимыеЭлементы <> Неопределено 
			И ВидимыеЭлементы.ИменаЭлементов.Количество() % ЧислоКолонокВТаблицеСтека = 0
		Тогда
			ЯчейкиПервойСтроки = Новый Массив;
			Для Индекс = 0 По ЧислоКолонокВТаблицеСтека - 1 Цикл
				ЯчейкиПервойСтроки.Добавить(ВидимыеЭлементы.ИменаЭлементов[индекс]);
			КонецЦикла;
			ТекстСтека = СтрСоединить(ЯчейкиПервойСтроки);
		Иначе
			ТекстСтека = ВыделенныйТекст(Истина);
		КонецЕсли;
		ВернутьсяВПредыдущееМестоКонфигуратора();
		Сообщить("ТекстСтека=" + ТекстСтека);
		ЛиОтладкаВТолстомКлиенте = Найти(ТекстСтека, "Толстый клиент:") > 0;
		Если ОткрытьОкноВыражения(, ТекстПоля) = Неопределено Тогда
			ПоказатьВсплывающееУведомление(СтрШаблон("Команда применима только в редакторе модуля во время остановки отладки и в окне ""%1""", ЦелевойЗаголовок));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	СтароеЗначениеБуфераОбмена = ТурбоКонф.ПолучитьБуферОбмена();
	ТекстВызова = ТекстВызоваФункцииРежимаОтладки(ПолеТекстаПрограммы, "От");
	// ТекстыЯчеек = ТурбоКонф.ПолучитьЭлементыСписка(); // Нельзя тут вызывать, т.к. оно снимает выделение в поле ввода
	Если ПустаяСтрока(ТекстПоля) Тогда
		ТекстПоля = ТекстВычисленногоМногострочногоВыражения();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекстПоля) Тогда
		Возврат;
	КонецЕсли;
	ПерваяСтрока = СокрЛП(НРег(СтрПолучитьСтроку(ТекстПоля, 1)));
	Если Лев(ПерваяСтрока, 1) = "(" Тогда
		ПерваяСтрока = СокрЛ(Сред(ПерваяСтрока, 2));
	КонецЕсли;
	ЛиИерархическоеЛогическоеВыражение = Истина
		И Найти(ТекстПоля, Символы.ПС) > 0
		И (Ложь
			Или ПерваяСтрока = "истина"
			Или ПерваяСтрока = "ложь");
	//ПоказатьВсплывающееУведомление(ПерваяСтрока);
	Если ЛиИерархическоеЛогическоеВыражение Тогда
		ВычисляемоеВыражение = "ирОбщий.РасшифровкаИерархическогоЛогическогоВыраженияЛкс("+ МодулиИР.ирОбщий.ТекстВВыражениеВстроенногоЯзыкаЛкс(ТекстПоля)+")";
		УстановитьФиктивноеВыражениеДляУстановкиЗначения();
		ИмяХранилища = "КодДляОтладчика";
		ТурбоКонф.ВставитьТекст("ирОбщий.СохранитьЗначениеЛкс(""" + ИмяХранилища + """, " + ВычисляемоеВыражение + ")");
		ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
		ЗакрытьМодальноеОкно();
		УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
		УстановитьЗначениеПолюВвода("Вычислить(ирОбщий.ВосстановитьЗначениеЛкс(""" + ИмяХранилища + """))");
		ЖдатьВычислениеВыражения();
		РедактироватьТекст("ВстроенныйЯзык");
		Возврат;
	КонецЕсли;
	Если СтрНачинаетсяС(ТекстПоля, ТекстВызова) Тогда
		ВключитьМодифицированностьПоляВвода();
	Иначе
		ДобавкаЗапятых = ",,";
		Если Найти(ТекстПоля, ",") = 0 Тогда
			ДобавкаЗапятых = ДобавкаЗапятых + ",";
		КонецЕсли;
		Выражение = ТекстВызова + "(" + ТекстПоля + ДобавкаЗапятых + " " + ТребоватьОтложеннуюОтладку + ",,,, """ + СсылкаСтрокиМодуля + """)";
		УстановитьЗначениеПолюВвода(Выражение);
		УстановитьФокусВПервуюТаблицуИлиСписок();
	КонецЕсли; 
	Если Не ЛиОтладкаВТолстомКлиенте Тогда
		ТекстыЯчеек = ЖдатьВычислениеВыражения();
	КонецЕсли;
	Если Истина
		И ТекстыЯчеек <> Неопределено
		И Найти(НРег(ТекстыЯчеек[1]), "открыть объект для отладки") > 0 
	Тогда
		НачатьОжиданиеМодальныхОконПриложенияИР(МодулиИР);
		МодулиИР.ирКлиент.ОтладитьОтложенныйОбъектЛкс(ТекстыЯчеек[1]);
		ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
		ЗавершитьВызовВнешнегоОкнаАсинх(0, ИдентификаторПроцессаИР);
	Иначе
		ИдентификаторПроцесса = 0; // Сделать получение через вычисление выражения
		ШаблонЗаголовкаОкна = "^(Консоль|Исследователь)";
		ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх(ШаблонЗаголовкаОкна, 2000, Конфигуратор.ГлавноеОкно, РежимОткрытияВнешнегоОкна.ГлавноеОкно, Истина, ИдентификаторПроцесса);
		ЗавершитьВызовВнешнегоОкнаАсинх(0, ИдентификаторПроцесса);
	КонецЕсли;           
	Если Не ЛиОтладкаВТолстомКлиенте И ПустаяСтрока(ТекстыЯчеек[1]) Тогда
		ПоказатьВсплывающееУведомление("Не дождались снимка объекта. Либо повторите команду после его появления, либо активируйте окно отлаживаемого приложения.", 5000);
	КонецЕсли;
	// УстановитьБуферОбмена(СтароеЗначениеБуфераОбмена); // Почему то после этого перестает работать чтение из буфера обмена
КонецПроцедуры

Функция ЖдатьВычислениеВыражения(Знач МиллисекундЖдать = 1000) Экспорт
	УстановитьФокусВПервуюТаблицуИлиСписок(Истина);
	ТекстыЯчеек = Новый Массив;
	ТекстыЯчеек.Добавить("");
	ТекстыЯчеек.Добавить("");
	ТекстыЯчеек.Добавить("");
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Сообщить("Начинаем ожидание вычисления выражения");
	РезультатВычисления = Неопределено;
	Пока ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала <= МиллисекундЖдать Цикл
		ТекстыЯчеек = ЯчейкиТекущейСтроки(3);
		Если ТекстыЯчеек.Количество() > 1 Тогда
			ТекстыЯчеек[1] = СтрокаБезПоследнегоФрагментаЛкс(ТекстыЯчеек[1], " Значение");
			Если ТекстыЯчеек.Количество() > 2 Тогда
				ТекстыЯчеек[2] = СтрокаБезПоследнегоФрагментаЛкс(ТекстыЯчеек[2], " Тип");
			КонецЕсли;
		Иначе
			// <6.3.9130.13871
			Попытка
				ТекстТаблицы = ТурбоКонф.ПолучитьТекстТаблицы();  // Часто вызывает 4 секундное ожидание и ошибку "Не удалось дождаться смены элемента"
			Исключение
				ТекстТаблицы = Неопределено;
				Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
			КонецПопытки;
			Если ЗначениеЗаполнено(ТекстТаблицы) Тогда
				ТекстыЯчеек = СтрРазделить(ТекстТаблицы, Символы.Таб);
			КонецЕсли;
		КонецЕсли;
		Если ТекстыЯчеек.Количество() > 1 Тогда
			РезультатВычисления = ТекстыЯчеек[1];
			Если ЗначениеЗаполнено(РезультатВычисления) Тогда
				Сообщить("Результат вычисления = " + РезультатВычисления);
				Прервать;
			КонецЕсли;
		КонецЕсли;
		ТурбоКонф.Ждать(50);
	КонецЦикла;
	Возврат ТекстыЯчеек;
КонецФункции

Функция ТекстВычисленногоМногострочногоВыражения() Экспорт
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	ТекстПоля = ТурбоКонф.ПолучитьЗначение();
	Если Найти(ТекстПоля, "¶") > 0 Тогда
		УстановитьФокусВПервуюТаблицуИлиСписок(Истина);
		ВидимыеЭлементы = ПолучитьВидимыеЭлементыСписка();
		Если ВидимыеЭлементы <> Неопределено Тогда
			ТекстПоля = СтрокаБезПоследнегоФрагментаЛкс(ВидимыеЭлементы.ИменаЭлементов[0], " ");
		КонецЕсли;
	КонецЕсли;
	Возврат ТекстПоля;
КонецФункции

Процедура УстановитьФиктивноеВыражениеДляУстановкиЗначения() Экспорт
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	УстановитьЗначениеПолюВвода("Новый Структура(""_"")");
	ЖдатьВычислениеВыражения();
	ТурбоКонф.Клавиша(Клавиши.Add);
	ТурбоКонф.Клавиша(Клавиши.Down);
	//ТурбоКонф.Ждать(20);
	ОткрытьОкноУстановкиЗначенияВВидеВыражения();
КонецПроцедуры

Процедура ВключитьМодифицированностьПоляВвода(Знач ЗавершитьВвод = Истина, Знач КлавишаВременнойДобавки = Неопределено) Экспорт
	ТурбоКонф.Клавиша(Клавиши.End);
	Если КлавишаВременнойДобавки = Неопределено Тогда
		КлавишаВременнойДобавки = Клавиши.D0; // Раньше был пробел, но в числах он не вводится
	КонецЕсли;
	ТурбоКонф.Клавиша(КлавишаВременнойДобавки); 
	ТурбоКонф.Клавиша(Клавиши.Back);
	Если ЗавершитьВвод Тогда
		ТурбоКонф.Клавиша(Клавиши.Enter);
		ТурбоКонф.Ждать(20);
	КонецЕсли;
КонецПроцедуры

// гарантирует, что после установки значения в поле ввода сработает родной обработчик изменения
// Параметры:
//   Текст - Строка - 
Процедура УстановитьЗначениеПолюВвода(Знач Текст, Знач ЗавершитьВвод = Истина, Знач КлавишаВременнойДобавки = Неопределено) Экспорт
	ТурбоКонф.УстановитьЗначение(Текст);
	ВключитьМодифицированностьПоляВвода(ЗавершитьВвод, КлавишаВременнойДобавки);
КонецПроцедуры

//&ТолькоТекстовыеДокументы
//&ЗапроситьИнформациюОДокументе
Процедура ТочкаОстановаПодробная()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НомерСтрокиТекста = ПолеТекстаПрограммы.ПолучитьНомерТекущейСтроки();
	СтрокаТекста = СокрЛП(ПолеТекстаПрограммы.ПолеТекста.ПолучитьСтроку(НомерСтрокиТекста));
	ОткрытьКонтекстноеМеню();
	МодулиИР = МодулиИР(ПодключениеИР);
	НомерВерсииПлатформы = МодулиИР.ирКэш.НомерВерсииПлатформыЛкс();
	Если НомерВерсииПлатформы  < 803024 Тогда
		ТекстЭлемента = "Точка останова с условием...";
		ЗаголовокОкна = "Условие останова";
	Иначе 
		ТекстЭлемента = "Точка останова с параметрами...";
		ЗаголовокОкна = "Параметры точки останова";
	КонецЕсли;
	Если Не ТурбоКонф.НайтиЭлементПоИмени(ТекстЭлемента, "элемент меню") Тогда 
		//ТурбоКонф.Клавиша(Клавиши.Escape);
		ПоказатьВсплывающееУведомление("Команда применима только в редакторе модуля НЕ во время отладки");
		Возврат;
	КонецЕсли;
	НачалоПредставления = """$";
	КликнутьПоЭлементу(ТекстЭлемента, "элемент меню");
	ТурбоКонф.ЖдатьОкно(ЗаголовокОкна, 1000, Истина);
	СтрокаТекста = НачалоПредставления + СтрЗаменить(СтрокаТекста, """", "'") + """<>1";
	Если НомерВерсииПлатформы  < 803024 Тогда
		СтарыйТекст = ТурбоКонф.ПолучитьТекстТекущегоЭлемента();
		РазрешитьИзменения = ПустаяСтрока(СтарыйТекст) Или СтрНачинаетсяС(СтарыйТекст, НачалоПредставления);
		Если РазрешитьИзменения Тогда
			Если СтрНачинаетсяС(СтарыйТекст, НачалоПредставления) Тогда
				ТурбоКонф.Клавиша(Клавиши.Escape);
				ТурбоКонф.Клавиша(Клавиши.F9);
				Возврат;
			КонецЕсли;
			ТурбоКонф.УстановитьЗначение(СтрокаТекста);
			ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
		КонецЕсли;
	Иначе 
		БылаВключена = Ложь;
		СтарыйТекст = АктивироватьУсловиеВОкнеПараметрыТочкиОстанова(БылаВключена);
		РазрешитьИзменения = ПустаяСтрока(СтарыйТекст) Или СтрНачинаетсяС(СтарыйТекст, НачалоПредставления);
		Если РазрешитьИзменения Тогда
			Если ПустаяСтрока(СтарыйТекст) Тогда
				ТурбоКонф.ВставитьТекст(СтрокаТекста);
			КонецЕсли;
			КликнутьПоЭлементу("При выполнении условия:", "флажок");
			Если Не БылаВключена Или Не РазрешитьИзменения Тогда
				КликнутьПоЭлементу("При выполнении условия:", "флажок");
			КонецЕсли;
			ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
			ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
			Если БылаВключена Тогда
				ТурбоКонф.Клавиша(Клавиши.F9);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция АктивироватьУсловиеВОкнеПараметрыТочкиОстанова(выхБылаВключена = Неопределено) Экспорт
	ТурбоКонф.Клавиша(Клавиши.Tab);
	выхБылаВключена = ТурбоКонф.ПолучитьСостояниеФлажка();
	Если Не выхБылаВключена Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Истина);
	КонецЕсли;
	Сообщить("БылВключен=" + выхБылаВключена);
	ТурбоКонф.Клавиша(Клавиши.Tab);
	СтарыйТекст = ТурбоКонф.ПолучитьТекстТекущегоЭлемента();
	Возврат СтарыйТекст;
КонецФункции

//.
// Параметры:
//    МодулиИР - Application {V83.Application}, Неопределено - 
Процедура НачатьОжиданиеМодальныхОконПриложенияИР(МодулиИР, Знач ПоказыватьГлавноеОкно = Истина) Экспорт
	ОповеститьПользователяОПриостановке();
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс(); 
	Если ПоказыватьГлавноеОкно Тогда
		Режим = РежимОткрытияВнешнегоОкна.ГлавноеОкно;
	Иначе
		Режим = РежимОткрытияВнешнегоОкна.Диалог;
	КонецЕсли;
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("", 2000, Конфигуратор.ГлавноеОкно, Режим, Истина, ИдентификаторПроцессаИР);
КонецПроцедуры

Функция ЗакрытьПриложениеИР(Знач ИДКонфигуратора = 0, Знач Причина = "по запросу пользователя", Знач БезСохраненияНастроек = Ложь) Экспорт 
	Если Не БезСохраненияНастроек Тогда
		Если Не ЗакрытьВсеОкнаВПриложенииИР(ИДКонфигуратора) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	ПодключениеИР = ПодключениеИРИзКэша(ИДКонфигуратора);
	Если ПодключениеИР = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	УбитьПроцесс = Ложь;
	Попытка
		ПодключениеИР.ЗавершитьРаботуСистемы(Ложь);
	Исключение
		УбитьПроцесс = Истина;
	КонецПопытки;
	ИДПриложения = ВосстановитьЗначениеСеансаКонфигуратора("ПодключениеИР.ИД", ИДКонфигуратора);
	СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР", Неопределено);
	СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР.ИД", Неопределено);
	СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР.Кэш", Неопределено);
	СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР.ИмяКонфигурации", Неопределено);
	СохранитьЗначениеСеансаКонфигуратора("ПолеТекстаПрограммы", Неопределено);
	ПроцессОС = ПолучитьПроцессОСЛкс(ИДПриложения);
	Причина = ""; // Не сильно полезная информация
	Если ПроцессОС <> Неопределено Тогда
		Если УбитьПроцесс Тогда
			УбитьПроцесс(ПроцессОС, Причина);
		Иначе
			Если Не БезСохраненияНастроек Тогда
				ПоказатьВсплывающееУведомление("Приложение " + НазваниеПриложения() + " завершено " + Причина + ". На его отключение от базы уйдет несколько секунд.", 4000);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Не БезСохраненияНастроек Тогда
			ПоказатьВсплывающееУведомление("Приложение " + НазваниеПриложения() + " завершено " + Причина, 3000);
		КонецЕсли;
	 КонецЕсли;
	Возврат Истина;
КонецФункции

//.
// Параметры:
//    ИДКонфигуратора - ? - 
// Возвращаемое значение:
//    Булево - 
Функция ЗакрытьВсеОкнаВПриложенииИР(Знач ИДКонфигуратора = 0) Экспорт
	Если ЗначениеЗаполнено(Конфигуратор) Тогда
		ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	КонецЕсли;
	ПодключениеИР = ПодключениеИРИзКэша(ИДКонфигуратора);
	Сообщить("ПодключениеИР=" + ПодключениеИР);
	Если ПодключениеИР = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	// Делаем окно видимым, чтобы приложение штатно завершилось и сохранились настройки, включая положения окон
	ВосстановитьОкноПриложения(ПодключениеИР);
	
	// Вопросы не отображаются https://www.hostedredmine.com/issues/967021
	// Почему то не отправляет формам команду закрытия
	// ПодключениеИР.ЗавершитьРаботуСистемы(); 
	
	Попытка
		ВсеФормыЗакрыты = МодулиИР.ирКлиент.ЗакрытьВсеФормыЛкс();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки, СтатусСообщения.Важное);
		ВсеФормыЗакрыты = Истина;
	КонецПопытки;
	Если Не ВсеФормыЗакрыты Тогда
		ПоказатьВсплывающееУведомление("Закройте все окна в приложении " + НазваниеПриложения() + " и повторите команду");
		МодулиИР.ирОбщий.СообщитьЛкс("Закройте все окна");
		Возврат Ложь;
	КонецЕсли; 
	ПодключениеИР.Visible = Ложь;
	ПолеПрограммы = ПолеТекстаПрограммыИзКэша(ИДКонфигуратора);
	Если ПолеПрограммы <> Неопределено Тогда
		Попытка
			ПолеПрограммы.СохранитьСтатистикуВыбораПодсказки();
		Исключение
			// Могут быть ошибки по причине потери связи с ключом защиты
			ОписаниеОшибки = ОписаниеОшибки();
			Сообщить("Ошибка сохранения статистики выбора: " + ОписаниеОшибки, СтатусСообщения.Важное);
		КонецПопытки;
	КонецЕсли;
	ПодключениеИР.СохранитьНастройкиПользователя();
	Возврат Истина;
КонецФункции

// Внешний вызов
Процедура ПередПолучениемДанныхТ9(Параметры, Отказ, СтандартнаяОбработка)
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если ПроверитьРазрешениеИР(Отказ) Тогда
		СтандартнаяОбработка = Ложь;
		УстановитьРежимЗаменыШтатнойПодсказки(Истина);
	КонецЕсли;  
	Сообщить("Обработчик ПередПолучениемДанныхТ9 - " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала) + " мс");
КонецПроцедуры

//&ЗапроситьИнформациюОДокументе

// см. СобытияМодуль.ПриПолученииДанныхТ9 
Процедура ПриПолученииДанныхТ9(Параметры)
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	РазрешитьОткрытиеОкон = Ложь;
	НомерСтрокиТекста = 0;
	НомерКолонкиТекста = 0;
	ТекстМодуля = Параметры.ТекстМодуля; 
	// https://turboconf.ru/Tasks/9796
	//Если Найти(ТекстМодуля, Символы.ВК + Символы.ВК) > 0 Тогда
	//	Сообщить("Жунь");
	//КонецЕсли;
	ПозицияВТексте = Параметры.Позиция;  
	ЭтоДокумент = Параметры.ЭтоДокумент;
	Попытка
		ИмяКонфигурации = Параметры.ИмяКонфигурации;
		//Сообщить("ИмяКонфигурации = " + ИмяКонфигурации);
	Исключение
	КонецПопытки;
	Попытка
		ВыделенныйТекст = Параметры.ВыделенныйТекст;
	Исключение
		// Сделать в Турбоконфе https://turboconf.ru/Tasks/10201
		ВыделенныйТекст = "";
	КонецПопытки;
	Если ТурбоКонф.ПолучитьВерсиюТурбоКонф() > "6.2." Тогда
		ЛиАвтовызов = Параметры.Автовызов; 
		ПоследнийСимвол = Сред(ТекстМодуля, ПозицияВТексте, 1);
		ПредПоследнийСимвол = Сред(ТекстМодуля, ПозицияВТексте - 1, 1);
		Если Истина
			И ЛиАвтовызов
			И СтрДлина(ТекстМодуля) > 1
			И ПозицияВТексте > 1
			И ПредПоследнийСимвол = ПоследнийСимвол
		Тогда
			// после двух одинаковых символов не делаем автооткрытие
			Возврат;
		КонецЕсли;
	Иначе
		ЛиАвтовызов = Ложь;
	КонецЕсли; 
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МодулиИР = МодулиИР(ПодключениеИР);
	// ТурбоКонф.АктивироватьОкно(Конфигуратор.ОкноВызоваСкрипта); // 55мс нужно в случае запуска приложения ИР
	//Сообщить("Активация модулей ИР " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
	ОбновленаСтруктураФормы = Неопределено;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,,, ЭтоДокумент, Истина, ИмяКонфигурации, ОбновленаСтруктураФормы,, Ложь); 
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Если Не ЛиАвтовызов Тогда
			Если СтрДлина(ТекстМодуля) < 100 Тогда
				ПоказатьВсплывающееУведомление("Недостаточно текста для определения его языка");
			Иначе
				ПоказатьВсплывающееУведомление("Неизвестный язык текста");
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТаблицаТипов = ПолеТекстаПрограммы.ТаблицаТиповТекущегоВыражения(Ложь, Ложь, Истина, Истина);
	Если ОбновленаСтруктураФормы = Ложь И ПроверитьОбновитьСтруктуруФормы(ПолеТекстаПрограммы) Тогда
		ТаблицаТипов = ПолеТекстаПрограммы.ТаблицаТиповТекущегоВыражения(Ложь, Ложь, Истина, Истина);
	КонецЕсли;
	КоличествоТипов = ТаблицаТипов.Количество();
	Сообщить("Расчет типов контекста " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЕстьЛучшееСлово = Ложь;
	Успешно = ПолеТекстаПрограммы.ЗаполнитьТаблицуСлов(ТаблицаТипов, Истина, ЕстьЛучшееСлово, РазрешитьОткрытиеОкон, Ложь, Не ЛиАвтовызов, Истина);
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;
	ТипКонтекста = ПолеТекстаПрограммы.ИмяТипаКонтекста();
	//Если Найти(ТипКонтекста, "+") > 0 Тогда
	//	Попытка
	//		ИменаТипов = ПолеТекстаПрограммы.ПредставлениеМассиваСтруктурТипов(ПолеТекстаПрограммы.мТаблицаТиповКонтекста,, 30);
	//	Исключение
	//		// ИР 7.00-
	//		ИменаТипов = "";
	//	КонецПопытки;
	//	Если ЯзыкПрограммы = 0 Тогда
	//		ДобавкаСообщения = "Во встроенном языке это делается проверкой типа https://www.hostedredmine.com/issues/970771 или присвоением с указанием типа в комментарии https://www.hostedredmine.com/issues/967806";
	//	Иначе
	//		ДобавкаСообщения = "В языке запросов это делается через ВЫРАЗИТЬ(<Выражение> КАК <Тип>)";
	//	КонецЕсли;
	//	ПоказатьВсплывающееУведомление("Чтобы увидеть слова другого типа, сузьте тип выражения до: " + ИменаТипов + Символы.ПС + ДобавкаСообщения, 4000);
	//КонецЕсли;
	Сообщить("Заполнение слов контекста " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КэшНаборовСлов = ВосстановитьЗначениеСеансаКонфигуратора("ПодключениеИР.Кэш");
	Если КэшНаборовСлов = Неопределено Тогда
		КэшНаборовСлов = Новый Соответствие();
	КонецЕсли;
	ПереданоСлов = 0;
	ВыведеноСлов = 0;
	Словари = Новый Массив;
	Для каждого КлючИЗначение Из ПолеТекстаПрограммы.мНаборыСлов Цикл
		ИмяНабораСлов = КлючИЗначение.Ключ;
		Если КэшНаборовСлов[ИмяНабораСлов] = Неопределено Тогда
			ТаблицаСлов = НаборСловИзИР(ПолеТекстаПрограммы, ИмяНабораСлов);
			ТурбоКонф.УстановитьСловарьT9(ИмяНабораСлов, ТаблицаСлов);
			КэшНаборовСлов[ИмяНабораСлов] = ТаблицаСлов.Количество();
			ПереданоСлов = ПереданоСлов + КэшНаборовСлов[ИмяНабораСлов];
		КонецЕсли;
		ВыведеноСлов = ВыведеноСлов + КэшНаборовСлов[ИмяНабораСлов];
		Словари.Добавить(ИмяНабораСлов);
	КонецЦикла;
	СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР.Кэш", КэшНаборовСлов);
	ТаблицаСлов = НаборСловИзИР(ПолеТекстаПрограммы);
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Элементы", ТаблицаСлов);
	ПараметрыЗаполнения.Вставить("ДобавляемыеСловари", Словари);
	ПараметрыЗаполнения.Вставить("ТипКонтекста", ТипКонтекста);
	Попытка
		ПараметрыЗаполнения.Вставить("ЭтоКонтекстМодуля", ПолеТекстаПрограммы.мЭтоЛокальныйКонтекстТаблицыСлов);
	Исключение
		// Старая версия ИР
		ПараметрыЗаполнения.Вставить("ЭтоКонтекстМодуля", ТипКонтекста = "Локальный");
	КонецПопытки;
	ЛиДобавитьШаблоны = ЯзыкПрограммы = 0 И ПараметрыЗаполнения.ЭтоКонтекстМодуля И Не ПолеТекстаПрограммы.мЭтоОбъявлениеПсевдонима;
	Попытка
		Параметры.ДобавитьШаблоны = ЛиДобавитьШаблоны;
	Исключение
		// Старая версия Турбоконф
	КонецПопытки;
	ТурбоКонф.УстановитьДанныеT9(ПараметрыЗаполнения);
	ПоказатьСообщенияПриложенияИР(ПолеТекстаПрограммы);
	КоличествоСловВТаблице = ТаблицаСлов.Количество();
	ПереданоСлов = ПереданоСлов + КоличествоСловВТаблице;
	ВыведеноСлов = ВыведеноСлов + КоличествоСловВТаблице;
	Сообщить("Время передачи " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
	Сообщить("Выражение = " + ПолеТекстаПрограммы.мКонтекст + ". Найдено типов " + КоличествоТипов + ". Слов передано " + ПереданоСлов + ", выведено " + ВыведеноСлов + ". Основной тип = " + ТипКонтекста);
	КлючХранения = "" + МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс() + ".ДатаОбновленияКэшаМодулейОтображалась";
	Если ТурбоКонф.ВосстановитьЗначениеСеанса(КлючХранения) = Неопределено Тогда
		ДатаОбновленияКэшаМодулей = МодулиИР.ирОбщий.ДатаОбновленияКэшаМодулейЛкс();
		ДобавкаТекста = "";
		ИмяОбработчика = "";
		Если Не ЗначениеЗаполнено(ДатаОбновленияКэшаМодулей) Тогда
			ДобавкаТекста = ПодсказкаОбновленияКэшаМодулей();
			ИмяОбработчика = "ОбновитьКэшМодулей";
		КонецЕсли;
		ВерсияИР = МодулиИР.ирКэш.НомерВерсииПодсистемыИРЛкс();
		Сообщить("Номер версии ИР = " + ВерсияИР);
		РазмерСтатистикиВыбора = XMLСтрока(ПолеТекстаПрограммы.РазмерСтатистикиВыбора());
		ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Размер статистики выбора - " + РазмерСтатистикиВыбора + ". Кэш модулей - " + ДатаОбновленияКэшаМодулей + "." + ДобавкаТекста, 5000,
			ЭтотОбъект, ИмяОбработчика);
		ТурбоКонф.СохранитьЗначениеСеанса(КлючХранения, 1);
		СписокРекомендаций = Новый Массив;
		Если ЛиДоступнаЧистаяПодсказка() Тогда
			ИмяНастройки = "T9AlwaysShowOnCtrlSpace"; 
			Если ТурбоКонф.ПолучитьЗначениеНастройки(ИмяНастройки) = Ложь Тогда
				Если ЛиДоступнаУстановкаПользовательскихНастроек() Тогда
					ТурбоКонф.УстановитьЗначениеНастройкиПрограммы(ЭтотОбъект, ИмяНастройки, Истина, "Нужно для полной замены подсказки, если в базе разрешено приложение ИР");
				Иначе
					// Есть еще одноименное значение сеанса. Оно устанавливается в УстановитьРежимЗаменыШтатнойПодсказки()
					СписокРекомендаций.Добавить("Включить ""Разработчикам/ Вседа показывать подсказку Т9 вместо штатной подсказки""");
				КонецЕсли; 
			КонецЕсли;
			ИмяНастройки = "T9AllowAutoInvokeInsideCommonStrings"; 
			Если ТурбоКонф.ПолучитьЗначениеНастройки(ИмяНастройки) = Ложь Тогда
				Если ЛиДоступнаУстановкаПользовательскихНастроек() Тогда
					ТурбоКонф.УстановитьЗначениеНастройкиПрограммы(ЭтотОбъект, ИмяНастройки, Истина, "Нужно для подсказки имен свойств в строковых литералах, если в базе разрешено приложение ИР");
				Иначе
					// Есть еще одноименное значение сеанса. Оно устанавливается в УстановитьРежимЗаменыШтатнойПодсказки()
					СписокРекомендаций.Добавить("Разрешить автовызов T9 внутри строковых литералов");
				КонецЕсли; 
			КонецЕсли;
			Если ТурбоКонф.ПолучитьЗначениеНастройки("CloseDDEServerWindow") = Ложь Тогда
				СписокРекомендаций.Добавить("Включить ""Разработчикам/ Автоматически закрывать окно DDE Server Window""");
			КонецЕсли; 
			ЛиАвтоПодсказкаКонфигуратора = ЛиАвтоПодсказкаКонфигуратора(МодулиИР);
			Если ЛиАвтоПодсказкаКонфигуратора Тогда
				ПредложитьУстановитьАвтоподсказку(Ложь);
				//СписокРекомендаций.Добавить("Отключить настройку конфигуратора " + НазваниеНастройкиАвтоподсказкаКонфигуратора());
			КонецЕсли;
		Иначе
			Если ТурбоКонф.ПолучитьЗначениеНастройки("T9AssistSmartFieldsEnabled") = Истина Тогда
				СписокРекомендаций.Добавить("Отключить ""Редактирование/ Подсказывать имена колонок""");
			КонецЕсли; 
		КонецЕсли;
		Если СписокРекомендаций.Количество() > 0 Тогда
			ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Рекомендуется изменить настройки Турбоконф:" + Символы.ПС + "- " + СтрСоединить(СписокРекомендаций, Символы.ПС + "- "),
				20000, ЭтотОбъект, "ОткрытьНастройки");
		КонецЕсли;
		ТурбоКонф.АктивироватьОкно(Конфигуратор.ОкноВызоваСкрипта);
	КонецЕсли;
КонецПроцедуры  

//.
// Параметры:
//    ПолеТекстаПрограммы - ОбработкаОбъект.ирКлсПолеТекстаПрограммы, Неопределено - 
Процедура ПоказатьСообщенияПриложенияИР(Знач ПолеТекстаПрограммы) Экспорт
	Попытка
		СообщенияПользователю = ПолеТекстаПрограммы.ПрочитатьУдалитьСообщенияПользователю();
	Исключение
		// ИР 7.26-
		СообщенияПользователю = "";
	КонецПопытки;
	Если ЗначениеЗаполнено(СообщенияПользователю) Тогда
		ТурбоКонф.ПоказатьВсплывающееУведомление("Приложение " + НазваниеПриложения(), СообщенияПользователю, 5000); 
	КонецЕсли;
КонецПроцедуры  

Процедура ОткрытьНастройки(Параметры = Неопределено) Экспорт
	Попытка
		ТурбоКонф.ОткрытьНастройки("~Dev");
	Исключение 
		// < 6.1.8887.43036
		ТурбоКонф.ОткрытьНастройки();
	КонецПопытки;
КонецПроцедуры

// .
// Параметры:
//    МодулиИР - Application {V83.Application}, Неопределено - нужно передавать чтобы настройка считалась корректно в сложных конфигурациях, а иначе она может считаться из неправильного файла
// Возвращаемое значение:
//    Неопределено - 
Функция ЛиАвтоПодсказкаКонфигуратора(МодулиИР) Экспорт
	Если МодулиИР <> Неопределено Тогда
		ИмяПрофайлаНастроек = МодулиИР.ирКэш.КаталогИзданияПлатформыВПрофилеЛкс(Ложь) + "\1cv8.pfl";
	КонецЕсли;
	ЛиАвтоПодсказкаКонфигуратора = Ложь;
	Для Каждого СтрокаРежима Из ЗамещаемыеРежимыАвтоподсказки() Цикл
		ЛиАвтоПодсказкаКонфигуратора = ЛиАвтоПодсказкаКонфигуратора 
			Или "1" = ТурбоКонф.ПолучитьЗначениеНастройкиКонфигуратора(Конфигуратор.ГлавноеОкно, СтрокаРежима.Имя, ИмяПрофайлаНастроек); // https://turboconf.ru/Tasks/8816
	КонецЦикла;
	//ТекстовыйДокумент = Новый ТекстовыйДокумент;
	//ТекстовыйДокумент.Прочитать(ИмяПрофайлаНастроек);
	//ЗначениеНастройки = МодулиИР.ирОбщий.ТекстМеждуМаркерамиЛкс(ТекстовыйДокумент.ПолучитьТекст(), "{""PointAutoAssist""," + Символы.ПС + "{""B"",", "}", Ложь);
	Возврат ЛиАвтоПодсказкаКонфигуратора;
КонецФункции

Функция НазваниеНастройкиАвтоподсказкаКонфигуратора()
	Возврат """Модули/ Редактирование/ Автоматическая подсказка при наборе '.'""";
КонецФункции

Функция ЛиДоступнаЧистаяПодсказка() Экспорт
	Возврат ТурбоКонф.ПолучитьВерсиюТурбоКонф() >= "6.1.8855.39060";
КонецФункции 

Функция ЛиДоступнаУстановкаПользовательскихНастроек() Экспорт
	Возврат ТурбоКонф.ПолучитьВерсиюТурбоКонф() >= "6.1.8892.26906";
КонецФункции

Функция ПредложитьУстановитьАвтоподсказку(Знач ЛиВключить) Экспорт
	Если Не ТурбоКонф.НайтиЭлементПоИмени("Сервис", "кнопка") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ЛиВключить Тогда
		НазваниеДействия = "Восстановить штатную автоподсказку в коде?";
	Иначе 
		НазваниеДействия = "Нужно заменить штатную автоподсказку в коде.";
	КонецЕсли;
	ПараметрыОбработчика = Новый Структура("ЛиВключить", ЛиВключить);
	ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), НазваниеДействия + "
	|При этом все методы могут свернуться.", 10000, ЭтотОбъект, "ОбработчикУстановитьАвтоподсказкуКонфигуратора", ПараметрыОбработчика);
	Возврат Истина;
КонецФункции

Процедура ОбработчикУстановитьАвтоподсказкуКонфигуратора(Параметры) Экспорт
	УстановитьАвтоподсказкуКонфигуратора(Параметры.ЛиВключить);
КонецПроцедуры

Функция ЗамещаемыеРежимыАвтоподсказки()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Заголовок");
	Результат.Колонки.Добавить("Имя"); 
	Если ТурбоКонф.ПолучитьВерсиюТурбоКонф() >= "6.1.8856.0" Тогда
		Строка = Результат.Добавить();
		Строка.Заголовок = "Автоматическая подсказка при наборе "".""";
		Строка.Имя = "PointAutoAssist";
	КонецЕсли;
	Если ТурбоКонф.ПолучитьВерсиюТурбоКонф() >= "6.2.8907.42118" Тогда
		Строка = Результат.Добавить();
		Строка.Заголовок = "Автоматическая подсказка при наборе ""="" и ""<>""";
		Строка.Имя = "AssignAutoAssist";
		Строка = Результат.Добавить();
		Строка.Заголовок = "Автоматическая подсказка при наборе кавычки";
		Строка.Имя = "QuoteAutoAssist";
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция УстановитьАвтоподсказкуКонфигуратора(ЛиВключить) Экспорт
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	//Если Не ТурбоКонф.НайтиЭлементПоИмени("Сервис", "кнопка") Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	//ИмяЭлемента = "Сервис";
	//КликнутьПоЭлементу("Сервис", "кнопка");
	//Если ТурбоКонф.ПолучитьИмяЭлемента() <> ИмяЭлемента Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	//ИмяЭлемента = "Параметры...";
	////КликнутьПоЭлементу(ИмяЭлемента, "кнопка"); // Почему то не работает, хотя в Мультиметка777238164 работает
	//ТурбоКонф.Клавиша(Клавиши.Up);
	//Если ТурбоКонф.ПолучитьИмяЭлемента() <> ИмяЭлемента Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	//ТурбоКонф.Клавиша(Клавиши.Enter);
	ТурбоКонф.ОткрытьМеню("Сервис", "Параметры...");
	ТурбоКонф.ЖдатьОкно("Параметры", 1000, Истина);
	ЖдатьСменуТекущегоЭлемента(СтарыйИД);
	ТурбоКонф.Ждать(100);
	КликнутьПоЭлементу("Модули", "элемент вкладки");
	КликнутьПоЭлементу("Контекстная подсказка", "элемент вкладки");
	БылиИзменения = Ложь;
	Для Каждого СтрокаРежима Из ЗамещаемыеРежимыАвтоподсказки() Цикл
		Если Не ТурбоКонф.УстановитьФокусНаЭлемент(СтрокаРежима.Заголовок, "флажок") Тогда
			ТурбоКонф.КонтролКлавиша(Клавиши.Escape);
			Возврат Ложь;
		КонецЕсли; 
		Если ТурбоКонф.ПолучитьСостояниеФлажка() <> ЛиВключить Тогда
			//ТурбоКонф.УстановитьСостояниеФлажка(Не ЛиВключить); // для гарантии установки модифированности и записи конфигуратором файла настроек
			ТурбоКонф.УстановитьСостояниеФлажка(ЛиВключить);
			БылиИзменения = Истина;
		КонецЕсли;
	КонецЦикла;
	Если БылиИзменения Тогда
		ПоказатьВсплывающееУведомление("" + ?(ЛиВключить, "Включена", "Отключена") + " штатная автоподсказка редактора кода. Поэтому все методы свернулись.", 5000);
	КонецЕсли;
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
	Возврат Истина;
КонецФункции

Функция НаборСловИзИР(ПолеТекстаПрограммы, ИмяНабораСлов = "")
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТекстСлов = ПолеТекстаПрограммы.ТаблицаСловВJSON(ИмяНабораСлов);
	ТаблицаСлов = ОбъектИзЖСОН(ТекстСлов); // см. ПолеТекстаПрограммы.ТаблицаСловДляАдаптера()
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат = Новый Массив; 
	Если ТаблицаСлов.Количество() > 0 Тогда
		Попытка
			Пустышка = ТаблицаСлов[0].Приоритет;
			ЕстьПриоритет = Истина;
		Исключение 
			// ИР 7.16-
			ЕстьПриоритет = Ложь;
		КонецПопытки;
	КонецЕсли;
	Попытка
		РазделительВариантаКонтекста = ПолеТекстаПрограммы.РазделительВариантаКонтекста();
	Исключение 
		// ИР 7.28-
		РазделительВариантаКонтекста = "$";
	КонецПопытки;
	ПередатьШаблон = ТурбоКонф.ПолучитьВерсиюТурбоКонф() > "6.2.";
	Для Каждого СтрокаСлова Из ТаблицаСлов Цикл
		Представление = СтрокаСлова.Слово;
		ЗаменятьРодителяПриВставке = Найти(Представление, РазделительВариантаКонтекста) > 0;
		Если ЗаменятьРодителяПриВставке Тогда
			Фрагменты = СтрРазделитьЛкс(Представление, РазделительВариантаКонтекста);
			Фильтр = Фрагменты[0];
			ТекстШаблона = Фрагменты[1] + "." + Фрагменты[0];
			Если СтрокаСлова.ЛиМетод Тогда
				ТекстШаблона = ТекстШаблона + "(<!>)";
			КонецЕсли;
		Иначе
			Фильтр = Представление;
			ТекстШаблона = Неопределено; 
			// <!> - позиция каретки
			// <?> - позиция каретки и автовызов подсказки
			Если Представление = "Новый" Тогда
				ТекстШаблона = Представление + " <?>"; 
			ИначеЕсли Представление = "Перейти" Тогда
				ТекстШаблона = Представление + " ~<?>";
			ИначеЕсли Ложь
				Или Представление = "КонецЕсли" 
				Или Представление = "КонецЦикла"
				Или Представление = "КонецПопытки"
			Тогда
				ТекстШаблона = Представление + ";";
			ИначеЕсли СтрокаСлова.ЛиМетод Тогда
				// Лишняя пара скобок вставляется https://turboconf.ru/Tasks/9522
				Если Представление = "Тип" Тогда
					ТекстШаблона = Представление + "(""<?>"")";
					//СтрокаСлова.ЛиМетод = Ложь;
				ИначеЕсли Представление = "НСтр" Тогда
					ТекстШаблона = Представление + "(""ru='<!>'"")"; 
					//СтрокаСлова.ЛиМетод = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ЭлементСписка = Новый Соответствие();
		ЭлементСписка.Вставить("Представление", Представление);
		ЭлементСписка.Вставить("Фильтр", Фильтр);
		ЭлементСписка.Вставить("ЭтоМетод", СтрокаСлова.ЛиМетод);
		ЭлементСписка.Вставить("ВозвращаетЗначение", СтрокаСлова.ЛиРез);
		ЭлементСписка.Вставить("Тип", СтрокаСлова.Тип);
		ЭлементСписка.Вставить("ПредполагаемоеЗначение", Не СтрокаСлова.ЛиТочный);
		ЭлементСписка.Вставить("АвтоТочкаСЗапятойОтключена", Не СтрокаСлова.ЛиМетод Или ЗначениеЗаполнено(СтрокаСлова.Тип));
		ЭлементСписка.Вставить("АвтоперемещениеКурсораОтключено", Ложь);
		ЭлементСписка.Вставить("ИзКонтекста", Истина);
		//ЭлементСписка.Вставить("ЕстьПараметры", СтрокаСлова.Слово <> "Количество");
		ЭлементСписка.Вставить("ЕстьПараметры", Ложь);
		ЭлементСписка.Вставить("ЗаменятьРодителяПриВставке", ЗаменятьРодителяПриВставке);
		Если ПередатьШаблон Тогда
			ЭлементСписка.Вставить("ТекстШаблона", ТекстШаблона);
		КонецЕсли;
		Если ЕстьПриоритет Тогда
			ЭлементСписка.Вставить("Приоритет", СтрокаСлова.Приоритет);
		Иначе
			ЭлементСписка.Вставить("Приоритет", 0);
		КонецЕсли;
		Результат.Добавить(ЭлементСписка);
	КонецЦикла;
	Сообщить("Время передачи набора слов """ + ИмяНабораСлов + """ = " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
	Возврат Результат; 
КонецФункции

// Функция - Поле текста программы ИР
// Параметры:
//   ПодключениеИР -  - 
//   ТекстПоля - Строка, Неопределено - "Неопределено" не обновляет текст поля
//   Позиция0Поле - Число - с 0; если 0, то текущий документ получается заново
//   ВыделенныйТекст -  - 
//   ПереходитьВоВложенныйКонтекст -  - 
//   КакВызовМетода -  - 
//   ТребоватьДокумент - Булево - если Истина, то если находимся не в документе, то вернуть Неопределено
//   РазрешитьПоследнийДокумент -  - 
//   ИмяКонфигурации -  - 
//   выхОбновленаСтруктураФормы -  - 
//   выхИмяРасширения -  - 
//   ИдентифицироватьДокумент - Булево - НАДО установливать, если команда сделала переход в другой модуль
// Возвращаемое значение:
//    - 
Функция ПолеТекстаПрограммыИР(Знач ПодключениеИР, Знач ТекстПоля = "", Знач Позиция0Поле = 0, Знач ВыделенныйТекст = "", ПереходитьВоВложенныйКонтекст = Истина, Знач КакВызовМетода = Неопределено,
	Знач ТребоватьДокумент = Истина, Знач РазрешитьПоследнийДокумент = Ложь, Знач ИмяКонфигурации = "", выхОбновленаСтруктураФормы = Ложь, выхИмяРасширения = "", Знач ИдентифицироватьДокумент = Неопределено,
	Знач СсылкаСтроки = "", выхПереходПоСсылкеВыполнен = Ложь)

	выхПереходПоСсылкеВыполнен = Ложь;
	ТекстМодуля = ТекстПоля;
	ПозицияВТексте = Позиция0Поле;
	Если ИдентифицироватьДокумент = Неопределено Тогда
		ИдентифицироватьДокумент = ЗначениеЗаполнено(ПозицияВТексте);
	КонецЕсли;
	МоментЗапускаОбщий = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МоментЗапуска = МоментЗапускаОбщий;
	ЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	Сообщить("-ЗаголовокОкна = " + ЗаголовокОкна);
	Если ЗаголовокОкна = "Выражение" И ТурбоКонф.ПолучитьИмяЭлемента() = "Значение" Тогда
		// Антибаг Турбоконфа https://turboconf.ru/Tasks/9912
		Возврат Неопределено;
	КонецЕсли;
	Если ТребоватьДокумент = Неопределено Тогда
		ТребоватьДокумент = ЭтоДокумент();
	КонецЕсли;
	Если Истина
		И ТребоватьДокумент 
		И ЗаголовокОкна <> "Параметры точки останова" 
		И ЗаголовокОкна <> "Ввод выражения" 
	Тогда
		Попытка
			Если ПозицияВТексте > 0 И Не ИдентифицироватьДокумент Тогда
				ТекущийДокумент = Конфигуратор.ТекущийДокумент;
			Иначе 
				ТекущийДокумент = ТурбоКонф.ИдентифицироватьТекущийДокумент(); 
			КонецЕсли;
		Исключение
			ТекущийДокумент = Неопределено;
		КонецПопытки;
		Если Истина
			И ТекущийДокумент <> Неопределено 
			//И ТекущийДокумент.ТипДокумента <> "СлужебныеСообщения" 
			//И ТекущийДокумент.ТипДокумента <> "Шаблон"
			//И ТекущийДокумент.ТипДокумента <> "Макет"
		Тогда
			ЗаголовокДокумента = ТекущийДокумент.Заголовок;
			ИмяКонфигурации = ТекущийДокумент.ИмяКонфигурации;
		КонецЕсли;
	ИначеЕсли РазрешитьПоследнийДокумент Тогда
		Попытка
			ПоследнийДокумент = Конфигуратор.ПоследнийДокумент;
		Исключение
			ПоследнийДокумент = Неопределено;
		КонецПопытки;
		Если Истина
			И ПоследнийДокумент <> Неопределено
			И ПоследнийДокумент.Заголовок = "Ввод выражения" 
		Тогда
			ПоследнийДокумент = ВосстановитьЗначениеСеансаКонфигуратора("ПоследнийДокумент");
		КонецЕсли;
		Если ПоследнийДокумент <> Неопределено Тогда
			ЗаголовокДокумента = ПоследнийДокумент.Заголовок;
			ИмяКонфигурации = ПоследнийДокумент.ИмяКонфигурации;
			ТекстМодуля = ПоследнийДокумент.Текст;
			ПозицияВТексте = ПоследнийДокумент.Позиция;
			СтарыйПоследнийДокумент = Новый Структура("Заголовок, ИмяКонфигурации, Текст, Позиция");
			ЗаполнитьЗначенияСвойств(СтарыйПоследнийДокумент, ПоследнийДокумент);
			СохранитьЗначениеСеансаКонфигуратора("ПоследнийДокумент", ПоследнийДокумент);
		КонецЕсли;
	КонецЕсли;
	КлючКэша = "ПолеТекстаПрограммы";
	ПолеТекстаПрограммы = ВосстановитьЗначениеСеансаКонфигуратора(КлючКэша);
	Попытка
		Пустышка = ПолеТекстаПрограммы.мИмяМодуля; 
	Исключение
		ПолеТекстаПрограммы = Неопределено;
	КонецПопытки;
	Если ПолеТекстаПрограммы = Неопределено Тогда
		МодулиИР = МодулиИР(ПодключениеИР);
		ПолеТекстаПрограммы = МодулиИР.ирКэш.ПолеТекстаПрограммы(ЯзыкПрограммы);
		СохранитьЗначениеСеансаКонфигуратора(КлючКэша, ПолеТекстаПрограммы);
		// Сообщить("ПолеТекстаПрограммы0 " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
		// МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
	Если Ложь
		Или ЗаголовокОкна = "Запрос" 
		Или ЗаголовокОкна = "Произвольное выражение" 
		Или ЗаголовокОкна = "Динамический список" 
		Или ЗаголовокОкна = "Ограничение доступа"
		Или ПолеТекстаПрограммы.ЛиТекстЯзыкаЗапросовЛкс(Лев(ТекстМодуля, 1000))
	Тогда
		ЯзыкПрограммы = 1;
	Иначе
		ЯзыкПрограммы = 0;
	КонецЕсли;
	ПолеТекстаПрограммы.ЯзыкПрограммы = ЯзыкПрограммы;
	Если СтрНачинаетсяС(ЗаголовокОкна, "Настройка объединения модулей ")  Тогда
		СжатоеИмяМодуля = СтрРазделить(ЗаголовокОкна, " ")[3];
		ТекстМодуля = Неопределено;
	ИначеЕсли Истина
		И ЯзыкПрограммы = 0
		И (ТребоватьДокумент Или РазрешитьПоследнийДокумент)
	Тогда
		Если Не ЗначениеЗаполнено(ЗаголовокДокумента) Тогда
			// для защиты от затирания модуля формы, если вызываем переход на ее странице не модуля
			Возврат Неопределено;
		КонецЕсли;
		ПередатьИзмененияМодулей(ПодключениеИР, ПолеТекстаПрограммы);
		СжатоеИмяМодуля = СжатоеИмяМодуля(ПодключениеИР, ТекстМодуля, ИмяКонфигурации, ЗаголовокДокумента, Не РазрешитьПоследнийДокумент И ТекстМодуля <> Неопределено, выхИмяРасширения);
		Если СжатоеИмяМодуля = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	Сообщить("-Определение имени модуля " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Сообщить("-Сжатое имя модуля = "+ СжатоеИмяМодуля);
	// Основное время уходит на передачу большого текста. 10к строк передаются 10мс
	//ПолеТекстаПрограммы.мСтарыйОригинальныйТекст = ТекстМодуля; // Гипотеза не подтвердилась - Для ускорения передаем через свойство, а не параметр, т.к. через параметр потом измененное снаружи свойство обратно поедет
	Попытка
		ПолеТекстаПрограммы.ПрочитатьУдалитьСообщенияПользователю();
	Исключение
		// ИР 7.26-
	КонецПопытки;
	Если ПустаяСтрока(ТекстМодуля) Тогда
		Пустышка = 0; // Вместо условной точки останова
	КонецЕсли;
	ПолеТекстаПрограммы.УстановитьТекст(ТекстМодуля, Ложь,, Ложь, СжатоеИмяМодуля,, ПозицияВТексте + 1, ПозицияВТексте + 1 + СтрДлина(ВыделенныйТекст));
	Сообщить("-Передача текста модуля " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ПоказатьСообщенияПриложенияИР(ПолеТекстаПрограммы);
	Если ТребоватьДокумент Тогда
		ПолеТекстаПрограммы.КончитьОбработкуКоманды(); // Перенес в ПолеТекстаПрограммы.УстановитьТекст
		выхОбновленаСтруктураФормы = ПроверитьОбновитьСтруктуруФормы(ПолеТекстаПрограммы);
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(СсылкаСтроки) Тогда
		ПолеТекстаПрограммы.ЗапомнитьИсточникПерехода();
		Если ПолеТекстаПрограммы.ПерейтиПоСсылкеСтрокиМодуля(СсылкаСтроки) Тогда
			ПозицияВТексте = ПолеТекстаПрограммы.ПолеТекста.ВыделениеОдномерное().Конец - 1;
			выхПереходПоСсылкеВыполнен = Истина;
		КонецЕсли;
	КонецЕсли;
	ПолеТекстаПрограммы.РазобратьТекущийКонтекст(Ложь, Ложь, КакВызовМетода, 0, 0, ПереходитьВоВложенныйКонтекст, ПозицияВТексте + 1);

	Сообщить("-Разбор позици в модуле " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Если Истина
		И ЯзыкПрограммы = 0 
		И ЗначениеЗаполнено(ТекстПоля) 
		И ТекстПоля <> ТекстМодуля
		И (Ложь
			Или РазрешитьПоследнийДокумент 
			Или ТекстМодуля = Неопределено)
	Тогда
		// например в окне "Вычислить" или "Условие точки останова"
		Сообщить("-текст поля выражения = " + Лев(ТекстПоля, 1000));
		ТекстПоля = СокрП(ТекстПоля);
		Если ТурбоКонф.ПолучитьВерсиюAPI() < 6 Тогда
			АктивноеОкно = ТурбоКонф.ПолучитьАктивноеОкно();
			КлючХранения = "УведомлениеКонтекста." + АктивноеОкно;
			УжеУведомляли = ВосстановитьЗначениеСеансаКонфигуратора(КлючХранения);
			Если УжеУведомляли = Неопределено Тогда
				ИмяТекущегоМетода = ВывестиКонтекстЯзыка(ПолеТекстаПрограммы);
				ПоказатьВсплывающееУведомление("Вычисление в контексте метода """ + ИмяТекущегоМетода + """. Используйте команду ""ИР.ВычислитьВыражение"" для передачи контекста");
				СохранитьЗначениеСеансаКонфигуратора(КлючХранения, 1);
			КонецЕсли;
		КонецЕсли;
		ПолеТекстаПрограммы.ПродолжитьОбработкуКоманды();
		ПолеТекстаПрограммы.ПрочитатьНачалоИКонецТекущейСтроки(ТекстПоля, Позиция0Поле + 1);
		ПолеТекстаПрограммы.РазобратьКонтекстСтроки(Ложь, Ложь, КакВызовМетода);
		ПолеТекстаПрограммы.мПозицияВБлоке = СтрДлина(ПолеТекстаПрограммы.мТекстБлока);
		ПолеТекстаПрограммы.мПредшествующийТекст = ПолеТекстаПрограммы.мТекстДляПоискаОпределения + " " + ПолеТекстаПрограммы.мТекущаяСтрокаНачало;
		Сообщить("-Добавка динамического кода " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
	КонецЕсли;
	ВывестиКонтекстЯзыка(ПолеТекстаПрограммы);
	
	Если ЗначениеЗаполнено(ПозицияВТексте) И ЯзыкПрограммы = 0 И ЗначениеЗаполнено(СжатоеИмяМодуля) Тогда
		// Последние методы
		ПоследниеМетоды = ВосстановитьЗначениеСеансаКонфигуратора("ПоследниеМетоды");
		Если ПоследниеМетоды = Неопределено Тогда
			ПоследниеМетоды = Новый СписокЗначений;
		КонецЕсли;
		СжатоеИмяМодуля = СжатоеИмяМодуля + ": ";
		СжатоеИмяМодуля = СтрЗаменить(СжатоеИмяМодуля, ".Модуль:", ":");
		ПолноеИмяМетода = СжатоеИмяМодуля + ПолеТекстаПрограммы.ИмяТекущегоМетода();
		ЭлементСписка = ПоследниеМетоды.НайтиПоЗначению(ПолноеИмяМетода);
		Если ЭлементСписка = Неопределено Тогда
			ЭлементСписка = ПоследниеМетоды.Вставить(0, ПолноеИмяМетода);
			Сдвиг = 1;
		Иначе
			Сдвиг = -ПоследниеМетоды.Индекс(ЭлементСписка);
			ПоследниеМетоды.Сдвинуть(ЭлементСписка, Сдвиг);
		КонецЕсли;
		Если Сдвиг <> 0 Тогда
			ЭлементСписка.Представление = ПолеТекстаПрограммы.СсылкаСтрокиМодуля();
			Пока ПоследниеМетоды.Количество() > МаксЧислоПоследнихМетодов() Цикл
				ПоследниеМетоды.Удалить(ПоследниеМетоды.Количество() - 1);
			КонецЦикла;
			СохранитьЗначениеСеансаКонфигуратора("ПоследниеМетоды", ПоследниеМетоды);
		КонецЕсли;
	КонецЕсли;
	Сообщить("Обновление поля текста программы " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапускаОбщий) + " мс");
	Возврат ПолеТекстаПрограммы;
КонецФункции

Функция МаксЧислоПоследнихМетодов() Экспорт
	Возврат 40;
КонецФункции

//.
// Параметры:
//    ПодключениеИР - Application {V83.Application}, Неопределено - 
//    ПолеТекстаПрограммы - , ОбработкаОбъект.ирКлсПолеТекстаПрограммы, Неопределено - 
Процедура ПередатьИзмененияМодулей(Знач ПодключениеИР, Знач ПолеТекстаПрограммы = Неопределено) Экспорт
	Попытка
		ДокументыМодулей = ТурбоКонф.ПолучитьМодифицированныеДокументы(Конфигуратор.PID);
	Исключение
		// 6.0.8749.33912+
		ДокументыМодулей = Новый Массив;
	КонецПопытки;
	Если ДокументыМодулей.Количество() > 0 Тогда
		Если ПолеТекстаПрограммы = Неопределено Тогда
			ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, "", 0);
		КонецЕсли;
		СледДокумент = Неопределено; // ОбработкаОбъект.Документ
		Для Индекс = 1 - ДокументыМодулей.Количество() По 0 Цикл // Обратный обход
			Документ = ДокументыМодулей[-Индекс];
			Если Истина
				И Конфигуратор.ТекущийДокумент <> Неопределено
				И Документ.DocumentRuntimeId = Конфигуратор.ТекущийДокумент.DocumentRuntimeId 
			Тогда
				Продолжить;
			КонецЕсли;
			Если Истина
				И СледДокумент <> Неопределено
				И СледДокумент.DocumentRuntimeId = Документ.DocumentRuntimeId
			Тогда
				// Ошибка Турбоконф https://turboconf.ru/Tasks/9074
				Продолжить;
			КонецЕсли;
			ИмяКонфигурации = Документ.ИмяКонфигурации;
			Если Не ЗначениеЗаполнено(ИмяКонфигурации) Тогда
				//  если с момента открытия модуля в нем что то изменили без вызова команд требующих идентификации документа
				// https://turboconf.ru/Tasks/9074
				Если СтрДлина(Документ.Текст) < 1000 Тогда 
					Продолжить;
				КонецЕсли; 
				НачалоТекста = Лев(Документ.Текст, 50000); // Для ускорения анализа
				Если Ложь
					Или Найти(НачалоТекста, Символы.ПС + "&После(""") > 0
					Или Найти(НачалоТекста, Символы.ПС + "&Перед(""") > 0
					Или Найти(НачалоТекста, Символы.ПС + "&Вместо(""") > 0
					Или Найти(НачалоТекста, Символы.ПС + "&ИзменениеИКонтроль(""") > 0
				Тогда 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			СледДокумент = Документ;
			МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ПолноеИмяМодуля = СжатоеИмяМодуля(ПодключениеИР, Документ.Текст, ИмяКонфигурации, Документ.Заголовок, Ложь);
			Если ПолноеИмяМодуля = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Сообщить("Синхронизация модуля " + ПолноеИмяМодуля + " " + Документ.DocumentRuntimeId + " начата. Длина текста - " + СтрДлина(Документ.Текст) + " символов. Последняя позиция " + Документ.Позиция);
			ПолеТекстаПрограммы.УстановитьТекст(Документ.Текст, Ложь,, Ложь, ПолноеИмяМодуля,, Документ.Позиция, Документ.Позиция);
			Сообщить("Синхронизация модуля " + ПолноеИмяМодуля + " " + Документ.DocumentRuntimeId + " выполнена за " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментЗапуска) + " мс");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//.
// Параметры:
//    ПодключениеИР - Application {V83.Application}, Неопределено - 
//    ИмяКонфигурации - Строка, Неопределено - 
Функция СжатоеИмяМодуля(Знач ПодключениеИР, Знач ТекстМодуля, Знач ИмяКонфигурации, Знач ЗаголовокДокумента, Знач ПроверятьЧтоЭтоОкноСообщений = Истина, выхИмяРасширения = "") Экспорт
	Сообщить("ИмяКонфигурации = " + ИмяКонфигурации);
	Если ИмяКонфигурации = "?" Тогда 
		Если ПроверятьЧтоЭтоОкноСообщений Тогда
			ТурбоКонф.ПоказатьВсплывающееУведомление(, "TurboConf не смог связать окно модуля с конфигурацией. Переоткройте окно модуля.", 4000);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	Если ПустаяСтрока(ЗаголовокДокумента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПороговаяДлина = 30000; // для 4х Найти() - 2мс
	ЭтоМодульВнешнегоОбъекта = Ложь;
	НачалоМодуля = Прав(ТекстМодуля, ПороговаяДлина);
	Если Истина
		И Найти(ТекстМодуля, Символы.ПС + "КонецФункции") = 0
		И Найти(ТекстМодуля, Символы.ПС + "КонецПроцедуры") = 0
		И Найти(ТекстМодуля, Символы.ПС + "EndFunction") = 0
		И Найти(ТекстМодуля, Символы.ПС + "EndProcedure") = 0
		// И Найти(ТекстМодуля, "|ВЫБРАТЬ") = 0
		// И Найти(ТекстМодуля, "|SELECT") = 0
	Тогда
		Если СтрДлина(НачалоМодуля) = ПороговаяДлина Тогда
			// Это текст НЕ на встроенном языке
			ЯзыкПрограммы = Неопределено;
		Иначе 
			ПороговаяДлина = 3000; // для 4х Найти() и 30000 символов - 2мс
			НачалоМодуля = Прав(ТекстМодуля, ПороговаяДлина);
			Если Истина
				И Найти(ТекстМодуля, "//") = 0
				И Найти(ТекстМодуля, "КонецЕсли") = 0
				И Найти(ТекстМодуля, "EndIf") = 0
				И Найти(ТекстМодуля, "=") = 0
				И Найти(ТекстМодуля, ");") = 0
				И Найти(ТекстМодуля, "()") = 0
				И Найти(ТекстМодуля, "Перем ") = 0
				И Найти(ТекстМодуля, "|") = 0
				И Найти(ТекстМодуля, "&НаКлиенте") = 0
				И Найти(ТекстМодуля, "&НаСервере") = 0
				И Найти(ЗаголовокДокумента, ": Модуль") = 0
				И НРег(Лев(ТекстМодуля, 4)) <> "проц"
				И НРег(Лев(ТекстМодуля, 4)) <> "функ"
			Тогда
				// Это текст НЕ на встроенном языке
				ЯзыкПрограммы = Неопределено;
			ИначеЕсли ПроверятьЧтоЭтоОкноСообщений Тогда
				// Проверка на окно сообщений
				ПозицияКаретки1 = ТурбоКонф.ПолучитьПозициюКаретки();
				ТурбоКонф.КонтролАльтКлавиша(Клавиши.O);
				ТурбоКонф.Ждать(20);
				ПозицияКаретки2 = ТурбоКонф.ПолучитьПозициюКаретки(); 
				Если ПозицияКаретки1.X = ПозицияКаретки2.X И ПозицияКаретки1.Y = ПозицияКаретки2.Y Тогда
					// Теперь точно узнали что это окно сообщений
					ЯзыкПрограммы = Неопределено;
					// ПоказатьВсплывающееУведомление("Чтобы анализ модуля мог определить его тип, добавьте метод");
				Иначе
					ТурбоКонф.Клавиша(Клавиши.Escape);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЯзыкПрограммы = Неопределено Тогда
		Возврат Неопределено; 
	КонецЕсли;
	ПолноеИмяМодуля = СжатоеИмяОбъектаОкна(ПодключениеИР, ИмяКонфигурации, ЗаголовокДокумента, ЭтоМодульВнешнегоОбъекта, выхИмяРасширения);
	Возврат ПолноеИмяМодуля;
КонецФункции

//.
// Параметры:
//   ПодключениеИР - Application {V83.Application}, Неопределено - 
//   ИмяКонфигурации - Строка, Неопределено - 
//   ЗаголовокДокумента - Строка - 
//   ЭтоМодульВнешнегоОбъекта - Булево - 
//   выхИмяРасширения - Строка - 
// Возвращаемое значение:
//   Произвольный, Строка, Неопределено - 
Функция СжатоеИмяОбъектаОкна(Знач ПодключениеИР, Знач ИмяКонфигурации = "", Знач ЗаголовокДокумента = "", Знач ЭтоМодульВнешнегоОбъекта = Ложь, выхИмяРасширения = "") Экспорт
	Если Не ЗначениеЗаполнено(ЗаголовокДокумента) Тогда
		ЗаголовокКонфигуратора = ТурбоКонф.ПолучитьЗаголовокКонфигуратора(Конфигуратор.ГлавноеОкно);
		ЗаголовокДокумента = ЧистыйЗаголовокДочернегоОкна(ЗаголовокКонфигуратора);
		//Сообщить("Заголовок документа свежий = " + ЗаголовокКонфигуратора);
		Если Не ЗначениеЗаполнено(ЗаголовокДокумента) Тогда
			ЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
			ЗаголовокДокумента = ЗаголовокОкна;
		КонецЕсли;
	КонецЕсли;
	Сообщить("Заголовок документа = " + ЗаголовокДокумента);
	Если Ложь
		Или ЗаголовокДокумента = "?"
		Или ЗаголовокДокумента = "..." // Соединенные окна документов https://turboconf.ru/Tasks/9359
		Или ЛиАктивноГлавноеОкно(ЗаголовокДокумента)
	Тогда
		ПоказатьВсплывающееУведомление("Разверните окно модуля, чтобы анализатор мог определить его имя", 3000);
		//Возврат Неопределено;
		ЗаголовокДокумента = "Внешняя обработка: Модуль объекта";
	КонецЕсли;
	МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	// Мультиметка250108_112016
	ПолноеИмяМодуля = ЗаголовокДокумента;
	Если ПолноеИмяМодуля = "Конфигуратор" Тогда
		// ПоказатьВсплывающееУведомление("Чтобы анализ модуля мог определить его имя, нужно развернуть его окно");
		ПолноеИмяМодуля = "";
	Иначе
		Если СтрНачинаетсяС(ПолноеИмяМодуля, "Конфигурация ") Тогда
			ПервыйФрагмент = СтрРазделить(ПолноеИмяМодуля, ":")[0];
			ПолноеИмяМодуля = СтрЗаменить(ПолноеИмяМодуля, ПервыйФрагмент + ":", "Общая форма") + ":";
		КонецЕсли;
		ФрагментыСборки = Новый Массив;
		ЭтоМодульВнешнегоОбъекта = Ложь;
		Если Найти(ПолноеИмяМодуля, "\") > 0 Тогда
			// Файл
			ФрагментыДвоеточия = СтрРазделить(ПолноеИмяМодуля, ":");
			Если СтрНачинаетсяС(ПолноеИмяМодуля, "\\") Тогда
				// Сетевой файл
				Если ФрагментыДвоеточия.Количество() < 2 Тогда
					ТипМодуля = "Неизвестный";
				ИначеЕсли Найти(ФрагментыДвоеточия[1], " ") > 0 Тогда
					ТипМодуля = ТРег(СтрЗаменить(ФрагментыДвоеточия[1], " ", ""));
				Иначе
					ТипМодуля = ФрагментыДвоеточия[1];
				КонецЕсли;
				ПолноеИмяМодуля = "Ф::" + ФрагментыДвоеточия[0] + "::" + ТипМодуля;
				ЭтоМодульВнешнегоОбъекта = Истина;
			ИначеЕсли Найти(ПолноеИмяМодуля, ":\") > 0 Тогда
				// Локальный файл
				Если ФрагментыДвоеточия.Количество() < 3 Тогда
					ТипМодуля = "Неизвестный";
				ИначеЕсли Найти(ФрагментыДвоеточия[2], " ") > 0 Тогда
					ТипМодуля = ТРег(СтрЗаменить(ФрагментыДвоеточия[2], " ", ""));
				Иначе
					ТипМодуля = ФрагментыДвоеточия[2];
				КонецЕсли;
				ПолноеИмяМодуля = "Ф::" + ФрагментыДвоеточия[0] + ":" + ФрагментыДвоеточия[1] + "::" + ТипМодуля;
				ЭтоМодульВнешнегоОбъекта = Истина;
			КонецЕсли;
		Иначе
			ПолноеИмяМодуля = СтрЗаменить(ПолноеИмяМодуля, "-", " "); // Нужно для Http-Сервис и Бизнес-Процесс
			ФрагментыДвоеточия = СтрРазделить(ПолноеИмяМодуля, ":");
			Если ФрагментыДвоеточия[0] = "Внешняя обработка" Или ФрагментыДвоеточия[0] = "Внешний отчет" Тогда
				ФрагментыДвоеточия[0] = ФрагментыДвоеточия[0] + " Незаписанное";
				ЭтоМодульВнешнегоОбъекта = Истина;
			КонецЕсли;
			ФрагментыПробела = СтрРазделить(ПолноеИмяМодуля, " ");
			Если Прав(ФрагментыПробела[0], 1) = ":" Тогда
				ПолноеИмяМодуля = СтрЗаменить(ПолноеИмяМодуля, ФрагментыПробела[0], ""); // удаляем имя конфигурации из представления модуля конфигурации
				ФрагментыДвоеточия = СтрРазделить(ПолноеИмяМодуля, ":");
			КонецЕсли;
			Если ФрагментыДвоеточия.Количество() > 1 Тогда
				ФрагментыОбъекта = СтрРазделить(СокрЛП(ФрагментыДвоеточия[0]), " ");
				ФрагментыДвоеточия.Удалить(0);
				ИмяОбъекта = ФрагментыОбъекта[ФрагментыОбъекта.ВГраница()];
				ФрагментыОбъекта.Удалить(ФрагментыОбъекта.ВГраница());
				Если ФрагментыОбъекта.Количество() > 0 Тогда
					ТипОбъекта = СтрЗаменить(ТРег(СтрСоединить(ФрагментыОбъекта, " ")), " ", "");
					ФрагментыСборки.Добавить(ТипОбъекта);
				КонецЕсли;
				ФрагментыСборки.Добавить(ИмяОбъекта);
			КонецЕсли;
			ТипМодуля = СокрЛП(ФрагментыДвоеточия[0]);
			Если ЗначениеЗаполнено(ТипМодуля) Тогда
				Если Найти(ТипМодуля, " ") > 0 Тогда
					ТипМодуля = СтрЗаменить(ТРег(ТипМодуля), " ", "");
				КонецЕсли;
				ФрагментыСборки.Добавить(ТипМодуля);
			КонецЕсли;
			ПолноеИмяМодуля = СтрСоединить(ФрагментыСборки, ".");
			ПолноеИмяМодуля = СтрРазделить(ПолноеИмяМодуля, "(")[0]; // При клонировании окна модуля каждому экземпляру добавляется (N) в конец заголовка
		КонецЕсли;
		МоментЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ИмяОсновнойКонфигурации = ИмяОсновнойКонфигурации(ПодключениеИР);
		Если Не ЭтоМодульВнешнегоОбъекта Тогда
			Если ПустаяСтрока(ИмяКонфигурации) Тогда
				ИмяКонфигурации = ИмяОсновнойКонфигурации;
			КонецЕсли;
			Если ИмяКонфигурации <> ИмяОсновнойКонфигурации Тогда
				ПолноеИмяМодуля = ИмяКонфигурации + " " + ПолноеИмяМодуля;
				выхИмяРасширения = ИмяКонфигурации;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ПолноеИмяМодуля;
КонецФункции

//.
// Параметры:
//    ПодключениеИР - Application {V83.Application}, Неопределено  -  
// Возвращаемое значение:
//    Строка - 
Функция ИмяОсновнойКонфигурации(Знач ПодключениеИР) Экспорт 
	ИмяОсновнойКонфигурации = ВосстановитьЗначениеСеансаКонфигуратора("ПодключениеИР.ИмяКонфигурации");
	Если ИмяОсновнойКонфигурации = Неопределено Тогда
		ИмяОсновнойКонфигурации = ПодключениеИР.Метаданные.Имя; // 3мс
		СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР.ИмяКонфигурации", ИмяОсновнойКонфигурации);
	КонецЕсли;
	Возврат ИмяОсновнойКонфигурации;
КонецФункции

Процедура ПерейтиВПоследниеМетоды()
	ПоследниеМетоды = ВосстановитьЗначениеСеансаКонфигуратора("ПоследниеМетоды"); // СписокЗначений
	Если ПоследниеМетоды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИндексВыбранного = ВыбратьЭлементСписка(ПоследниеМетоды.ВыгрузитьЗначения(),,,, "Выберите метод",,,, Ложь);
	Если ИндексВыбранного = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ссылка = ПоследниеМетоды[ИндексВыбранного].Представление;
	ПерейтиПоСсылкеМД(Ссылка);
	ТурбоКонф.ОтжатьМодификаторы(); // Иначе будет иногда залипать CTRL
КонецПроцедуры

// . 
// Параметры:
//   ПолеТекстаПрограммы -  - 
// Возвращаемое значение:
//   Булево, Неопределено - загружена ли новая структура в ИР
Функция ПроверитьОбновитьСтруктуруФормы(ПолеТекстаПрограммы)
	Результат = Ложь;
	ДатаОбновленияСтруктурыФормы = ПолеТекстаПрограммы.ДатаОбновленияСтруктурыФормыМодуля();
	Если ДатаОбновленияСтруктурыФормы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Сообщить("ДатаОбновленияСтруктурыФормы=" + ДатаОбновленияСтруктурыФормы);
	Если Истина
		И ТипЗнч(ДатаОбновленияСтруктурыФормы) = Тип("Дата") 
		И ТекущаяДата() - ДатаОбновленияСтруктурыФормы > 300 // автообновление не чаще раза в Х секнуд
	Тогда
		ОбновитьСтруктуруФормы(ПолеТекстаПрограммы, ЗначениеЗаполнено(ДатаОбновленияСтруктурыФормы)); 
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

//.
// Параметры:
//    ПолеТекстаПрограммы - ОбработкаОбъект.ирКлсПолеТекстаПрограммы, Неопределено - 
Процедура ОбновитьСтруктуруФормы(Знач ПолеТекстаПрограммы, Знач ВФоне = Ложь) Экспорт
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТекстСтруктурыФормы = ""; 
	//ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно); // 50мс Без этого часто не будет срабатывать в вызове с подключением приложения ИР
	СтароеЗначениеБуфераОбмена = ТурбоКонф.ПолучитьБуферОбмена();
	АктивироватьТекущийОбъектВДеревеКонфигурации();
	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала;
	Сообщить("Активация формы в дереве - " + Длительность + "мс");
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТурбоКонф.КонтролКлавиша(Клавиши.C);
	Пока ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала < 300 Цикл
		ТурбоКонф.Ждать(50);
		Попытка
			ОписаниеФормы = ТурбоКонф.ПолучитьБуферОбмена("1C:MD8 Data");
			ОписаниеОшибки = "";
		Исключение
			ОписаниеФормы = "";
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
		Если ПолеТекстаПрограммы.ПроверитьОписаниеФормыИзБуфераОбмена(ОписаниеФормы) Тогда
			ТекстСтруктурыФормы = ТурбоКонф.ПолучитьБуферОбмена("1C:MD8 External Data");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ВернутьсяВПредыдущееМестоКонфигуратора();
	УстановитьБуферОбмена(СтароеЗначениеБуфераОбмена);
	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала;
	Сообщить("Копирование формы в буфер обмена - " + Длительность + "мс");
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Сообщить("ОшибкаПолученияСнимкаФормы=" + ОписаниеОшибки, СтатусСообщения.Важное);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекстСтруктурыФормы) Тогда
		ПоказатьВсплывающееУведомление("Сделайте форму видимой в дереве конфигурации, чтобы анализ модуля мог получить ее новую структуру", 4000);
	Иначе
		Если ВФоне Тогда
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(ТекстСтруктурыФормы);
			ПараметрыЗадания.Добавить(Истина);
			ФоновыеЗадания.Выполнить(ЭтотОбъект, "ОбновитьСтруктуруФормыВФоне", ПараметрыЗадания);
		Иначе
			ОбновитьСтруктуруФормыВФоне(ТекстСтруктурыФормы);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//.
// Параметры:
//   ТекстСтруктурыФормы - Строка - 
Процедура ОбновитьСтруктуруФормыВФоне(Знач ТекстСтруктурыФормы, Знач ВФоне = Ложь) Экспорт
	Если ВФоне Тогда
		ТурбоКонф.Ждать(1000);
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИзКэша();
	Успех = Ложь;
	Сообщить("СтруктураФормы=" + Лев(ТекстСтруктурыФормы, 1000));
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Попытка
		ПолеТекстаПрограммы.УстановитьСлужебныеДанныеФормы(ТекстСтруктурыФормы);
		Успех = Истина;
	Исключение
		ПоказатьВсплывающееУведомление("Ошибка разбора снимка формы: " + ОписаниеОшибки(), 4000);
	КонецПопытки;
	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала;
	Сообщить("Разбор снимка формы " + ?(ВФоне, "фоновый", "синхронный") + " - " + Длительность + "мс");
	Если Успех Тогда
		ПоказатьВсплывающееУведомление("Кэш активной управляемой формы обновлен. Он обновляется периодически и при вводе точки от ее нового элемента", 3000);
	КонецЕсли;
КонецПроцедуры

// Защита от ошибки Турбоконфа с пустым параметром
Процедура УстановитьБуферОбмена(Текст)
	Если ЗначениеЗаполнено(Текст) Тогда // Защита от странной ошибки - Внешнее исключение (System.ArgumentNullException): Значение не может быть неопределенным. Имя параметра: text}    
		ТурбоКонф.УстановитьБуферОбмена(Текст);
	КонецЕсли;
КонецПроцедуры

Функция КлючКэшаИмениКонфигурацииДляПоля(Знач НомерРодителяПоля = 0, Знач ИдентификаторПоляСырой = Неопределено)
	Если НомерРодителяПоля = 0 Тогда
		Если ИдентификаторПоляСырой = Неопределено Тогда
			ИдентификаторПоля = ТурбоКонф.ПолучитьRuntimeId(); // 9мс
			// ИдентификаторПоля = ИдентификаторТекущегоЭлементаОкна();
			ИдентификаторПоля = СтрСоединить(ИдентификаторПоля, "-");
		Иначе
			ИдентификаторПоля = СтрЗаменить(ИдентификаторПоляСырой, " ", "-");
		КонецЕсли;
	Иначе
		//ВызватьИсключение "Внутренняя ошибка";
		ИдентификаторПоля = ТурбоКонф.ПолучитьRuntimeIdСИерархией(НомерРодителяПоля)[1]; // 9мс
		// ИдентификаторПоля = ТурбоКонф.ПолучитьRuntimeIdСИерархиейСтроками();
		ИдентификаторПоля = СтрСоединить(ИдентификаторПоля, "-");
	КонецЕсли;
	Сообщить("ИдентификаторПоля=" + ИдентификаторПоля);
	КлючКэша = "ИмяКонфигурации." + XMLСтрока(ИдентификаторПоля);
	Возврат КлючКэша;
КонецФункции

// Не используется
// теперь эту информацию получаем от Турбокнофа
Функция _ИмяКонфигурации()
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	АктивироватьТекущийОбъектВДеревеКонфигурации();
	КлючКэшаИмениКонфигурации = КлючКэшаИмениКонфигурацииДляПоля(2);
	ИмяКонфигурации = ВосстановитьЗначениеСеансаКонфигуратора(КлючКэшаИмениКонфигурации);
	Если ПустаяСтрока(ИмяКонфигурации) Тогда
		СохранитьЗначениеСеансаКонфигуратора(КлючКэшаИмениКонфигурации, ИмяКонфигурации);
		ТурбоКонф.Клавиша(Клавиши.Home);
		ТурбоКонф.Ждать(100);
		ИмяКонфигурации = ВыделенныйТекст(Ложь);
		Если ИмяКонфигурации = "Мои шаблоны" Тогда
			// Залипла клавиша SHIFT при нажтии CTRL+T
			Возврат Неопределено;
		Иначе
			СохранитьЗначениеСеансаКонфигуратора(КлючКэшаИмениКонфигурации, ИмяКонфигурации);
		КонецЕсли;
		ВернутьсяВПредыдущееМестоКонфигуратора();
		АктивироватьТекущийОбъектВДеревеКонфигурации();
	КонецЕсли;
	Сообщить("ИмяКонфигурации = " + ИмяКонфигурации);
	ВернутьсяВПредыдущееМестоКонфигуратора();
	Возврат ИмяКонфигурации;
КонецФункции

Процедура ВернутьсяВПредыдущееМестоКонфигуратора() Экспорт
	ТурбоКонф.КонтролКлавиша(Клавиши.OemMinus);
КонецПроцедуры

Функция ЧистыйЗаголовокДочернегоОкна(ЗаголовокОкнаКонфигуратора)
	ПолноеИмяМодуля = ЗаголовокОкнаКонфигуратора;
	ПозицияТире = Найти(ПолноеИмяМодуля, " - Конфигуратор");
	ПолноеИмяМодуля = СокрЛП(Лев(ПолноеИмяМодуля, ПозицияТире));
	Возврат ПолноеИмяМодуля;
КонецФункции

Функция ВывестиКонтекстЯзыка(ПолеТекстаПрограммы)
	ИмяМетода = ПолеТекстаПрограммы.ИмяТекущегоМетода();
	Сообщить("-Язык: " + ЯзыкПрограммы + ", Модуль: " + ПолеТекстаПрограммы.мИмяМодуля + ", Метод: " + ИмяМетода  + ", Позиция: " + ПозицияВТексте + ", Выражение: " + ПолеТекстаПрограммы.мКонтекст);
	Возврат ИмяМетода;
КонецФункции

//&ТолькоТекстовыеДокументы
//&ЗапроситьИнформациюОДокументе
Процедура ПоказатьПараметрыМетода()
	Если Не ПроверитьРазрешениеИР() Тогда
		ПродолжитьОбработкуНажатияКлавиш();
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ВФоне = Истина;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИзКэша();
	Если ПолеТекстаПрограммы <> Неопределено Тогда
		ФормаВызовМетода = ПолеТекстаПрограммы.ФормаВызовМетода(Истина);
		Если ФормаВызовМетода.Открыта() Тогда
			//ТурбоКонф.АктивироватьОкно(ТурбоКонф.НайтиОкноПоЗаголовку(ФормаВызовМетода.Заголовок));
			//Возврат;
			ВФоне = Ложь;
			ФормаВызовМетода.Закрыть();
		КонецЕсли;
	КонецЕсли; 
	Если Не ЭтоДокумент() Тогда
		ВФоне = Ложь;
	КонецЕсли;
	Если ВФоне Тогда
		Если Не ПодключениеИР.ирКэш.ЛиСеансТолстогоКлиентаУПЛкс() Тогда
			ВосстановитьОкноПриложения(ПодключениеИР); // Нужно для обычного приложения, чтобы окно появлялось при повторном вызове
		КонецЕсли;
		ФоновыеЗадания.Выполнить(ЭтотОбъект, "ОткрытьПараметрыМетода",, Истина);
	Иначе
		ОткрытьПараметрыМетода();
	КонецЕсли;
КонецПроцедуры

//.
// Возвращаемое значение:
//    ОбработкаОбъект.ирКлсПолеТекстаПрограммы - 
Функция ПолеТекстаПрограммыИзКэша(Знач ИДКонфигуратора = Неопределено) Экспорт
	ПолеТекстаПрограммы = ВосстановитьЗначениеСеансаКонфигуратора("ПолеТекстаПрограммы", ИДКонфигуратора); // ОбработкаОбъект.ирКлсПолеТекстаПрограммы
	Возврат ПолеТекстаПрограммы;
КонецФункции

Процедура _ПоказатьПараметрыМетодаНемодальный()
	// Немодальный режим https://turboconf.ru/Tasks/8882
	//ФормаВызова.Автообновление = Ложь;
	//Если ФормаВызова.Открыта() Тогда
	//	ФормаВызова.Закрыть();
	//КонецЕсли;
	////Если ФормаВызова.Открыта() Тогда
	////	//ФормаВызова.ОбновитьИлиЗакрытьФорму(Ложь, Истина);
	////	//ТурбоКонф.ОтжатьМодификаторы();
	////Иначе
	//	ПодключениеИР.Visible = Истина;
	//	ФормаВызова.ЛиОткрытаИзКонфигуратора = Истина;
	//	ФормаВызова.Открыть();
	//	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	//	Скрипт = 
	//	"Title := ""Метод:""
	//	|hParent := WinExist(""A"")
	//	|SetTitleMatchMode, 1
	//	|WinGet, hChild,, %Title%
	//	|;MsgBox hChild=%hChild%
	//	//|SetOwner(hChild, hParent) ; От этого только вред
	//	|SetParent(hChild, hParent)
	//	|WinMove, ahk_id %hChild%,, " + XMLСтрока(ПозицияКаретки.X) + ", " + XMLСтрока(ПозицияКаретки.Y - 49) + "
	//	|
	//	|SetParent(hWndChild, hWndParent) {
	//	|	return DllCall(""SetParent""
	//	|		, ptr, hWndChild
	//	|		, ptr, hWndParent
	//	|		, ptr)
	//	|}
	//	|";
	//	ТД = Новый ТекстовыйДокумент;
	//	ТД.УстановитьТекст(Скрипт);
	//	ИмяФайла = ПолучитьИмяВременногоФайла("ahk");
	//	ТД.Записать(ИмяФайла, КодировкаТекста.ANSI); // Иногда возникает ошибка https://turboconf.ru/Tasks/9510
	//	ЗапуститьПриложение(ИмяФайла,, Истина); 
	//	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	//	ПодключениеИР.Visible = Ложь;
	//	УдалитьФайлы(ИмяФайла);
	//	ТурбоКонф.ОтжатьМодификаторы();
	////КонецЕсли;
КонецПроцедуры 

Функция ОбновитьПараметрыМетодаИВернутьФокус(Знач ВернутьФокусВКонфигуратор = Истина, ФормаВызовМетода = Неопределено) Экспорт
	Пока Истина Цикл
		//ПозицияКаретки = ТурбоКонф.ПолучитьПозициюКаретки();  
		ЭтоДокумент = ЭтоДокумент();
		ПодключениеИР = ПодключениеИРИзКэша();
		Если ПодключениеИР = Неопределено Тогда
			Прервать;
		КонецЕсли;
		Если ВернутьФокусВКонфигуратор Тогда
			ЭтоДокумент = Ложь; // Чтобы точно брать последний документ
		КонецЕсли;
		РазобратьПозициюВТексте();
		ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,, Истина, ЭтоДокумент, Истина);
		Если ПолеТекстаПрограммы = Неопределено Тогда
			Прервать;
		КонецЕсли;
		ФормаВызовМетода = ПолеТекстаПрограммы.ФормаВызовМетода(Истина);
		Если Не ФормаВызовМетода.Открыта() Тогда
			Прервать;
		КонецЕсли;
		ФормаВызовМетода.Автообновление = Не ВернутьФокусВКонфигуратор; 
		Если ФормаВызовМетода.Открыта() Тогда
			ФормаВызовМетода.ОбновитьИлиЗакрытьФорму(Ложь, Истина); // полезный только 2й параметр
		КонецЕсли;
		Если ВернутьФокусВКонфигуратор Тогда
			ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
			ВернутьФокусВКонфигуратор = Ложь;
		КонецЕсли;
		ТурбоКонф.Ждать(500);
	КонецЦикла;
	Возврат ПолеТекстаПрограммы;
КонецФункции

Процедура ОткрытьПараметрыМетода() Экспорт
	ПолеТекстаПрограммы = ОбновитьПараметрыМетодаИВернутьФокус(Ложь);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	ВФоновомЗадании = ЛиВФоновомЗадании();
	СброситьКонтекст = ВФоновомЗадании;
	ФормаВызова = ПолеТекстаПрограммы.ФормаВызовМетода(СброситьКонтекст);
	Сообщить("Имя вызываемого метода = " + ПолеТекстаПрограммы.мИмяМетодаВызова);
	Если ВФоновомЗадании Тогда
		ПодключениеИР.Visible = Ложь;
		//ПодключениеИР.Предупреждение("1");
		//Возврат;
		ТурбоКонф.Ждать(20); // Без этого иногда не запоминается позиция каретки и окно открывается по центру экрана
		ФормаВызова.ЗапомнитьПозициюКаретки();
		ФормаВызова.Автообновление = Истина;
		//ФормаВызова.ПараметрПоверхВсехОкон = Истина;
		ФоновыеЗадания.Выполнить(ЭтотОбъект, "ОбновитьПараметрыМетодаИВернутьФокус",, Истина);
	Иначе
		ПозицияКаретки = ТурбоКонф.ПолучитьПозициюКаретки();  
		ОповеститьПользователяОПриостановке(ПодключениеИР);
		МодулиИР = МодулиИР(ПодключениеИР);
		ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
		Окно = ТурбоКонф.ПолучитьАктивноеОкно();
		ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("^Метод.*", 3000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР, ПозицияКаретки);
	КонецЕсли;
	Попытка
		Результат = ФормаВызова.ОткрытьМодально();
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;  
	Если Не ВФоновомЗадании Тогда
		ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
	КонецЕсли;
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	Если Результат = Истина Тогда 
		ПерейтиВПозицию(,, ПолеТекстаПрограммы, Истина); 
	ИначеЕсли ЗначениеЗаполнено(Результат) Тогда
		ПерейтиПоСсылкеМД(Результат);
	КонецЕсли;
	Если ПолеТекстаПрограммы.мЗамещающийФрагмент <> Неопределено Тогда
		ПередатьИзмененияИзПоляТекстаВОкноМодуля(ПолеТекстаПрограммы);
	КонецЕсли;
КонецПроцедуры

Функция ЛиВФоновомЗадании() Экспорт
	Возврат ФоновыеЗадания.ПолучитьТекущее() <> Неопределено;
КонецФункции

//&ТолькоТекстовыеДокументы
//&ЗапроситьИнформациюОДокументе
Процедура ПереименоватьСлово()
	ПозицияКаретки = ТурбоКонф.ПолучитьПозициюКаретки();  
	ЭтоДокумент = ЭтоДокумент();
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,, Истина, ЭтоДокумент, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Результат = Неопределено;
	ОповеститьПользователяОПриостановке(ПодключениеИР);
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("^Переименовать.*", 2000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР, ПозицияКаретки);
	Попытка
		Результат = ПолеТекстаПрограммы.ПереименоватьСлово(Ложь);
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
	Если Результат = "НайтиВнешниеСсылки" Тогда 
		НайтиВМодулях();
	ИначеЕсли Результат <> Неопределено Тогда
		ПередатьИзмененияИзПоляТекстаВОкноМодуля(ПолеТекстаПрограммы,, Результат.ВесьМодульИзменен);
	КонецЕсли;
КонецПроцедуры 

//&ТолькоТекстовыеДокументы
//&ЗапроситьИнформациюОДокументе
//&ВосстанавливатьБуферОбмена
Процедура ОбъявитьТипВыражения()
	ЭтоДокумент = ЭтоДокумент();
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,,, ЭтоДокумент);
	Если Ложь
		Или ПолеТекстаПрограммы = Неопределено 
		Или ПолеТекстаПрограммы.мЯзыкПрограммы <> 0
		//Или ПолеТекстаПрограммы.мМетодМодуля = Неопределено
	Тогда
		Возврат;
	КонецЕсли;

	//ИмяПараметра = ПолеТекстаПрограммы.мКонтекст;
	//ОткрытьКонтекстноеМеню();
	//КликнутьПоЭлементу("Рефакторинг", "элемент меню");
	//Если ПустаяСтрока(ПолеТекстаПрограммы.мМетодМодуля.ТипЗначения) Тогда
	//	Добавка = "процедуры";
	//Иначе
	//	Добавка = "функции";
	//КонецЕсли;
	//ИмяЭлементаМеню = "Создать описание " + Добавка;
	//КликнутьПоЭлементу(ИмяЭлементаМеню, "элемент меню");
	//Если ТурбоКонф.НайтиЭлементПоИмени(ИмяЭлементаМеню, "элемент меню") Тогда
	//	ТурбоКонф.Клавиша(Клавиши.Escape);
	//КонецЕсли;
	//Если ТурбоКонф.НайтиЭлементПоИмени("Рефакторинг", "элемент меню") Тогда
	//	ТурбоКонф.Клавиша(Клавиши.Escape);
	//	ПоказатьВсплывающееУведомление("Команда применима только внутри метода доступного для изменении модуля");
	//	Возврат;
	//КонецЕсли;
	//РазобратьПозициюВТексте();
	//ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,,, ЭтоДокумент);
	//ПолеТекстаПрограммы.ОбъявитьТипВыражения(ИмяПараметра);
	//
	Если Не ПолеТекстаПрограммы.ОбъявитьТипВыражения() Тогда
		Возврат;
	КонецЕсли;
	Если ПолеТекстаПрограммы.мЗаменяемыйДиапазон = Неопределено Тогда
		ПередатьГраницыВыделенияИзПолеТекстаПрограммы(ПолеТекстаПрограммы);
		Возврат;
	КонецЕсли;
	ПередатьИзмененияИзПоляТекстаВОкноМодуля(ПолеТекстаПрограммы, Ложь, Ложь);
КонецПроцедуры 

Процедура ВыделитьТекущееСловоПоляДокумента() Экспорт
	ТурбоКонф.КонтролКлавиша(Клавиши.W);
КонецПроцедуры 

//&ЗапроситьИнформациюОДокументе
Процедура ЗапомнитьДляСравнения()
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Текст = ВыделенныйТекст;
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Текст = ТекстМодуля;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗапомнитьТекстДляСравнения(ПодключениеИР, ПолеТекстаПрограммы, Текст);
КонецПроцедуры

Процедура ЗапомнитьТекстДляСравнения(Знач ПодключениеИР, Знач ПолеТекстаПрограммы, Знач Текст) Экспорт
	Результат = ПолеТекстаПрограммы.ЗапомнитьДляСравнения(Ложь, Текст);
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ПоказатьВсплывающееУведомление(Результат);
	Иначе
		ВосстановитьОкноПриложения(ПодключениеИР);
	КонецЕсли;
КонецПроцедуры

Процедура АвтодополнениеМодальное()
	ПозицияКаретки = ТурбоКонф.ПолучитьПозициюКаретки();
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	// ТурбоКонф.АктивироватьОкно(Конфигуратор.ОкноВызоваСкрипта);
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,, Истина);
	ОповеститьПользователяОПриостановке(ПодключениеИР);
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("^Тип:.*", 2000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР, ПозицияКаретки);
	Попытка
		ПолеТекстаПрограммы.ОткрытьАвтодополнение(, Истина);
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
КонецПроцедуры

//&ТолькоТекстовыеДокументы
//&ЗапроситьИнформациюОДокументе
Процедура СинтаксПомощник()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		ТурбоКонф.КонтролКлавиша(Клавиши.F1);
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,,, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяНастройки = "AutoFilterSyntaxHelper"; 
	Если ТурбоКонф.ПолучитьЗначениеНастройки(ИмяНастройки) Тогда
		Если ЛиДоступнаУстановкаПользовательскихНастроек() Тогда
			ТурбоКонф.УстановитьЗначениеНастройкиПрограммы(ЭтотОбъект, ИмяНастройки, Ложь, "Нужно для автоматического выбора главы синтакс-помощника");
		Иначе
			//СписокРекомендаций.Добавить("Отключить ""Ассистирование/ Автоматически показывать фильтр выбора главы синтакс-помощника""");
		КонецЕсли; 
	КонецЕсли;
	ТаблицаТипов = ПолеТекстаПрограммы.ТаблицаТиповТекущегоВыражения(Ложь, Ложь, Истина, Ложь, Ложь); // полезный - 4й
	ИскомаяСтрока = "";
	Если ТаблицаТипов.Количество() > 0 Тогда
		ЛучшийТип = ТаблицаТипов.Получить(0);
		Если ПолеТекстаПрограммы.ЛиСистемноеСлово(ЛучшийТип) Тогда
			Если Не ЗначениеЗаполнено(ИскомаяСтрока) Тогда
				Попытка
					ТипКонтекста = ЛучшийТип.СтрокаОписания.ТипКонтекста;
					ИскомаяСтрока = ТипКонтекста;
				Исключение
				КонецПопытки;
				ПодготовитьИмяТипаДляПоискаВГлавахСинтаксПомощника(ИскомаяСтрока, ПолеТекстаПрограммы);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ИскомаяСтрока) Тогда
				Попытка
					ИскомаяСтрока = ЛучшийТип.СтрокаОписания.БазовыйТип;
				Исключение
					ИскомаяСтрока = ЛучшийТип.СтрокаОписания.Слово;
				КонецПопытки;
				Если ЗначениеЗаполнено(ИскомаяСтрока) Тогда
					ИскомаяСтрока = "/" + ПолеТекстаПрограммы.ПолноеИмяТипаИзСокращенного(ИскомаяСтрока);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ИскомаяСтрока) Тогда
			// Например ПередЗаписью
			Если Не ЗначениеЗаполнено(ПолеТекстаПрограммы.мРодительскийКонтекст) Тогда
				Попытка
					ИскомаяСтрока = ПолеТекстаПрограммы.мМодульМетаданных.СтруктураТипа.ИмяОбщегоТипа;
				Исключение
				КонецПопытки;
				ПодготовитьИмяТипаДляПоискаВГлавахСинтаксПомощника(ИскомаяСтрока, ПолеТекстаПрограммы);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ТурбоКонф.КонтролКлавиша(Клавиши.F1);
	Сообщить("ИскомаяСтрока=" + ИскомаяСтрока);
	Если ИскомаяСтрока = "" Тогда
		ПоказатьПредложениеОткрытьПсевдокодПлатформы(ПодключениеИР, ПолеТекстаПрограммы, ТипКонтекста);
		Возврат;
	КонецЕсли;
	ЖдатьСменуТекущегоЭлемента(СтарыйИД);
	ЛиОднозначныйРезультат = Ложь;
	Если ПолеТекстаПрограммы.мЯзыкПрограммы = 0 Тогда
		Если СтрНачинаетсяС(ТурбоКонф.ПолучитьЗаголовокТекущегоОкна(), "Выбор главы") Тогда
			Если НайтиСтрокуВОкне(ИскомаяСтрока) Тогда
				ЗаголовокТекущегоОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
				Если Не СтрНачинаетсяС(ЗаголовокТекущегоОкна, "Выбор главы") Тогда
					Сообщить("Не найдена глава справки. ЗаголовокТекущегоОкна = " + ЗаголовокТекущегоОкна);
					ТурбоКонф.Клавиша(Клавиши.Enter);
				Иначе
					Если НайтиГлавуСинтаксПомощникаВСпискеВыбора(ИскомаяСтрока) Тогда
						ТурбоКонф.Клавиша(Клавиши.F3);
						ТурбоКонф.Ждать(20);
						ЛиОднозначныйРезультат = Не НайтиГлавуСинтаксПомощникаВСпискеВыбора(ИскомаяСтрока);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// Уже открыта нужная страница синтакс-помощника или это мета слово
			ПоказатьПредложениеОткрытьПсевдокодПлатформы(ПодключениеИР, ПолеТекстаПрограммы, ТипКонтекста);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если ЛиОднозначныйРезультат Тогда
		ТурбоКонф.Клавиша(Клавиши.Enter);
	Иначе
		ТурбоКонф.Клавиша(Клавиши.Escape);
		ВосстановитьОкноПриложения(ПодключениеИР);
		ПолеТекстаПрограммы.ОткрытьКонтекстнуюСправку(ВыделенныйТекст);
	КонецЕсли; 
	ПоказатьПредложениеОткрытьПсевдокодПлатформы(ПодключениеИР, ПолеТекстаПрограммы, ТипКонтекста);
	
	//ТурбоКонф.КонтролШифтКлавиша(Клавиши.F1);
	//
	//// Активируем вкладку "Индекс"
	//СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	////Если ТурбоКонф.НайтиЭлементПоИмени("Содержание", "вкладка") Тогда
	////	ТурбоКонф.КонтролКлавиша(Клавиши.PageDown);
	////	ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 1000, Истина);
	////ИначеЕсли ТурбоКонф.НайтиЭлементПоИмени("Поиск", "вкладка") Тогда
	////	ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
	////	ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 1000, Истина);
	////КонецЕсли;
	//КликнутьПоЭлементу("Индекс", "элемент вкладки");
	//ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 1000, Истина);

	//ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	//ТурбоКонф.ОтправитьТекст(ПолноеИмяСлова);
	//ТурбоКонф.Клавиша(Клавиши.Enter);
	//ТурбоКонф.Клавиша(Клавиши.Enter);
КонецПроцедуры   

Процедура ПоказатьПредложениеОткрытьПсевдокодПлатформы(Знач ПодключениеИР, Знач ПолеТекстаПрограммы, Знач ТипКонтекста) Экспорт
	//Если ПолеТекстаПрограммы.мИмяМодуля = ПолеТекстаПрограммы.мПлатформа.ИмяМодуляПсевдокодаПлатформы() Тогда
	//	Возврат;
	//КонецЕсли; 
	МодулиИР = МодулиИР(ПодключениеИР);
	ТекущееСлово = ПоследнийФрагментЛкс(МодулиИР.ирОбщий.ПервыйФрагментЛкс(ПолеТекстаПрограммы.мКонтекст, "("));
	СсылкаВызова = ПолеТекстаПрограммы.СсылкаВызоваСобытияИзПсевдокодаПлатформы(ТекущееСлово, ТипКонтекста);
	Если ЗначениеЗаполнено(СсылкаВызова) Тогда
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("Ссылка", СсылкаВызова);
		ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Показать использование в псевдокоде платформы",, ЭтотОбъект, "ОткрытьВызовыСобытияИзПсевдокодаПлатформы", ПараметрыОбработчика);
	КонецЕсли;
КонецПроцедуры   

Процедура ОткрытьВызовыСобытияИзПсевдокодаПлатформы(Параметры)
	// Не нашел способа универсально закрыть активное модальное окно из клика уведомления
	ОкноВыбораГлавы = ТурбоКонф.НайтиОкноПоЗаголовку("Выбор главы");
	Если ОкноВыбораГлавы Тогда
		ТурбоКонф.АктивироватьОкно(ОкноВыбораГлавы);
		ЗакрытьМодальноеОкно();
	КонецЕсли;
	
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ОкноВызоваСкрипта);
	ПерейтиПоСсылкеМД(Параметры.Ссылка); 
КонецПроцедуры

Функция ПодготовитьИмяТипаДляПоискаВГлавахСинтаксПомощника(ИскомаяСтрока, Знач ПолеТекстаПрограммы) Экспорт
	Если ЗначениеЗаполнено(ИскомаяСтрока) Тогда
		ИскомаяСтрока = ПолеТекстаПрограммы.ПолноеИмяТипаИзСокращенного(ИскомаяСтрока);
		Если ИскомаяСтрока <> "Глобальный контекст" Тогда
			ИскомаяСтрока = СтрЗаменить(ИскомаяСтрока, "формы клиентского приложения для ", "");
			ИскомаяСтрока = "/" + ИскомаяСтрока;
		КонецЕсли;
		ИскомаяСтрока = ИскомаяСтрока + "/";
	КонецЕсли;
	Возврат ИскомаяСтрока;
КонецФункции

//&ТолькоТекстовыеДокументы
//&ЗапроситьИнформациюОДокументе
Процедура СинтаксПомощникИР()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,,, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВосстановитьОкноПриложения(ПодключениеИР);
	ПолеТекстаПрограммы.ОткрытьКонтекстнуюСправку();
КонецПроцедуры

Функция НайтиГлавуСинтаксПомощникаВСпискеВыбора(Знач ИскомаяСтрока) Экспорт
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Пока Истина
		И Не СтрЗаканчиваетсяНа(ИскомаяСтрока, "/") 
		И Не СтрЗаканчиваетсяНа(ТурбоКонф.ПолучитьИмяЭлемента(), ИскомаяСтрока)
		И СтрНачинаетсяС(ТурбоКонф.ПолучитьЗаголовокТекущегоОкна(), "Выбор главы")
		И ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала < 1000
	Цикл
		ТурбоКонф.Клавиша(Клавиши.F3);
	КонецЦикла;
	Результат = Истина;
	Если Не СтрНачинаетсяС(ТурбоКонф.ПолучитьЗаголовокТекущегоОкна(), "Выбор главы") Тогда
		ТурбоКонф.Клавиша(Клавиши.Enter);
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
КонецФункции

//&ЗапроситьИнформациюОДокументе
Процедура НайтиВМодулях(Знач ЧтоИскать = Неопределено)
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РежимСсылки = Ложь;
	ОкноПоискаОткрыто = Ложь;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь, Ложь);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Если ПустаяСтрока(ЧтоИскать) Тогда
			ЧтоИскать = СсылкаНаОбъектМДВДеревеКонфигурации(ПодключениеИР);
			РежимСсылки = ЗначениеЗаполнено(ЧтоИскать);
		КонецЕсли;
		ПолеТекстаПрограммы = ПолеТекстаПрограммыБезКонтекста(ПодключениеИР);
		Если ПустаяСтрока(ЧтоИскать) Тогда
			ЧтоИскать = ВыделенныйТекст();
		КонецЕсли;
	КонецЕсли;
	ВосстановитьОкноПриложения(ПодключениеИР); // Надо делать до открытия формы ИР, т.к. она может эмулировать ввод в режиме управляемого приложения
	Если РежимСсылки Тогда
		Если Не ПолеТекстаПрограммы.ОткрытьПоискВызововСлова(ЧтоИскать, Истина, Ложь) Тогда 
			Возврат;
		КонецЕсли;
	Иначе
		Если Не ПолеТекстаПрограммы.ОткрытьПоискВМодулях(ЧтоИскать, Ложь) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter); // Так пользователь сможет прерывать
	ЗапуститьКонтрольДлительныхОперацийИР();
КонецПроцедуры

//.
// Параметры:
//   ПодключениеИР - Application {V83.Application}, Неопределено - 
// Возвращаемое значение:
//    - 
Функция ПолеТекстаПрограммыБезКонтекста(ПодключениеИР) Экспорт
	Результат = ПолеТекстаПрограммыИР(ПодключениеИР,,,, Ложь, Ложь, Ложь);
	Возврат Результат;
КонецФункции

//&ТолькоТекстовыеДокументы
//&ЗапроситьИнформациюОДокументе
Процедура ДеревоВызововМетода()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РежимСсылки = Ложь;
	ОкноПоискаОткрыто = Ложь;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь, Ложь, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		ПоказатьВсплывающееУведомление("Команда доступна только в модуле");
		Возврат;
	КонецЕсли;
	ВосстановитьОкноПриложения(ПодключениеИР); // Надо делать до открытия формы ИР, т.к. она может эмулировать ввод в режиме управляемого приложения
	Если Не ПолеТекстаПрограммы.ОткрытьДеревоВызовов(Неопределено, Ложь) Тогда 
		Возврат;
	КонецЕсли;
	//ТурбоКонф.КонтролКлавиша(Клавиши.Enter); // Так пользователь сможет прерывать
КонецПроцедуры 

Процедура АнализЗамера() 
	Если Не ТурбоКонф.НайтиЭлементПоИмени("Для вызова процедур и функций включать время выполнения", "флажок") Тогда
		ПоказатьВсплывающееУведомление("Команда доступна только в окне замера производительности");
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;      
	ИмяФайла = СохранитьСодержимоеОкнаВоВременныйФайл("pff");
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ВосстановитьОкноПриложения(ПодключениеИР);
	ТурбоКонф.Ждать(100);
	МодулиИР.ирКлиент.ОткрытьЗамерПроизводительностиЛкс(ИмяФайла);
КонецПроцедуры

Функция СохранитьСодержимоеОкнаВоВременныйФайл(Знач Расширение = "mxl", Знач РазмерСерииДоступности = 1) Экспорт
	ТурбоКонф.ОткрытьМеню("Файл", "Сохранить копию...");
	ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	Если Не УстановитьИмяФайлаВДиалогеВыбораФайла(ИмяФайла, "Сохран", РазмерСерииДоступности) Тогда
		ИмяФайла = "";
	КонецЕсли;
	Возврат ИмяФайла;
КонецФункции

Функция ЗагрузитьСодержимоеОкнаИзФайла(Знач ИмяФайла) Экспорт
	Если Не КликнутьПоЭлементу("Открыть...", "кнопка") Тогда
		ТурбоКонф.ОткрытьМеню("Файл", "Открыть...");
	КонецЕсли;
	Возврат УстановитьИмяФайлаВДиалогеВыбораФайла(ИмяФайла, "Открыт");
КонецФункции

//.
// Параметры:
//    ИмяФайла - Строка - 
// Возвращаемое значение:
//  Булево - Истина, если дождались окна и отправили в него выбранное имя файла
Функция УстановитьИмяФайлаВДиалогеВыбораФайла(Знач ИмяФайла, Знач ЗаголовокОкна, Знач РазмерСерииДоступности = 1) Экспорт
	ОкноСохранения = ТурбоКонф.ЖдатьОкно(ЗаголовокОкна, 2000, Истина, Истина);
	//Если Не ЖдатьПотерюАктивностиОкна() Тогда 
	//	Сообщить("Не дождались появления диалога выбора файла");
	//	Возврат Ложь;
	//КонецЕсли;
	УстановитьЗначениеПолюВвода(ИмяФайла);
	Возврат ЖдатьДоступностиФайла(ИмяФайла,, РазмерСерииДоступности);
КонецФункции 

// .
//
// Параметры:
//  ИмяФайла	 - Строка - 
//  ЧислоСекунд		- Число - 
// 
// Возвращаемое значение:
//  Булево - Истина, если файл стал доступен
//
Функция ЖдатьДоступностиФайла(Знач ИмяФайла, Знач ЧислоСекунд = 2, Знач РазмерСерииДоступности = 1) Экспорт
	МоментНачала = ТекущаяДата();
	Файл = Новый Файл(ИмяФайла);
	Пока ТекущаяДата() <= МоментНачала + ЧислоСекунд Цикл 
		Попытка
			Пустышка = Файл.ПолучитьВремяИзменения();
			ФайлДоступен = Истина;
		Исключение
			ФайлДоступен = Ложь;
		КонецПопытки;
		Если ФайлДоступен Тогда
			РазмерСерииДоступности = РазмерСерииДоступности - 1;
			Если РазмерСерииДоступности = 0 Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
		ТурбоКонф.Ждать(100);
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Процедура ПодпискиНаСобытия()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	АктивироватьТекущийОбъектВДеревеКонфигурации();
	МодулиИР = МодулиИР(ПодключениеИР);
	СсылкаНаОбъектМД = СсылкаНаОбъектМДВДеревеКонфигурации(ПодключениеИР, Истина);
	ВосстановитьОкноПриложения(ПодключениеИР);
	Если СтрНачинаетсяС(СсылкаНаОбъектМД, "ПодпискаНаСобытие") Тогда
		Событие = ПодключениеИР.String(ПодключениеИР.Метаданные.ПодпискиНаСобытия.Найти(СтрРазделить(СсылкаНаОбъектМД, ".")[1]).Событие); // Опасный тип https://www.hostedredmine.com/issues/959928
	Иначе
		ОбъектМД = СсылкаНаОбъектМД;
	КонецЕсли;
	МодулиИР.ирКлиент.ОткрытьПодпискиНаСобытияЛкс(ОбъектМД, Событие);
КонецПроцедуры 

Процедура ОткрытьОбъектМетаданных()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	АктивироватьТекущийОбъектВДеревеКонфигурации();
	МодулиИР = МодулиИР(ПодключениеИР);
	СсылкаНаОбъектМД = СсылкаНаОбъектМДВДеревеКонфигурации(ПодключениеИР);
	ВосстановитьОкноПриложения(ПодключениеИР);
	МодулиИР.ирКлиент.ОткрытьОбъектМетаданныхЛкс(СсылкаНаОбъектМД);
КонецПроцедуры

//&ТолькоТекстовыеДокументы
//&ЗапроситьИнформациюОДокументе
Процедура ПроверитьМодуль()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь, Ложь);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВосстановитьОкноПриложения(ПодключениеИР);
	ПолеТекстаПрограммы.ОткрытьПроверкуМодуля();
	ТурбоКонф.Ждать(200); // Для того чтобы сообщения первого запуска сразу выводились, иначе они будут видно только после выполнения
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter); // Так пользователь сможет прерывать
	ЗапуститьКонтрольДлительныхОперацийИР();
КонецПроцедуры

Процедура ЗапуститьКонтрольДлительныхОперацийИР()
	ИмяМетода = "ЖдатьЗавершенияДлительнойОперацииПриложенияИР";
	// Бесполезная проверка, т.к. предыдущие запуски в другом процессе сидят и тут мы их не увидим
	//ВыбранныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода, Состояние", ИмяМетода, СостояниеФоновогоЗадания.Активно));
	//Если ВыбранныеЗадания.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;
	ФоновыеЗадания.Выполнить(ЭтотОбъект, ИмяМетода);
КонецПроцедуры

Процедура ЖдатьЗавершенияДлительнойОперацииПриложенияИР(ИДПроцесса) Экспорт
	ПодключениеИР = ВосстановитьЗначениеСеансаКонфигуратора("ПодключениеИР");
	Пока Истина Цикл
		СохранитьЗначениеСеансаКонфигуратора("БлокировкаПриложенияИР", Истина, Ложь);
		Попытка
			Если Не ПодключениеИР.Visible Тогда // Тут встаем в ожидание
				ПодключениеИР = Неопределено;
			КонецЕсли;
		Исключение
			Если ПодключениеИР <> Неопределено Тогда
				ТурбоКонф.ПоказатьВсплывающееУведомление("Ошибка проверки блокировки приложения ИР: " + НазваниеСкрипта(), ОписаниеОшибки());
			КонецЕсли;
			ПодключениеИР = Неопределено;
		КонецПопытки;
		СохранитьЗначениеСеансаКонфигуратора("БлокировкаПриложенияИР", Ложь, Ложь);
		Если ПодключениеИР = Неопределено Тогда
			Сообщить("Приложение ИР скрыто после длительной операции");
			Возврат;
		КонецЕсли;
		ТурбоКонф.Ждать(2000);
	КонецЦикла;
КонецПроцедуры

// Не используется
Процедура ЗапуститьПроверкуМодулей()
	// https://github.com/EvilBeaver/OneScript/blob/723c08d85bd991ec2eabf8277572e368867faf01/src/OneScript.StandardLibrary/Tasks/BackgroundTasksManager.cs#L156
	ИмяМетода = "ПроверитьИзмененныеМодули";
	// Бесполезная проверка, т.к. предыдущие запуски в другом процессе сидят и тут мы их не увидим
	//ВыбранныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода, Состояние", ИмяМетода, СостояниеФоновогоЗадания.Активно));
	//Если ВыбранныеЗадания.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;
	ФоновыеЗадания.Выполнить(ЭтотОбъект, ИмяМетода);
КонецПроцедуры

Процедура ПроверитьИзмененныеМодули()
	ДатаПоследнейПроверки = ВосстановитьЗначениеБазы("ДатаПоследнейПроверки");
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = МодулиИР.ирКэш.ПолеТекстаПрограммы(0);
	//ПолеТекстаПрограммы.ПроверитьМодули(ДатаПоследнейПроверки);
	Если ПолеТекстаПрограммы.ОшибкиМодуля.Количество() > 0 Тогда
		ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеПриложения(), СтрШаблон("В измененных модулях выявлено %1 возможных ошибок", ),, ЭтотОбъект, "ПоказатьНайденныеОшибки");
	КонецЕсли;
КонецПроцедуры

Процедура ПоказатьНайденныеОшибки() Экспорт
	ВосстановитьОкноПриложения(ПодключениеИРИзКэша());
КонецПроцедуры

Процедура СписокОбщихМетодов()
	Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Процедуры и функции" Тогда
		ЗакрытьМодальноеОкно();
	КонецЕсли;
	ОткрытьСписокМетодов();
	ЗапуститьКонтрольДлительныхОперацийИР();
КонецПроцедуры

//&ТолькоТекстовыеДокументы
Процедура СписокМетодовМодуля()
	Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Процедуры и функции" Тогда
		ЗакрытьМодальноеОкно();
	КонецЕсли;
	ОткрытьСписокМетодов(Истина);
КонецПроцедуры

Процедура ОткрытьСписокМетодов(ТолькоЭтогоМодуля = Ложь)
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь, Ложь, Ложь);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВосстановитьОкноПриложения(ПодключениеИР);
	ПолеТекстаПрограммы.ОткрытьСписокМетодов(ВыделенныйТекст, ТолькоЭтогоМодуля);
КонецПроцедуры

Процедура РедактироватьКомпоновку()
	ЗаголовокКнопки = "Сохранить схему в файл";
	Если Не ТурбоКонф.НайтиЭлементПоИмени(ЗаголовокКнопки, "кнопка") Тогда
		ПоказатьВсплывающееУведомление("Команда доступна только в окне конструктора схемы компоновки");
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	Для Счетчик = 1 По 7 Цикл
		Если ТурбоКонф.НайтиЭлементПоИмени(ЗаголовокКнопки, "кнопка") Тогда
			Прервать;
		КонецЕсли;
		ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
	КонецЦикла;
	Если Не КликнутьПоЭлементу(ЗаголовокКнопки, "кнопка") Тогда
		Возврат;
	КонецЕсли;
	Если Не УстановитьИмяФайлаВДиалогеВыбораФайла(ИмяФайла, "Сохран") Тогда 
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ВосстановитьОкноПриложения(ПодключениеИР);
	ТурбоКонф.Ждать(200);
	МодулиИР.ирКлиент.РедактироватьСхемуКомпоновкиИзФайлаЛкс(ИмяФайла);
	ПоказатьВсплывающееУведомление("Измененную схему нужно будет вручную загрузить в конфигуратор!", 4000);
	УдалитьФайлы(ИмяФайла);
КонецПроцедуры

//&ВосстанавливатьБуферОбмена
Процедура РедактироватьТаблицу()
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаголовокДокумента = ТурбоКонф.ПолучитьЗаголовокКонфигуратора(Конфигуратор.ГлавноеОкно);
	СтарыйЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	ТурбоКонф.КонтролКлавиша(Клавиши.G); // Раньше была проверка через контекстное меню, но она работала нестабильно (похоже что то залипало в Турбоконфе)
	ТурбоКонф.Ждать(50);
	НовыйЗаголовок = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	Если НовыйЗаголовок <> "Перейти к ячейке" Тогда
		Если НовыйЗаголовок <> СтарыйЗаголовокОкна Тогда
			ЗакрытьМодальноеОкно();
		КонецЕсли;
		ПоказатьВсплывающееУведомление("Для редактирования таблицы необходимо вызывать команду в табличном документе");
		Возврат;
	КонецЕсли;
	ЗакрытьМодальноеОкно();
	ИмяВременногоФайла = СохранитьСодержимоеОкнаВоВременныйФайл(, 2);
	Если ПустаяСтрока(ИмяВременногоФайла) Тогда
		Возврат;
	КонецЕсли;
	ТурбоКонф.Ждать(100);
	МодулиИР = МодулиИР(ПодключениеИР);
	ЗаголовокДокумента = СокрЛП(МодулиИР.ирОбщий.ПервыйФрагментЛкс(ЗаголовокДокумента, " - Конфигуратор -"));
	
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	ОповеститьПользователяОПриостановке(ПодключениеИР); 
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("^Табл.*", 5000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
	Попытка
		Результат = МодулиИР.ирКлиент.РедактироватьТабличныйДокументИзФайлаЛкс(ИмяВременногоФайла, ЗаголовокДокумента);
	Исключение
		Результат = Ложь;
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
	
	Если Результат Тогда
		Попытка
			ТурбоКонф.Ждать(50);
			ЗагрузитьСодержимоеОкнаИзФайла(ИмяВременногоФайла);
			// непонятно как определить, что файл уже загрузился
			ТурбоКонф.Ждать(100);
			КомандаВыделитьВсе();
			ТурбоКонф.Копировать();
			ЗакрытьДочернееОкноКонфигуратора();
			КомандаВыделитьВсе();
			ТурбоКонф.ВставитьТекстИзБуфера(); 
		Исключение
			ПоказатьВсплывающееУведомление("Файл таблицы сохранен:
			|" + ИмяВременногоФайла, 10000);
			ВызватьИсключение;
		КонецПопытки;
		ТурбоКонф.АльтКлавиша(Клавиши.Enter);  
		
		// Переключаем палитру свойств в режим "Табличный документ"
		ТурбоКонф.КонтролАльтКлавиша(Клавиши.I);
		ТурбоКонф.Клавиша(Клавиши.Tab);
		ТурбоКонф.КонтролКлавиша(Клавиши.Down);
		ТурбоКонф.Клавиша(Клавиши.Up);
		ТурбоКонф.Клавиша(Клавиши.Enter);
		
		АктивироватьСвойствоВПалитреСвойств("СохранятьСвойстваОтображения", 1);
		Если Не ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
			ТурбоКонф.Клавиша(Клавиши.Space);
			ТурбоКонф.КонтролКлавиша(Клавиши.G);  
			ТурбоКонф.ЖдатьОкно("Перейти к ячейке", 1000, Истина);
			ТурбоКонф.Клавиша(Клавиши.D2);
			ЗакрытьМодальноеОкно(, Клавиши.Enter);
			Если Не КликнутьПоЭлементу("Зафиксировать таблицу", "кнопка") Тогда
				ТурбоКонф.ОткрытьМеню("Таблица", "Вид", "Зафиксировать таблицу");
			КонецЕсли;
		КонецЕсли;
		// Переключаем палитру свойств в режим "Ячейки"
		ТурбоКонф.КонтролАльтКлавиша(Клавиши.I);
		ТурбоКонф.Клавиша(Клавиши.Tab);
		ТурбоКонф.КонтролКлавиша(Клавиши.Down);
		ТурбоКонф.Клавиша(Клавиши.Down);
		ТурбоКонф.Клавиша(Клавиши.Enter); 
		
		ТурбоКонф.Клавиша(Клавиши.Escape);
		ТурбоКонф.Клавиша(Клавиши.Right); // Снимаем выделение
		ТурбоКонф.Клавиша(Клавиши.Left);
	КонецЕсли;
	УдалитьФайлы(ИмяВременногоФайла); 
КонецПроцедуры

Процедура КомандаВыделитьВсе() Экспорт
	ТурбоКонф.КонтролКлавиша(Клавиши.A);
КонецПроцедуры

Функция ВосстановитьЗначениеСеансаКонфигуратора(Ключ, ИДКонфигуратора = Неопределено)
	Если Не ЗначениеЗаполнено(ИДКонфигуратора) Тогда
		ИДКонфигуратора = Конфигуратор.PID;
	КонецЕсли;
	СеансБазы = "" + ИДКонфигуратора; 
	Значение = ТурбоКонф.ВосстановитьЗначениеСеанса(СеансБазы + Ключ);
	//Сообщить("ВосстановитьЗначениеСеансаКонфигуратора. СеансБазы=" + СеансБазы + ";" + Ключ + "=" + Значение);
	Возврат Значение;
КонецФункции

Процедура СохранитьЗначениеСеансаКонфигуратора(Ключ, Значение, Знач ПисатьВЛог = Истина)
	Если Не ЗначениеЗаполнено(Конфигуратор) Тогда
		Возврат;
	КонецЕсли;
	ИДКонфигуратора = Конфигуратор.PID;
	ПодлюченныеКонфигураторы = ТурбоКонф.ВосстановитьЗначениеСеанса("ИР.ПодлюченныеКонфигураторы");
	Если ПодлюченныеКонфигураторы = Неопределено Тогда
		ПодлюченныеКонфигураторы = Новый Соответствие();
	КонецЕсли;
	Если ПодлюченныеКонфигураторы[ИДКонфигуратора] = Неопределено Тогда
		ПодлюченныеКонфигураторы[ИДКонфигуратора] = 1;
		ТурбоКонф.СохранитьЗначениеСеанса("ИР.ПодлюченныеКонфигураторы", ПодлюченныеКонфигураторы);
	КонецЕсли;
	СеансБазы = "" + ИДКонфигуратора;
	ТурбоКонф.СохранитьЗначениеСеанса(СеансБазы + Ключ, Значение);
	Если ПисатьВЛог Тогда
		Сообщить("СохранитьЗначениеСеансаКонфигуратора. СеансБазы=" + СеансБазы + ";" + Ключ + "=" + Значение);
	КонецЕсли;
КонецПроцедуры

Функция ПодлюченныеКонфигураторы()
	ПодлюченныеКонфигураторы = ТурбоКонф.ВосстановитьЗначениеСеанса("ИР.ПодлюченныеКонфигураторы");
	Если ПодлюченныеКонфигураторы = Неопределено Тогда
		ПодлюченныеКонфигураторы = Новый Соответствие();
	КонецЕсли;	
	Возврат ПодлюченныеКонфигураторы;
КонецФункции

// Возвращает либо здоровое подключение, либо Неопределено
Функция ПодключениеИРИзКэша(Знач ИДКонфигуратора = Неопределено, ИДПриложения = Неопределено)
	Если ЛиПриложениеИРЗаблокировано(ИДКонфигуратора) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПодключениеИР = ВосстановитьЗначениеСеансаКонфигуратора("ПодключениеИР", ИДКонфигуратора); // Application {V83.Application}
	Если ПодключениеИР <> Неопределено Тогда
		ИДПриложения = ВосстановитьЗначениеСеансаКонфигуратора("ПодключениеИР.ИД", ИДКонфигуратора);
		Попытка
			Пустышка = ПодключениеИР.Visible;
		Исключение
			ПроцессОС = ПолучитьПроцессОСЛкс(ИДПриложения);
			Если ПроцессОС <> Неопределено Тогда
				УбитьПроцесс(ПроцессОС, "из-за порчи");
			КонецЕсли;
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
			ПодключениеИР = Неопределено;
		КонецПопытки;
	КонецЕсли;
	Возврат ПодключениеИР;
КонецФункции 

// Если ИДКонфигуратора пустой, то после закрытия конфигуратора возвращает Истина.
// Возвращаемое значение:
//  Булево  - 
Функция ЛиПриложениеИРЗаблокировано(Знач ИДКонфигуратора = Неопределено)
	Если Не ЗначениеЗаполнено(ИДКонфигуратора) И Не ЗначениеЗаполнено(Конфигуратор) Тогда
		Возврат Истина;
	КонецЕсли;
	Если ВосстановитьЗначениеСеансаКонфигуратора("БлокировкаПриложенияИР", ИДКонфигуратора) = Истина Тогда
		Указатель = ПоказатьВсплывающееУведомление("Команды адаптера отключены до завершения длительной операция в приложении ИР", 2000);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

// Функция - Строка соединения базы ИР с пользователем и паролем
//
// Параметры:
//  ПарольИлиСтрокаСоединения	 - 	 - 
//  СтрокаСоединенияБезПароля		 - 	 - выходной
// 
// Возвращаемое значение:
//   - 
//
Функция СтрокаСоединенияБазыИР(Знач ПарольИлиСтрокаСоединения = Неопределено, СтрокаСоединенияБезПароля = "")
	Если ПарольИлиСтрокаСоединения = Неопределено Тогда
		ПарольИлиСтрокаСоединения = ВосстановитьЗначениеБазы("ПарольИлиСтрокаСоединения", Истина);
	КонецЕсли;
	Если ЛиСтрокаСоединения(ПарольИлиСтрокаСоединения) Тогда
		СтрокаСоединения = ПарольИлиСтрокаСоединения;
		СтрокаСоединенияБезПароля = СтрокаСоединенияБезПароля(СтрокаСоединения);
	Иначе
		СтрокаСоединенияБезПароля = СтрокаСоединенияБазыКонфигуратора();
		СтрокаСоединения = СтрокаСоединенияБезПароля + СтрШаблон("Pwd=""%1"";", ПарольИлиСтрокаСоединения);
	КонецЕсли;
	//МаркерПользователя = ";usr=";
	//Если Не ЛиКраткаяСПользователем И Найти(НРег(СтрокаСоединенияБезПароля), МаркерПользователя) > 0 Тогда
	//	СтрокаСоединенияБезПароля = Лев(СтрокаСоединенияБезПароля, СтрНайти(НРег(СтрокаСоединенияБезПароля), МаркерПользователя) - 1);
	//КонецЕсли;
	Сообщить("Строка соединения базы " + НазваниеПриложения() + " без пароля = " + СтрокаСоединенияБезПароля);
	Возврат СтрокаСоединения;
КонецФункции

Функция СтрокаСоединенияБезПароля(Знач СтрокаСоединения) Экспорт
	СтрокаСоединенияБезПароля = СтрокаСоединения;
	МаркерПароля = "pwd=";
	ПозицияПароля = Найти(НРег(СтрокаСоединенияБезПароля), МаркерПароля);
	Если ПозицияПароля > 0 Тогда
		СтрокаСоединенияБезПароля = Лев(СтрокаСоединенияБезПароля, ПозицияПароля - 1);
	КонецЕсли;
	Возврат СтрокаСоединенияБезПароля;
КонецФункции

//.
// Параметры:
//    ПарольИлиСтрокаСоединения - Строка - 
// Возвращаемое значение:
//    Булево - 
Функция ЛиСтрокаСоединения(Знач ПарольИлиСтрокаСоединения) Экспорт
	Результат = Истина
		И Найти(ПарольИлиСтрокаСоединения, "=") > 0 
		И Найти(ПарольИлиСтрокаСоединения, ";") > 0
		И (Ложь
			Или Найти(НРег(ПарольИлиСтрокаСоединения), "file") > 0
			Или Найти(НРег(ПарольИлиСтрокаСоединения), "srvr") > 0);
	Возврат Результат;
КонецФункции

Функция СтрокаСоединенияБазыКонфигуратора(Знач СПользователем = Истина)
	ИнфоПроцесса = ИнфоПроцесса();
	Если ИнфоПроцесса.Режим = "Серверный" Тогда
		СтрокаСоединения = СтрШаблон("Srvr=""%1"";Ref=""%2"";", ИнфоПроцесса.Сервер, ИнфоПроцесса.БазаДанных);
	Иначе
		СтрокаСоединения = СтрШаблон("File=""%1"";", ИнфоПроцесса.Каталог);  
	КонецЕсли;
	Если СПользователем И ЗначениеЗаполнено(ИнфоПроцесса.Пользователь) Тогда
		СтрокаСоединения = СтрокаСоединения + СтрШаблон("Usr=""%1"";", ИнфоПроцесса.Пользователь);
	КонецЕсли;
	//Сообщить("Строка соединения базы конфигуратора = " + СтрокаСоединения);
	Возврат СтрокаСоединения;
КонецФункции

Функция ИнфоПроцесса()
	Возврат Конфигуратор.ПараметрыИнформационнойБазы;
КонецФункции

Функция ПодключениеИРНовое() Экспорт
	ПодключениеИР(,,,, Истина);
КонецФункции

Функция ПодключениеИР(Знач ПарольИлиСтрокаСоединения = Неопределено, Знач РазобратьПозициюВТексте = Истина, Знач ВидимостьДляНовогоПодключения = Ложь, выхПодключеноНоНетПодсистемы = Ложь,
	Знач ЗапретитьФоновыйРежим = Ложь) Экспорт
	
	Если ЛиПриложениеИРЗаблокировано() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если РазобратьПозициюВТексте Тогда
		РазобратьПозициюВТексте();
	КонецЕсли;
	Если ПарольИлиСтрокаСоединения = Неопределено И Не ПроверитьРазрешениеИР() Тогда
		ПродолжитьОбработкуНажатияКлавиш();
		Возврат Неопределено; 
	КонецЕсли;
	Если Не ЗапретитьФоновыйРежим Тогда
		ПодключениеИР = ПодключениеИРИзКэша();
		Если ПодключениеИР <> Неопределено Тогда
			Возврат ПодключениеИР;
		КонецЕсли;
		// TODO переделать на ЗапуститьМоноФоновоеЗадание
		ДатаЗапускаПодключенияИР = ВосстановитьЗначениеСеансаКонфигуратора("ДатаЗапускаПодключенияИР");
		Если Истина
			И ЗначениеЗаполнено(ДатаЗапускаПодключенияИР) 
			И ТекущаяДата() - ДатаЗапускаПодключенияИР < 60
		Тогда
			Возврат Неопределено;
		КонецЕсли;
		ЗапуститьПодключениеИР();
		Возврат Неопределено;
	КонецЕсли;
	ТекущаяВерсияТурбоКонф = ТурбоКонф.ПолучитьВерсиюТурбоКонф();
	Если ТекущаяВерсияТурбоКонф < МинимальнаяВерсияТурбоКонф Тогда
		Сообщить("Несовместимая версия ТурбоКонф", СтатусСообщения.Внимание);
		ТекстСообщения = СтрШаблон("Обнаружена несовместимая версия TurboConf. Необходима версия %1 и выше", МинимальнаяВерсияТурбоКонф);
		ПоказатьВсплывающееУведомление(ТекстСообщения, 5000); // Может заблокироваться модальным окном и будет мешаться
	КонецЕсли;
	ТурбоКонф.СохранитьЗначениеСеанса("СтрокаЗапускаОбновлениеКэшаМодулей", Неопределено);
	СтрокаСоединенияБезПароля = "";
	СтрокаСоединения = СтрокаСоединенияБазыИР(ПарольИлиСтрокаСоединения, СтрокаСоединенияБезПароля);
	УведомлениеЗапуска = ПоказатьВсплывающееУведомление("Подключается приложение " + НазваниеПриложения() + ". Закрыть его можно командой ЗакрытьПриложениеИР.", 60000);
	ЛиДоступноУправлениеМодальнымОкнами = ТурбоКонф.ПолучитьВерсиюТурбоКонф() > "6.2.";
	СохранитьЗначениеСеансаКонфигуратора("ДатаЗапускаПодключенияИР", ТекущаяДата());
	//ТурбоКонф.Ждать(10000);
	Попытка
		Для НомерПопытки = 1 По 2 Цикл
			Попытка
				МоментСтартаПроцесса = ТекущаяДата();
				ПодключениеИР = Новый COMОбъект("V83.Application");
				ПроцессОС = ПолучитьПроцессОСЛкс(, МоментСтартаПроцесса,, "-Embedding");
				Если ПроцессОС = Неопределено Тогда
					ПоказатьВсплывающееУведомление("Не удалось найти идентификатор процесса COM объекта. Сообщите разработчику.");
				Иначе
					ИдентификаторПроцессаИР = ПроцессОС.ProcessID;
				КонецЕсли;
				Если ЛиДоступноУправлениеМодальнымОкнами Тогда
					// Для отлова модального окна ошибки обработчиков начала работы системы https://turboconf.ru/Tasks/9443
					ИДЗадачи = "" + ТекущаяДата();
					ТурбоКонф.НачатьУправлениеМодальнымиОкнами(5000, , ИдентификаторПроцессаИР,, ИДЗадачи); 
				КонецЕсли;
				УспехПодключения = ПодключениеИР.Connect(СтрокаСоединения);
				Если ЛиДоступноУправлениеМодальнымОкнами Тогда
					ТурбоКонф.ЗавершитьУправлениеМодальнымиОкнами(ИДЗадачи);
				КонецЕсли;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				УспехПодключения = Ложь;
			КонецПопытки;
			Если УспехПодключения Тогда
				Прервать;
			Иначе
				ПодключениеИР = Неопределено;
				Если Ложь
					Или Найти(ОписаниеОшибки, "пароль") > 0
					Или Найти(ОписаниеОшибки, "password") > 0 
					Или Найти(ОписаниеОшибки, "Пользователь ИБ не идентифицирован") > 0 
				Тогда
					Если ПарольИлиСтрокаСоединения = Неопределено Тогда
						ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Неверное имя или пароль. Команда СброситьНастройкиАдаптераБазы настроит подключение заново." + Символы.ПС + ОписаниеОшибки,,
							ЭтотОбъект, "СброситьНастройкиАдаптераБазы");
					Иначе
						ПоказатьВсплывающееУведомление("Неверное имя или пароль." + Символы.ПС + ОписаниеОшибки);
					КонецЕсли;
					ЗавершитьОперациюПодключения(УведомлениеЗапуска);
					Возврат Неопределено;
				ИначеЕсли Ложь
					Или Найти(ОписаниеОшибки, "0x800706BE") > 0
				Тогда
					ПоказатьВсплывающееУведомление("Ошибка подключения ИР: " + ОписаниеОшибки);
					ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Ошибка инициации приложения. Подробности в журнале регистрации.",, ЭтотОбъект, "ОткрытьЖурналРегистрации");
					ЗавершитьОперациюПодключения(УведомлениеЗапуска);
					Возврат Неопределено;
				КонецЕсли;
				Если НомерПопытки = 2 Тогда
					ФрагментыОшибки = СтрРазделитьЛкс(ОписаниеОшибки, "COMException):", Истина,,,, Истина);
					Если ФрагментыОшибки.Количество() > 1 Тогда
						ОписаниеОшибки = ФрагментыОшибки[1];
					КонецЕсли;
					ОписаниеОшибки = "Ошибка подключения приложения ИР " + СтрокаСоединенияБезПароля + " через COM V83.Application:
					|"+ ОписаниеОшибки; 
					ПоказатьВсплывающееУведомление(ОписаниеОшибки, 6000);
					Сообщить(ОписаниеОшибки, СтатусСообщения.Важное);
					Если Найти(ОписаниеОшибки, "Ошибка разделенного доступа") = 0 Тогда
						ПоказатьВсплывающееУведомление(//"Не удалось подключиться к текущей инфобазе через COM интерфейс V83.Application."
								"Если ошибка связана с COM, откройте в базе ""Управление COM классами 1С"" из ""Инструменты разработчика"" и зарегистрируйте V83.Application текущей версии платформы 1С. Затем перезапустите Турбоконф.");
					КонецЕсли;
					ЗавершитьОперациюПодключения(УведомлениеЗапуска);
					Возврат Неопределено;
				КонецЕсли;
				ИмяИсполняемогоФайла = ИмяИсполняемогоФайла();
				Сообщить("Файл конфигуратора = " + ИмяИсполняемогоФайла);
				Если ТекущаяВерсияТурбоКонф >= "6.0.8771.35683" Тогда 
					Сообщить("Разрядность конфигуратора = " + Конфигуратор.РазрядностьПроцесса);
					Если Конфигуратор.РазрядностьПроцесса = 32  Тогда
						Подветка = "";
						ТекущаяРазрядность = "32";
						УдаляемаяРазрядность = "64";
					Иначе 
						Подветка = "\WOW6432Node";
						ТекущаяРазрядность = "64";
						УдаляемаяРазрядность = "32";
					КонецЕсли;
					РеестрОС = ПолучитьCOMОбъект("winmgmts:{impersonationLevel=impersonate}!\\.\root\default:StdRegProv");
					ВеткаРеестра = "SOFTWARE\Classes" + Подветка + "\CLSID\{e92b75e3-2ea1-4fec-b493-cef3ec59fca6}\LocalServer32";
					
					КорневаяВетка = "2147483650"; // HKLM, HKEY_LOCAL_MACHINE
					Попытка
						// TODO OneScript 1.7 пока не умеет читать выходные параметры из COM https://github.com/EvilBeaver/OneScript/issues/1324
						//РеестрОС.GetStringValue(КорневаяВетка, ВеткаРеестра,, ИмяФайлаКласса);  
						//
						ИмяФайлаЛокальнойМашины = ТурбоКонф.ПолучитьЗначениеИзРеестра("HKEY_LOCAL_MACHINE\" + ВеткаРеестра, "", "");
					Исключение
						// https://turboconf.ru/Tasks/9040#c69369430a1c4dc987f6e5d83f5b9467
						ИмяФайлаЛокальнойМашины = ""; 
					КонецПопытки;
					Сообщить(УдаляемаяРазрядность + "b класс V83.Application локальной машины = " + ИмяФайлаЛокальнойМашины);
					Если ЗначениеЗаполнено(ИмяФайлаЛокальнойМашины) Тогда
						Если РеестрОС.DeleteKey(КорневаяВетка, ВеткаРеестра) > 0 Тогда
							ТекстСообщения = "Запустите TurboConf от имени администратора, чтобы адаптер удалил " + УдаляемаяРазрядность + "b класс V83.Application. "
								+ "Или удалите его вручную через ""Управление COM классами 1С (ИР)"".";
							ПоказатьВсплывающееУведомление(ТекстСообщения, 10000);
							Сообщить(ТекстСообщения);
							ЗавершитьОперациюПодключения(УведомлениеЗапуска);
							Возврат Неопределено;
						Иначе
							ТекстСообщения = "Удален " + УдаляемаяРазрядность + "b класс V83.Application из HKLM, чтобы ОС отдавала " + ТекущаяРазрядность + "b вместо него.";
							//ПоказатьВсплывающееУведомление(ТекстСообщения, 4000);
							Сообщить(ТекстСообщения);
						КонецЕсли;
					КонецЕсли;
					
					КорневаяВетка = "2147483649"; // HKCU, HKEY_CURRENT_USER
					Попытка
						ИмяФайлаТекущегоПользователя = ТурбоКонф.ПолучитьЗначениеИзРеестра("HKEY_CURRENT_USER\" + ВеткаРеестра, "", "");
					Исключение
						// https://turboconf.ru/Tasks/9040#c69369430a1c4dc987f6e5d83f5b9467
						ИмяФайлаТекущегоПользователя = ""; 
					КонецПопытки;
					Сообщить(УдаляемаяРазрядность + "b класс V83.Application текущего пользователя = " + ИмяФайлаТекущегоПользователя);
					Если ЗначениеЗаполнено(ИмяФайлаТекущегоПользователя) Тогда
						Если РеестрОС.DeleteKey(КорневаяВетка, ВеткаРеестра) > 0 Тогда
							ТекстСообщения = "Ошибка удаления " + УдаляемаяРазрядность + "b класс V83.Application из HKCU. Удалите его вручную через ""Управление COM классами 1С (ИР)"".";
							ПоказатьВсплывающееУведомление(ТекстСообщения, 6000);
							Сообщить(ТекстСообщения);
							ЗавершитьОперациюПодключения(УведомлениеЗапуска);
							Возврат Неопределено;
						Иначе 
							ТекстСообщения = "Удален " + УдаляемаяРазрядность + "b класс V83.Application из HKCU, чтобы ОС отдавала " + ТекущаяРазрядность + "b вместо него.";
							//ПоказатьВсплывающееУведомление(ТекстСообщения, 4000);
							Сообщить(ТекстСообщения);
						КонецЕсли;
					КонецЕсли;
					ЗапуститьПриложение("""" + ИмяИсполняемогоФайла + """ /RegServer -CurrentUser",, Истина);
					ПоказатьВсплывающееУведомление("Из-за ошибки подключения регистрируем класс V83.Application для текущей версии платформы 1С и текущего пользователя ОС", 3000);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ДлительностьПодключения = ТекущаяДата() - МоментСтартаПроцесса;
		ЗаголовокПриложенияИР = НазваниеПриложения() + " - " + СтрРазделитьЛкс(СтрокаСоединенияБезПароля, "Usr")[0];
		Попытка
			ПодключениеИР.КлиентскоеПриложение.УстановитьЗаголовок(ЗаголовокПриложенияИР);
		Исключение
			// 8.3.9-
			ПодключениеИР.УстановитьЗаголовокСистемы(ЗаголовокПриложенияИР);
		КонецПопытки;
		ПодключениеИР.Visible = ВидимостьДляНовогоПодключения;
		ТекстСообщенияПодключено = СтрШаблон("Приложение " + ЗаголовокПриложенияИР + " подключено за %1 секунд", ДлительностьПодключения);
		ИспользуемоеИмяФайлаПортативногоИР = "";
		МодулиИР = МодулиИР(ПодключениеИР,, ИспользуемоеИмяФайлаПортативногоИР);
		Если МодулиИР = Неопределено Тогда
			выхПодключеноНоНетПодсистемы = Истина;
			ЗавершитьОперациюПодключения(УведомлениеЗапуска);
			Возврат Неопределено;
		КонецЕсли;
		СохранитьЗначениеБазы("ИспользуемоеИмяФайлаПортативногоИР", ИспользуемоеИмяФайлаПортативногоИР);
		Если МодулиИР <> Неопределено Тогда
			ИмяФайлаБуфера = ПолучитьИмяВременногоФайла();
			Попытка
				НомерВерсииПодсистемыИР = МодулиИР.ирКэш.НомерВерсииПодсистемыИРЛкс();
			Исключение
				НомерВерсииПодсистемыИР = 0;
			КонецПопытки;
			Если НомерВерсииПодсистемыИР < Число(СтрЗаменить(МинимальнаяВерсияИР, ".", "")) Тогда
				ПодключениеИР.Visible = Истина;
				Сообщить("Несовместимая версия подсистемы ИР: " + НомерВерсииПодсистемыИР);
				ТекстСообщения = СтрШаблон("Обнаружена несовместимая версия подсистемы """ + НазваниеПодсистемы() + """. Необходима версия %1 и выше", МинимальнаяВерсияИР);
				ПоказатьВсплывающееУведомление(ТекстСообщения, 5000); // Может заблокироваться модальным окном и будет мешаться
				ПодключениеИР.Сообщить(ТекстСообщения);
				МодулиИР.ирКлиент.ОткрытьСправкуПоПодсистемеЛкс();
			КонецЕсли;
			Попытка
				МодулиИР.ирКлиент.ПодключитьСвязанныйКонфигураторЛкс(Конфигуратор.PID, ИмяФайлаБуфера); // ИР 7.03+
			Исключение
				ПодключениеИР.Visible = Истина;
				ТекстСообщения = "Нет прав на использование подсистемы """ + НазваниеПодсистемы() + """";
				Если ПустаяСтрока(Конфигуратор.ПараметрыИнформационнойБазы.Пользователь) Тогда
					ТекстСообщения = ТекстСообщения + ". Необходимо создать пользователя.";
				КонецЕсли;
				ПоказатьВсплывающееУведомление(ТекстСообщения, 5000); // Может заблокироваться модальным окном и будет мешаться
				ПодключениеИР.Сообщить(ТекстСообщения);
			КонецПопытки;
			МодулиИР.ирКлиент.ЗакрытьВсеЧужиеФормыЛкс();
			Попытка
				ПодключениеИР.СтандартныеПодсистемыКлиент.ПропуститьПредупреждениеПередЗавершениемРаботыСистемы(); // Для БСП
			Исключение
				// Из-за этого потом не пробрасываются исключения https://github.com/EvilBeaver/OneScript/issues/1495
			КонецПопытки;
			Если ПарольИлиСтрокаСоединения = Неопределено Тогда
				МодулиИР.ирКэш.СостояниеПодготовкиКэшМДСеансаЛкс();
				МодулиИР.ирКэш.ПолеТекстаПрограммы().РазобратьТекущийКонтекст(); // внутри выполнится ИнициацияОписанияМетодовИСвойств()
				МодулиИР.ирКэш.ПолеТекстаПрограммы().ПодготовитьГлобальныйКонтекст();
			КонецЕсли;
		КонецЕсли;
		ЗапрещенныеОбработчикиОжидания = Новый Массив;
		ЗапрещенныеОбработчикиОжидания.Добавить("ОбработчикОжиданияПроверкиДинамическогоИзмененияИБ"); //БСП 2.0
		Для Каждого ИмяОбработчика Из ЗапрещенныеОбработчикиОжидания Цикл
			ПодключениеИР.ОтключитьОбработчикОжидания(ИмяОбработчика);
		КонецЦикла;
		УстановитьРазрешениеИР(Истина);
		Если ЗакрытьПриложениеИР(, "замещено новым", Истина) Тогда
			СеансИР = ПодключениеИР.ПолучитьТекущийСеансИнформационнойБазы();
			СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР", ПодключениеИР);
			СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР.ИД", МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс());
			СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР.Кэш", Новый Соответствие);
			СохранитьЗначениеСеансаКонфигуратора("ПодключениеИР.НомерСеанса", СеансИР.НомерСеанса);
			СохранитьЗначениеСеансаКонфигуратора("ИмяФайлаБуфера", ИмяФайлаБуфера);
		КонецЕсли; 
		ПоказатьВсплывающееУведомление(ТекстСообщенияПодключено, 3000);
		ЗапуститьМоноФоновоеЗадание("СледитьЗаТекущимМетодомФоновый", 1000000);
	Исключение
		// В фоне не перехватывает исключение https://github.com/EvilBeaver/OneScript/issues/1495
		//Сообщить("====Тест");
		//ЗакрытьПриложениеИР(, "Ошибка запуска");
		ЗавершитьОперациюПодключения(УведомлениеЗапуска);
		ПоказатьВсплывающееУведомление("Ошибка подключения: " + ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	ЗавершитьОперациюПодключения(УведомлениеЗапуска);
	// ТурбоКонф.АктивироватьОкно(Конфигуратор.ОкноВызоваСкрипта); // Видимо позже еще раз берет фокус
	Возврат ПодключениеИР; 
КонецФункции

Процедура ПродолжитьОбработкуНажатияКлавиш(Знач ЗначениеФлага = Истина) Экспорт
	Попытка
		ТурбоКонф.ПродолжитьОбработкуНажатияКлавиш = ЗначениеФлага;
	Исключение
		// 6.2.8963.2470-
	КонецПопытки;
КонецПроцедуры

Функция ИмяИсполняемогоФайла()
	Результат = ТурбоКонф.ПолучитьПутьКИсполняемомуФайлу(Конфигуратор.ГлавноеОкно) + "\1cv8.exe";
	Возврат Результат;
КонецФункции

Процедура ЗавершитьОперациюПодключения(УведомлениеЗапуска)
	СохранитьЗначениеСеансаКонфигуратора("ДатаЗапускаПодключенияИР", Неопределено);
	ТурбоКонф.СкрытьВсплывающееУведомление(УведомлениеЗапуска);
КонецПроцедуры  

//&ЗапроситьИнформациюОДокументе
//&ВосстанавливатьБуферОбмена
Процедура НайтиВОкнах()
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь,, Истина);
	Если ПолеТекстаПрограммы <> Неопределено Тогда
		МетодМодуля = ПолеТекстаПрограммы.мМетодМодуля;
		Если МетодМодуля <> Неопределено Тогда
			ИмяМетода = МетодМодуля.Имя;
		КонецЕсли;
	КонецЕсли;
	Если ПолеТекстаПрограммы = Неопределено Тогда
		ПолноеИмяОбъекта = СсылкаНаОбъектМДВДеревеКонфигурации(ПодключениеИР);
		Сообщить("ПолноеИмяОбъекта = "+ ПолноеИмяОбъекта);
		Фрагменты = СтрРазделитьЛкс(ПолноеИмяОбъекта);
		Если Фрагменты.Количество() = 2 Тогда
			// Это объект первого уровня
			ОткрытьКонтекстноеМенюДереваМетаданных();
			СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
			Если Истина
				И ТурбоКонф.НайтиЭлементПоИмени("Справочная информация", "элемент меню")
				И КликнутьПоЭлементу("Изменить", "элемент меню") 
			Тогда 
				ЖдатьСменуТекущегоЭлемента(СтарыйИД);
				АктивироватьТекущийОбъектВДеревеКонфигурации();
				ВернутьсяВПредыдущееМестоКонфигуратора();
				ЗакрытьДочернееОкноКонфигуратора();
			КонецЕсли;
		КонецЕсли;
		Если Фрагменты.Количество() >= 4 Тогда
			// Это реквизит
			СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
			ВернутьсяВПредыдущееМестоКонфигуратора();
			ЖдатьСменуТекущегоЭлемента(СтарыйИД);
			СжатоеИмяОбъектаОкна = СжатоеИмяОбъектаОкна(ПодключениеИР);
			Сообщить("Сжатое имя объекта = "+ СжатоеИмяОбъектаОкна);
			Если СтрЧислоВхождений(СжатоеИмяОбъектаОкна, ".") = 2 Тогда
				ТурбоКонф.АльтКлавиша(Клавиши.D4);
				НажатьКлавишуЦикл(Клавиши.Right, 4);
				ТурбоКонф.Ждать(20);
				Если НайтиСтрокуВОкне("(" + Фрагменты[0] + "Объект." + Фрагменты[1] + ")", Истина) Тогда
					НажатьКлавишуЦикл(Клавиши.Left, 4);
					ТурбоКонф.Клавиша(Клавиши.Add);
					ТурбоКонф.Клавиша(Клавиши.Down);
					ТурбоКонф.Ждать(20);
					Если Истина
						И НайтиСтрокуВОкне(Фрагменты[3]) 
						И Фрагменты.Количество() = 6
					Тогда
						ТурбоКонф.Клавиша(Клавиши.Add);
						ТурбоКонф.Клавиша(Клавиши.Down);
						ТурбоКонф.Ждать(20);
						НайтиСтрокуВОкне(Фрагменты[5]);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		АктивироватьТекущийОбъектВДеревеКонфигурации();
	КонецЕсли;
	
	ОткрытьОкноОкна();
	Если Не УстановитьФокусВПервуюТаблицуИлиСписок() Тогда
		Возврат;
	КонецЕсли;
	//ТекстЯчейки = ТурбоКонф.ПолучитьИмяЭлемента(); // Не работает
	//ТекстЯчейки = ТурбоКонф.ПолучитьЭлементыСписка()[0];
	ТурбоКонф.КопироватьТекстВБуфер();
	ТекстЯчейки = ТурбоКонф.ПолучитьБуферОбмена();
	Сообщить("ТекстЯчейки="+ТекстЯчейки);
	// Без клика не сработает CTRL+F
	Если Не КликнутьПоЭлементу(ТекстЯчейки, "элемент списка") Тогда
		Возврат;
	КонецЕсли;
	Если НайтиСтрокуВОкне("Сравнение") Тогда
		ЗакрытьМодальноеОкно(, Клавиши.Enter);
		УстановитьФокусВПервуюТаблицуИлиСписок();
		ТурбоКонф.Клавиша(Клавиши.Add);
		Возврат;
	КонецЕсли;
	МаркерыОконКонфигураций = Новый Массив;
	МаркерыОконКонфигураций.Добавить(".cf");
	МаркерыОконКонфигураций.Добавить("Конфигурация базы данных");
	Для Каждого МаркерОкна Из МаркерыОконКонфигураций Цикл
		Если НайтиСтрокуВОкне(МаркерОкна) Тогда
			ЗакрытьМодальноеОкно(, Клавиши.Enter);
			//ТурбоКонф.КонтролАльтКлавиша(Клавиши.M); // Всегда активирует фильтр основной конфигурации
			
			// Через фильтр
			//Если Не ПустаяСтрока(ТурбоКонф.ПолучитьИмяЭлемента()) Тогда
			//	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
			//КонецЕсли;
			//УстановитьЗначениеПолюВвода(ИмяОбъекта);
			
			// Через поиск
			Если ПустаяСтрока(ТурбоКонф.ПолучитьИмяЭлемента()) Тогда
				ТурбоКонф.Клавиша(Клавиши.Tab); // Активируем дерево
			КонецЕсли; 
			Если НайтиОбъектМетаданныхВДереве(ПолноеИмяОбъекта) Тогда
				ТурбоКонф.Клавиша(Клавиши.Add);
			КонецЕсли;   
			
			Возврат;
		КонецЕсли;
	КонецЦикла;
	// Через глобальный поиск
	//ЗакрытьМодальноеОкно();
	//НайтиВОткрытыхДокументах(ИмяОбъекта, ПолноеИмяОбъекта);
	ЗакрытьМодальноеОкно();

КонецПроцедуры

//.
// Параметры:
//   ИмяОбъекта - Произвольный - 
//   ПолноеИмяОбъекта - Произвольный, Строка - 
Процедура НайтиВОткрытыхДокументах(Знач ИмяОбъекта, Знач ПолноеИмяОбъекта) Экспорт
	ОткрытьГлобальныйПоиск();
	НажатьКлавишуЦикл(Клавиши.Tab, 3);
	ИмяНастройки = ТурбоКонф.ПолучитьЗначение();
	Если ПустаяСтрока(ИмяНастройки) Тогда
		УстановитьЗначениеПолюВвода("Основная", Ложь);
		ЗакрытьМодальноеОкно(); // Чтобы сохранилась настройка
		ОткрытьГлобальныйПоиск();
	КонецЕсли;
	НажатьКлавишуЦикл(Клавиши.Tab, 3, Истина);
	УстановитьЗначениеПолюВвода(ИмяОбъекта, Ложь);
	НажатьКлавишуЦикл(Клавиши.Tab, 2);
	Если Не ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.Клавиша(Клавиши.Space); // Включаем "Слово целиком"
	КонецЕсли;
	НажатьКлавишуЦикл(Клавиши.Tab, 1);
	ИмяСтаройНастройки = ТурбоКонф.ПолучитьЗначение();
	УстановитьЗначениеПолюВвода("Свойства в открытых документах", Ложь);
	НажатьКлавишуЦикл(Клавиши.Tab, 5);
	ТурбоКонф.Клавиша(Клавиши.Space); // Снимаем все пометки
	НажатьКлавишуЦикл(Клавиши.Tab, 4, Истина);
	ТурбоКонф.Клавиша(Клавиши.Home);
	ТурбоКонф.Клавиша(Клавиши.Space); // Включаем "Свойства"
	ТурбоКонф.КонтролКлавиша(Клавиши.PageDown);
	НажатьКлавишуЦикл(Клавиши.Tab, 2);
	ТурбоКонф.Клавиша(Клавиши.Space);
	ТурбоКонф.КонтролКлавиша(Клавиши.PageDown);
	Если ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.Клавиша(Клавиши.Space); // Выключаем "Искать в файлах"
	КонецЕсли;
	НажатьКлавишуЦикл(Клавиши.Tab, 1);
	Если Не ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.Клавиша(Клавиши.Space); // Включаем "Искать в открытых документах"
	КонецЕсли;
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ЗакрытьМодальноеОкно(,Клавиши.Enter);
	ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, 5000, Ложь);
	ОткрытьРезультатыПоиска();
	Если НайтиСтрокуВОкне(ПолноеИмяОбъекта) Тогда
		ТурбоКонф.Клавиша(Клавиши.Enter);
		ТурбоКонф.Клавиша(Клавиши.Add);
	КонецЕсли;
	// Восстановим настройку глобального поиска
	ОткрытьГлобальныйПоиск();
	НажатьКлавишуЦикл(Клавиши.Tab, 3);
	ТурбоКонф.КонтролКлавиша(Клавиши.Down);
	КликнутьПоЭлементу(ИмяСтаройНастройки, "элемент списка");
	ЗакрытьМодальноеОкно(); // Чтобы сохранилась настройка
	//ПоказатьВсплывающееУведомление("Окно сравнения конфигураций или файла конфигурации не найдено");
КонецПроцедуры

Функция ОткрытьРезультатыПоиска() Экспорт
	ТурбоКонф.КонтролАльтКлавиша(Клавиши.O); //Иначе панель результатов не возьмет фокус
	Если Не КликнутьПоЭлементу("Результаты поиска", "кнопка") Тогда
		ТурбоКонф.ОткрытьМеню("Окна", "Служебные окна", "Результаты поиска");
	КонецЕсли;
КонецФункции

Процедура ОткрытьГлобальныйПоиск() Экспорт
	ТурбоКонф.КонтролШифтКлавиша(Клавиши.F);
	ТурбоКонф.ЖдатьОкно("Глобальный поиск по текстам", 2000, Истина);
КонецПроцедуры

Процедура ОткрытьОкноОкна() Экспорт
	Если Не КликнутьПоЭлементу("Окна…", "кнопка") Тогда
		ТурбоКонф.ОткрытьМеню("Окна", "Окна…"); // Символ "многоточие"!
	КонецЕсли;
	ТурбоКонф.ЖдатьОкно("Окна", 1000, Истина);
КонецПроцедуры

Процедура АктивироватьТекущийОбъектВДеревеКонфигурации() Экспорт
	ТурбоКонф.КонтролКлавиша(Клавиши.T);
КонецПроцедуры

//&ТолькоТекстовыеДокументы
//&_ВосстанавливатьБуферОбмена
Процедура НайтиПоследнююПравкуВХранилище()
	ТипЭлементаИнтерфейса = ПолучитьТипТекущегоЭлемента();
	Если Не ЭтоДокумент(ТипЭлементаИнтерфейса) Тогда
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МетодМодуля = ПолеТекстаПрограммы.мМетодМодуля;
	Если МетодМодуля = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяМетода = МетодМодуля.Имя;
	ОпределениеРабочее = ПолеТекстаПрограммы.ТекстМетодаСОписанием(МетодМодуля);
	ТипМодуля = ПолеТекстаПрограммы.мМодульМетаданных.ТипМодуля;
	АктивироватьТекущийОбъектВДеревеКонфигурации();
	ОткрытьКонтекстноеМеню();
	КликнутьПоЭлементу("Выборочная история объекта", "элемент меню");
	КликнутьПоЭлементу("Модуль", "элемент меню");
	КликнутьПоЭлементу("Модуль объекта", "элемент меню");
	КликнутьПоЭлементу("Форма", "элемент меню");
	ОкноФильтра = ТурбоКонф.ЖдатьОкно("Отбор выборочной истории объекта", 2000, Истина);
	Если ОкноФильтра = 0 Тогда
		Возврат;
	КонецЕсли;
	ТурбоКонф.Клавиша(Клавиши.Enter);
	ТурбоКонф.ЖдатьЗакрытияОкна(ОкноФильтра,, 1000);
	ТекстСтрокиИсторииСтарый = "";
	ТурбоКонф.Ждать(500); // Было 300
	Пока Истина Цикл
		ОткрытьКонтекстноеМеню(); 
		КликнутьПоЭлементу("Сравнить выборочно с объектом конфигурации", "элемент меню");
		КликнутьПоЭлементу("Модуль", "элемент меню");
		КликнутьПоЭлементу("Модуль объекта", "элемент меню");
		КликнутьПоЭлементу("Форма (Модуль)", "элемент меню");
		ТурбоКонф.Ждать(50);
		ЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
		Если ЗаголовокОкна = "Выборочное сравнение" Тогда
			// Версии идентичны. Нажимаем ОК
			СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
			ТурбоКонф.Клавиша(Клавиши.Enter);
		Иначе
			ТурбоКонф.Клавиша(Клавиши.Tab);
			РазобратьПозициюВТексте();
			ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь,, Ложь);
			СтрокаМетода = ПолеТекстаПрограммы.мМодульМетаданных.Методы.Найти(НРег(ИмяМетода), "НИмя");
			ОпределениеИзВерсии = "";
			Если СтрокаМетода <> Неопределено Тогда
				ОпределениеИзВерсии = ПолеТекстаПрограммы.ТекстМетодаСОписанием(СтрокаМетода);
			КонецЕсли;
			СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
			Если ОпределениеИзВерсии <> ОпределениеРабочее Тогда
				НайтиСтрокуВОкне(СтрПолучитьСтроку(СокрЛ(ОпределениеРабочее), 1));
				ВосстановитьОкноПриложения(ПодключениеИР);
				МодулиИР.ирКлиент.Сравнить2ЗначенияВФормеЛкс(ОпределениеИзВерсии, ОпределениеРабочее, Ложь, "Старая", "Новая",,,,, "ВстроенныйЯзык", ИмяМетода);
				//ТурбоКонф.КонтролКлавиша(Клавиши.F); // Антибаг Турбоконфа https://turboconf.ru/Tasks/9876 . После завершения потока прилетит еще нажатие Escape. Поэтому откроем бесполезное окно
				Возврат;
			КонецЕсли;
			// Закрываем немодальное окно сравнения текстов модулей
			//ТурбоКонф.Клавиша(Клавиши.Escape); // Антибаг Турбоконфа https://turboconf.ru/Tasks/9876 . Отключаем какой то внутренний цикл (оверлей?)
			//ТурбоКонф.Клавиша(Клавиши.Escape); 
			ЗакрытьМодальноеОкно(); // Не понял почему, но проблему https://turboconf.ru/Tasks/9876 решило именно это
		КонецЕсли;
		ЖдатьСменуТекущегоЭлемента(СтарыйИД);
		ТекстСтрокиИсторииНовый = ВыделенныйТекст(Ложь);
		Если не ЗначениеЗаполнено(ТекстСтрокиИсторииНовый) Тогда
			ВызватьИсключение "Не удалось получить текст элемента списка версий";
		КонецЕсли;
		Если ТекстСтрокиИсторииСтарый = ТекстСтрокиИсторииНовый Тогда
			Прервать;
		КонецЕсли;
		ТекстСтрокиИсторииСтарый = ТекстСтрокиИсторииНовый;
		ТурбоКонф.Клавиша(Клавиши.Up);
	КонецЦикла;

КонецПроцедуры

//&ТолькоТекстовыеДокументы
//&ВосстанавливатьБуферОбмена
Процедура НайтиПоследнююПравкуВГите()
	ТипЭлементаИнтерфейса = ПолучитьТипТекущегоЭлемента();
	Если Не ЭтоДокумент(ТипЭлементаИнтерфейса) Тогда
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//СтароеОкно = ТурбоКонф.ПолучитьАктивноеОкно();
	Если Не ПолеТекстаПрограммы.ОткрытьМодульВГите() Тогда
		ВосстановитьОкноПриложения(ПодключениеИР);
	КонецЕсли;
	//ТурбоКонф.ЖдатьСменуАктивногоОкна(СтароеОкно, 1000, Истина);   
	ТурбоКонф.ЖдатьОкно("Visual Studio Code", 2000, Ложь, Истина);
	Если Найти(ТурбоКонф.ПолучитьЗаголовокТекущегоОкна(), "Visual Studio Code") = 0 Тогда
		ПоказатьВсплывающееУведомление("Не удалось дождаться активации окна Visual Studio Code. Поэтому туда НЕ передан текст из окна модуля конфигуратора.");
		Возврат;
	КонецЕсли; 
	//Если ТурбоКонф.ПолучитьТипТекущегоЭлемента() <> "редактор" тогда
	ТурбоКонф.Ждать(500);
	// https://turboconf.ru/Tasks/9445
	//ТурбоКонф.УстановитьЗначение(ТекстМодуля); // Зависает
	КомандаВыделитьВсе();
	ТурбоКонф.ВставитьТекст(ТекстМодуля); // Часто делает двойную вставку, но не всегда
	ТурбоКонф.КонтролКлавиша(Клавиши.Z); // Откатывает возможную вторую вставку 
	ТурбоКонф.КонтролКлавиша(Клавиши.Z); // Откатывает первую вставку или делает ничего
	ТурбоКонф.КонтролКлавиша(Клавиши.Y); // Повторяет первую вставку. Альтернативное сочетание по умолчанию - Ctrl+Shift+Z
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ТурбоКонф.КонтролКлавиша(Клавиши.G);
	ЖдатьСменуТекущегоЭлемента(СтарыйИД);
	//ТурбоКонф.ВставитьТекст(XMLСтрока(НомерСтрокиТекста)); // Делает двойную вставку // часто вызывает ошибку "Сбой при выполнении запрошенной операции с буфером обмена"
	//ТурбоКонф.КонтролКлавиша(Клавиши.Z); // Откатывает вторую вставку
	ТурбоКонф.ОтправитьТекст(XMLСтрока(НомерСтрокиТекста)); // Работает
	//ТурбоКонф.УстановитьЗначение(XMLСтрока(НомерСтрокиТекста)); // Не работает
	ТурбоКонф.Клавиша(Клавиши.Enter);
КонецПроцедуры

Процедура НажатьКлавишуЦикл(Знач Клавиша, Знач Количество, Знач ЗажатьШифт = Ложь, Знач ЗажатьКонтрол = Ложь)
	Для Счетчик = 1 По Количество Цикл
		Если ЗажатьШифт Тогда
			ТурбоКонф.ШифтКлавиша(Клавиша);
		ИначеЕсли ЗажатьКонтрол Тогда
			ТурбоКонф.КонтролКлавиша(Клавиша);
		Иначе
			ТурбоКонф.Клавиша(Клавиша);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура РазобратьПозициюВТексте(ПолучатьТипЭлемента = Истина)
	Если ПолучатьТипЭлемента Тогда
		ТипЭлементаИнтерфейса = ПолучитьТипТекущегоЭлемента(); // 8мс
	КонецЕсли;
	Сообщить("Разобрана позиция в элементе интерфейса типа """ + ТипЭлементаИнтерфейса + """");
	ВыделенныйТекст = "";
	ПозицияВТексте = 0;
	НомерСтрокиТекста = 0;
	НомерКолонкиТекста = 0;
	Если Ложь
		Или ЭтоДокумент(ТипЭлементаИнтерфейса) 
		Или ТипЭлементаИнтерфейса = ТипЭлемента.Поле 
		Или ТипЭлементаИнтерфейса = ТипЭлемента.ПолеСоСписком
	Тогда
		ТекстМодуля = ТурбоКонф.ПолучитьТекстСПозицией(ВыделенныйТекст, ПозицияВТексте, НомерКолонкиТекста, НомерСтрокиТекста);
	КонецЕсли;
КонецПроцедуры

Функция МодулиИР(Знач Приложение, Знач ЭтоПервоеПодключение = Ложь, выхИспользуемоеИмяФайлаПортативногоИР = "") Экспорт
	ИспользуемоеИмяФайла = "";
	Попытка
		ирПлатформа = Приложение.ирПортативный;
		//ФлагОбновления = Приложение.ирПлатформа; // Вызывает 200мс задержку в некоторых случаях
		ФлагОбновления = Приложение.ирПерехватКлавиатуры;
		Значение = Приложение;
	Исключение
		Если Не ЗначениеЗаполнено(ПапкаПортативногоИР) Тогда
			ПапкаПортативногоИР = ТекущийКаталог() + "\" + ТурбоКонф.ПолучитьКаталогСкрипта() + "\ИР";
			Файл = Новый Файл(ПапкаПортативногоИР);
			Сообщить("Каталог ИР = " + ПапкаПортативногоИР);
			Если Не Файл.Существует() Тогда
				СоздатьКаталог(ПапкаПортативногоИР);
				Файл = Новый Файл(ПапкаПортативногоИР + "\ИР.zip");
				Попытка
					ТурбоКонф.ЗагрузитьФайл("http://devtool1c.ucoz.ru/load/0-0-1-6-20", Файл.ПолноеИмя, ЭтотОбъект, "ПослеЗавершенияЗагрузкиФайла", Файл.ПолноеИмя);  
				Исключение
					ПоказатьВсплывающееУведомление("В базе нет подсистемы """ + НазваниеПодсистемы() + """ и в " + ПапкаПортативногоИР + " нет ее портативного варианта."
						+ " Ссылки для скачивания на случай недоступности сайта ИР:
						|Расширение - http://devtool1c.ucoz.ru/load/osnovnye/ustanovshhik_varianta_rasshirenie/1-1-0-21 
						|Портативный - http://devtool1c.ucoz.ru/load/osnovnye/portativnye_instrumenty_razrabotchika_dlja_1s_8_2/1-1-0-6", 6000);
				КонецПопытки;  
				ПапкаПортативногоИР = "";
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПапкаПортативногоИР) Тогда
			Попытка
				Значение = Приложение.ВнешниеОбработки.ПолучитьФорму(ПапкаПортативногоИР + "\ирПортативный.epf");
				Значение.ЗапретитьАвтозапуск = Истина; // 7.45
			Исключение
				// Платформа 1С не позволяет ловить такие исключения
			КонецПопытки;
			Если Значение <> Неопределено Тогда
				выхИспользуемоеИмяФайлаПортативногоИР = Значение.ИспользуемоеИмяФайла; 
				Если ЭтоПервоеПодключение Тогда
					Приложение.Visible = Истина; // Должно быть видимым на случай различных диалогов, например предупреждений безопасности
				КонецЕсли;
				Если Не Значение.Открыта() Тогда
					Значение.Открыть();
					Если Не Значение.Открыта() Тогда
						ФлагОбновления = "ВерсияИРОбновлена";
					КонецЕсли;
				КонецЕсли;
			Иначе
				ПоказатьВсплывающееУведомление("Для портативного """ + НазваниеПодсистемы() + """ нужно обычное клиентское приложение, а запущено управляемое."
					+ " Поэтому запускаем установщик расширения.", 10000);
				Приложение.ЗапуститьСистему("/Execute""" + ПапкаПортативногоИР + "\Модули\ирУстановщикРасширения.epf""");
				ЗакрытьПриложениеИР();
			КонецЕсли;
		КонецЕсли;
	КонецПопытки; 
	//ФлагОбновления = "ВерсияИРОбновлена";
	Если ФлагОбновления = "ВерсияИРОбновлена" Тогда
		//ЗакрытьПриложениеИР(, "закрыта базовая форма");
		//ЗакрытьПриложениеИР(, "обновлена версия ИР"); // https://turboconf.ru/Tasks/9188
		ИДПриложения = 0;
		ПодключениеИР = ПодключениеИРИзКэша(, ИДПриложения);
		Если ПодключениеИР <> Неопределено Тогда
			ПроцессОС = ПолучитьПроцессОСЛкс(ИДПриложения);
			Если ПроцессОС <> Неопределено Тогда
				УбитьПроцесс(ПроцессОС);
			КонецЕсли;
		КонецЕсли;
		Сообщение = "Запущено подключение новой версии ИР";
		ПоказатьВсплывающееУведомление(Сообщение);
		ЗапуститьПодключениеИР();
		ВызватьИсключение "Требуется переподключение ИР";
	КонецЕсли;
	//! Значение = Приложение;
	Возврат Значение;
КонецФункции

// Функция - Получить процесс ОСЛкс
//
// Параметры:
//  ИдентификаторПроцесса					 - 	 - 
//  НачалоПроцесса							 - 	 - 
//  ДопустимоеОтклонениеВремени				 - 	 - 
//  МаркерВКоманднойСтроке					 - 	 - 
//  ИмяИсполняемогоФайла					 - 	 - 
// 
// Возвращаемое значение:
//  COMОбъект - :
//   * ProcessID - Число
//   * ParentProcessId - Число
//   * CommandLine - Строка
//   * CreationDate - Строка
//   * Name - Строка 
//
Функция ПолучитьПроцессОСЛкс(Знач ИдентификаторПроцесса, Знач НачалоПроцесса = Неопределено, Знач ДопустимоеОтклонениеВремени = 2,
	Знач МаркерВКоманднойСтроке = Неопределено, Знач ИмяИсполняемогоФайла = "1cv8.exe") Экспорт
	
	WMIЛокатор = ПолучитьCOMОбъектWMIЛкс();
	// ТекстОтбора = "1=1 AND"; Синтаксис WQL такого не допускает
	ТекстОтбора = "";
	Если ЗначениеЗаполнено(ИдентификаторПроцесса) Тогда
		Если ТекстОтбора <> "" Тогда
			ТекстОтбора = ТекстОтбора + " AND ";
		КонецЕсли; 
		ТекстОтбора = ТекстОтбора + " ProcessID = " + XMLСтрока(ИдентификаторПроцесса);
	КонецЕсли; 
	Если ЗначениеЗаполнено(МаркерВКоманднойСтроке) Тогда
		Если ТекстОтбора <> "" Тогда
			ТекстОтбора = ТекстОтбора + " AND ";
		КонецЕсли; 
		ТекстОтбора = ТекстОтбора + " CommandLine LIKE '%" + МаркерВКоманднойСтроке + "%'";
	КонецЕсли; 
	Если ЗначениеЗаполнено(ИмяИсполняемогоФайла) Тогда
		Если ТекстОтбора <> "" Тогда
			ТекстОтбора = ТекстОтбора + " AND ";
		КонецЕсли; 
		ТекстОтбора = ТекстОтбора + " Name = '" + ИмяИсполняемогоФайла + "'";
	КонецЕсли; 
	Если НачалоПроцесса <> Неопределено Тогда
		Если ТекстОтбора <> "" Тогда
			ТекстОтбора = ТекстОтбора + " AND ";
		КонецЕсли; 
		ТекстОтбора = ТекстОтбора + " CreationDate >= " + ПолучитьЛитералДатыДляWQLЛкс(НачалоПроцесса - ДопустимоеОтклонениеВремени);
		ТекстОтбора = ТекстОтбора + " AND CreationDate <= " + ПолучитьЛитералДатыДляWQLЛкс(НачалоПроцесса + 1 + ДопустимоеОтклонениеВремени);
	КонецЕсли; 
	Значение = Неопределено; 
	ТекстЗапросаWQL = "Select * from Win32_Process Where " + ТекстОтбора;
	ВыборкаПроцессовОС = WMIЛокатор.ExecQuery(ТекстЗапросаWQL);
	Для Каждого ПроцессОС Из ВыборкаПроцессовОС Цикл
		Значение = ПроцессОС;
		Сообщить("Процесс ОС найден");
		Прервать;
	КонецЦикла;
	Возврат Значение;
КонецФункции

Функция ПолучитьЛитералДатыДляWQLЛкс(Знач Результат) Экспорт 
	
	Результат = Результат - СмещениеСтандартногоВремени();
	Результат = "'" + Формат(Результат, "ДФ='yyyyMMdd HH:mm:ss'; ДП=") + "'";
	Возврат Результат

КонецФункции

Процедура УбитьПроцесс(ПроцессОС, Причина = "") Экспорт
	Попытка
		ПроцессОС.Terminate();
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
	КонецПопытки;
	ТурбоКонф.ПоказатьУведомление("Процесс приложения " + НазваниеПриложения() + " завершен " + Причина);
КонецПроцедуры

Функция ПолучитьCOMОбъектWMIЛкс() Экспорт
	//http://msdn.microsoft.com/en-us/library/windows/desktop/aa389763(v=vs.85).aspx
	Locator = Новый COMОбъект("WbemScripting.SWbemLocator");
	Значение = Locator.ConnectServer(".", "root\cimv2");
	Возврат Значение;
КонецФункции

// см. СобытияМодуль.ПриПодключенииКонфигуратора
Процедура ПриПодключенииКонфигуратора(Параметры)
	СтрокаСоединенияБазыКонфигуратора = СтрокаСоединенияБазыКонфигуратора(Ложь);
	СохранитьЗначениеСеансаКонфигуратора("СтрокаСоединенияБазыКонфигуратора", СтрокаСоединенияБазыКонфигуратора);
	ТекущееРазрешение = ПроверитьРазрешениеИР();
	УстановитьРазрешениеИР(ТекущееРазрешение);
	Если ТекущееРазрешение Тогда
		ПредложитьПодключитьИР();
		ПоследниеМетоды = ВосстановитьЗначениеБазы("ПоследниеМетодыЖСОН");
		Если ПоследниеМетоды <> Неопределено Тогда
			СписокЗначений = Новый СписокЗначений;
			Для Каждого ЭлементСписка Из ОбъектИзЖСОН(ПоследниеМетоды) Цикл
				ЗаполнитьЗначенияСвойств(СписокЗначений.Добавить(0), ЭлементСписка); // https://github.com/EvilBeaver/OneScript/issues/1452
			КонецЦикла;
			СохранитьЗначениеСеансаКонфигуратора("ПоследниеМетоды", СписокЗначений);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПредложитьПодключитьИР() Экспорт
	ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Хотите сразу подключить приложение " + НазваниеПриложения() + "?", 4000, ЭтотОбъект, "ЗапуститьПодключениеИР");
КонецПроцедуры

Процедура ЗапуститьПодключениеИР(Параметры = Неопределено)
	ФоновыеЗадания.Выполнить(ЭтотОбъект, "ПодключениеИРНовое");
КонецПроцедуры

// До 5мс
Функция ВосстановитьЗначениеБазы(Ключ, Шифрование = Ложь)
	//МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	База = СтрокаСоединенияБазыКонфигуратора(Ложь);
	Значение = ТурбоКонф.ВосстановитьЗначение(База + Ключ, Шифрование);
	//Сообщить("ВосстановитьЗначениеБазы. База=" + База + ";" + Ключ + "=" + ?(Шифрование, "***", Значение));
	//Сообщить("Длительность восстановления - " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала) + " мс");
	Возврат Значение;
КонецФункции

// Процедура - Сохранить значение базы
//
// Параметры:
//  Ключ		 - 	 - 
//  Значение - Строка, Число, Булево, Дата - 
//  Шифрование	 - 	 - 
//
Процедура СохранитьЗначениеБазы(Ключ, Значение, Шифрование = Ложь, Знач СтрокаСоединения = "")
	Если Не ЗначениеЗаполнено(СтрокаСоединения) Тогда
		СтрокаСоединения = СтрокаСоединенияБазыКонфигуратора(Ложь);
	КонецЕсли;
	ТурбоКонф.СохранитьЗначение(СтрокаСоединения + Ключ, Значение, Шифрование);
	Сообщить("СохранитьЗначениеБазы. База=" + СтрокаСоединения + ";" + Ключ + "=" + ?(Шифрование, "***", Значение));
КонецПроцедуры

Функция СообщениеСброситьНастройки()
	Возврат " ";
КонецФункции

Процедура СброситьНастройкиАдаптераБазы(Знач Параметры = Неопределено)
	Если Не ЗакрытьПриложениеИР() Тогда
		Возврат;
	КонецЕсли;
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	УстановитьРазрешениеИР(Ложь);
	СохранитьЗначениеБазы("РазрешенИР", Неопределено);
	СохранитьЗначениеБазы("ПарольИлиСтрокаСоединения", Неопределено);
	ПроверитьРазрешениеИР(); 
КонецПроцедуры 

Процедура РазрешитьЗапретитьИР(Знач Параметры = Неопределено)
	ТекущееРазрешение = ВосстановитьЗначениеБазы("РазрешенИР");
	Если ТекущееРазрешение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущееРазрешение = Не ТекущееРазрешение;
	СохранитьЗначениеБазы("РазрешенИР", ТекущееРазрешение);
	УстановитьРазрешениеИР(ТекущееРазрешение);
	ПоказатьРазрешениеПриложенияИР();
	Если ТекущееРазрешение Тогда
		ПредложитьПодключитьИР();
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьРазрешениеИР(Знач ТекущееРазрешение) Экспорт
	УстановитьРежимЗаменыШтатнойПодсказки(ТекущееРазрешение);
	Попытка
		ТурбоКонф.УстановитьВидимостьТурбоКнопокСкриптаДляПроцесса("ИРАдаптер", Конфигуратор.PID, ТекущееРазрешение); // https://turboconf.ru/Tasks/10020
	Исключение
		// Старые версии
	КонецПопытки;
КонецПроцедуры

Функция ПроверитьРазрешениеИР(Отказ = Ложь)
	РазрешенИР = ВосстановитьЗначениеБазы("РазрешенИР");
	Если РазрешенИР = Ложь Тогда
		Если ВосстановитьЗначениеСеансаКонфигуратора("УведомлениеОЗапретеОтображалось") <> Истина Тогда
			СохранитьЗначениеСеансаКонфигуратора("УведомлениеОЗапретеОтображалось", Истина);
			ПоказатьРазрешениеПриложенияИР();
		КонецЕсли
	ИначеЕсли РазрешенИР = Неопределено Тогда
		Отказ = Истина;
		ВопросПользователю = НовыйВопросПользователю();
		ВопросПользователю.Заголовок = "TurboConf";
		ВопросПользователю.Текст = "Разрешить приложение " + НазваниеПриложения() + " для этой базы? 
		|Это необходимо для работы команд ИР. Можно изменить командой РазрешитьЗапретитьИР.";
		ВопросПользователю.УстановитьОбработчик(ЭтотОбъект, "ОбработчикОтветаРазрешитьИР");
		ВопросПользователю.Показать();  
	Иначе
		//УстановитьРежимЗаменыШтатнойПодсказки(Истина);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Процедура ПоказатьРазрешениеПриложенияИР(Знач ПредлагатьУстановитьАвтоподсказки = Истина) Экспорт
	ТекущееРазрешение = ВосстановитьЗначениеБазы("РазрешенИР");
	Если ТекущееРазрешение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Текст = "Вы " + ?(ТекущееРазрешение, "разрешили", "запретили") + " приложение " + НазваниеПриложения() + " для этой базы. Можно изменить командой РазрешитьЗапретитьИР.";
	Параметры = Новый Структура("ОкноКонфигуратора", Конфигуратор.ГлавноеОкно);
	ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), Текст, 10000, ЭтотОбъект, "РазрешитьЗапретитьИР", Параметры);
	Если Не ТекущееРазрешение Тогда
		//ЗакрытьПриложениеИР(); // Лучше не закрывать, т.к. отключение может быть кратковременным
	КонецЕсли;
	Если ЛиДоступнаЧистаяПодсказка() И ПредлагатьУстановитьАвтоподсказки Тогда
		//УстановитьАвтоподсказкуКонфигуратора(Не ТекущееРазрешение);
		ПредложитьУстановитьАвтоподсказку(Не ТекущееРазрешение);
			//ТекущееЗначениеАвтоподсказки = ЛиАвтоПодсказкаКонфигуратора();
			//Если ТекущееЗначениеАвтоподсказки <> Истина Тогда
				//УстановитьАвтоподсказкуКонфигуратора(Истина); //  Много побочных эффектов, которые у себя пока не смог воспроизвести https://turboconf.ru/Tasks/9400
			//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// .
//
// Параметры:
//  РежимДиалогаВопрос	 - РежимДиалогаВопрос - по умолчанию ДаНетОтмена
// 
// Возвращаемое значение:
//  ОбработкаОбъект.ВопросПользователю - 
//
Функция НовыйВопросПользователю(РежимДиалогаВопросМой = Неопределено) Экспорт
	Если РежимДиалогаВопросМой = Неопределено Тогда
		РежимДиалогаВопросМой = РежимДиалогаВопрос.ДаНетОтмена;
	КонецЕсли;
	// https://github.com/EvilBeaver/OneScript/issues/1399
	Если ТурбоКонф.ПолучитьВерсиюТурбоКонф() >= "6.1.8847.27150" Тогда
		// Вариант для ОСкрипт 1.9 
		Параметры = Новый Массив;
		Параметры.Добавить(РежимДиалогаВопросМой);
		ВопросПользователю = Новый ("ВопросПользователю", Параметры);
	Иначе
		// Вариант для ОСкрипт 1.7 
		ВопросПользователю = Новый ("ВопросПользователю", РежимДиалогаВопросМой); 
	КонецЕсли;
	Возврат ВопросПользователю;
КонецФункции

Процедура УстановитьРежимЗаменыШтатнойПодсказки(Знач НовоеЗначение) Экспорт
	ТурбоКонф.СохранитьЗначениеСеанса(Строка(Конфигуратор.ГлавноеОкно)+"_"+"T9AlwaysShowOnCtrlSpace", НовоеЗначение);
	ТурбоКонф.СохранитьЗначениеСеанса(Строка(Конфигуратор.ГлавноеОкно)+"_"+"T9AllowAutoInvokeInsideCommonStrings", НовоеЗначение);
КонецПроцедуры

Процедура ОбработчикОтветаРазрешитьИР(Значение, Параметры) Экспорт
	Если Значение = КодВозвратаДиалога.Да Тогда
		ПараметрыИнформационнойБазы = Неопределено;
		Попытка
			ПараметрыИнформационнойБазы = ТурбоКонф.ПолучитьПараметрыИнформационнойБазы();
		Исключение
			// <6.3.9148.1632
			Попытка
				ТурбоКонф.ОбновитьПараметрыИнформационнойБазы();
			Исключение
				// <6.2.9007.29810
			КонецПопытки;
		КонецПопытки;
		Если ТипЗнч(ПараметрыИнформационнойБазы) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Конфигуратор.ПараметрыИнформационнойБазы, ПараметрыИнформационнойБазы);
		КонецЕсли;
		ВводПароля();
	ИначеЕсли Значение = КодВозвратаДиалога.Нет Тогда
		СохранитьЗначениеБазы("РазрешенИР", Ложь);
		ПроверитьРазрешениеИР();
	КонецЕсли;
КонецПроцедуры

Процедура ВводПароля()
	ИнфоПроцесса = ИнфоПроцесса();
	ПримерСтрокиСоединения = "File=""C:\БД"";Usr=""1"";Pwd=""2""";
	Форма = Новый ("ФормаВводаЗначения"); // ОбработкаОбъект.ФормаВводаЗначения
	Форма.УстановитьОбработчик(ЭтотОбъект, "ОбработчикВводаПароля");
	Форма.Значение = "";
	Форма.Заголовок = "Введите параметры подключения " + НазваниеПриложения();
	Форма.Текст = "Введите пароль пользователя """ + ИнфоПроцесса.Пользователь + """, чтобы приложение " + НазваниеПриложения() + " подключалось к этой базе.
	|Либо введите строку соединения базы с такой же конфигурацией в виде " + ПримерСтрокиСоединения + " для подключения к ней. Для аутентификации ОС укажите строку без имени и пароля.";
	//Форма.МногострочныйРежим = Истина;
	Форма.РежимВводаПароля = Истина;
	Форма.Показать();
	Сообщить("Пример строки соединения " + НазваниеПриложения() + ": " + ПримерСтрокиСоединения);
КонецПроцедуры

Процедура ОбработчикВводаПароля(Значение, Отказ, Параметры) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	ПодключеноНоНетПодсистемы = Ложь;
	ПодключениеИР = ПодключениеИР(Значение,, Ложь, ПодключеноНоНетПодсистемы, Истина);
	Если ПодключениеИР <> Неопределено Тогда
		СохранитьЗначениеБазы("РазрешенИР", Истина);
		СохранитьЗначениеБазы("ПарольИлиСтрокаСоединения", Значение, Истина);
		ПоказатьВсплывающееУведомление("Подключено приложение " + НазваниеПриложения());
		МодулиИР = МодулиИР(ПодключениеИР, Истина);
		Если Не ЗначениеЗаполнено(МодулиИР.ирОбщий.ДатаОбновленияКэшаМодулейЛкс()) Тогда 
			ОбновитьКэшМодулей(ПодсказкаОбновленияКэшаМодулей());
		КонецЕсли;
	ИначеЕсли ПодключеноНоНетПодсистемы Тогда
		ПоказатьВсплывающееУведомление("Сначала установите совместимую версию ИР. Затем вызовите в конфигураторе любую команду ИР для повтора подключения.", 5000);
	Иначе
		ПроверитьРазрешениеИР();
	КонецЕсли;
КонецПроцедуры

Функция ПодсказкаОбновленияКэшаМодулей()
	Результат = " Обновить кэш можно командой ОбновитьКэшМодулей";
	Возврат Результат;
КонецФункции

Процедура ОбновитьКэшМодулей(ДобавкаТекста = "")
	Если Не ПроверитьРазрешениеИР() Тогда
		ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Сначала нужно разрешить " + НазваниеПриложения() + " для этой базы!", 5000, ЭтотОбъект, "СброситьНастройкиАдаптераБазы");
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	Если МодулиИР.ирКэш.ЛиФайловаяБазаЛкс() Тогда
		Если МодулиИР.ирКэш.Получить().ЕстьАдминистративныеПраваУУчетнойЗаписиОС() Тогда
			ВопросПользователю = НовыйВопросПользователю(РежимДиалогаВопрос.ОКОтмена);
			ВопросПользователю.Заголовок = НазваниеСкрипта(); 
			ВопросПользователю.Текст = "Заполнить кэш модулей " + НазваниеПриложения() + " БЕЗ закрытия конфигуратора? 
			|После завершения рекомендуется сбросить памятный кэш через список автодополнения.
			|Кэш модулей необходим командам ИР для видения остальных модулей, кроме текущего, который обновляется при вызове любой команды.
			|" + ДобавкаТекста;
		Иначе
			ВопросПользователю = НовыйВопросПользователю(РежимДиалогаВопрос.ОКОтмена);
			ВопросПользователю.Заголовок = НазваниеСкрипта(); 
			ВопросПользователю.Текст = "Заполнить кэш модулей " + НазваниеПриложения() + " С закрытием конфигуратора (нет прав администратора ОС)? 
			|Кэш модулей необходим командам ИР для видения остальных модулей, кроме текущего, который обновляется при вызове любой команды.
			|" + ДобавкаТекста;
		КонецЕсли;
	Иначе
		ВопросПользователю = НовыйВопросПользователю();
		ВопросПользователю.Заголовок = НазваниеСкрипта(); 
		ВопросПользователю.Текст = "Заполнить кэш модулей " + НазваниеПриложения() + " С закрытием конфигуратора?
		|Ответ ""Нет"" потребует автономный сервер.
		|Кэш модулей необходим командам ИР для видения остальных модулей, кроме текущего, который обновляется при вызове любой команды.
		|" + ДобавкаТекста;
	КонецЕсли;
	ВопросПользователю.УстановитьОбработчик(ЭтотОбъект, "ОбработчикОтветаЗаполнитьКэшМодулей");
	ВопросПользователю.Показать();
КонецПроцедуры

// Процедура - Обработчик ответа заполнить кэш модулей
//
// Параметры:
//  Значение	 - КодВозвратаДиалога - 
//  Параметры	 - 	 - 
//
Процедура ОбработчикОтветаЗаполнитьКэшМодулей(Значение, Параметры) Экспорт
	Если Значение = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	Если Значение = КодВозвратаДиалога.ОК Тогда
		ПодключениеИР = ПодключениеИР();
		МодулиИР = МодулиИР(ПодключениеИР);
		Если МодулиИР.ирКэш.Получить().ЕстьАдминистративныеПраваУУчетнойЗаписиОС() Тогда
			Значение = КодВозвратаДиалога.Нет;
		Иначе
			Значение = КодВозвратаДиалога.Да;
		КонецЕсли;
	КонецЕсли;
	ИмяИсполняемогоФайла = ИмяИсполняемогоФайла();
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	СтрокаКоманды = ЗапуститьТолстыйКлиент(Ложь, Ложь, "/CОбновитьКэшМодулейИР;" + (Не Булево("" + Значение)), ИмяИсполняемогоФайла, Значение = КодВозвратаДиалога.Да, Ложь);
	ТурбоКонф.СохранитьЗначениеСеанса("СтрокаЗапускаОбновлениеКэшаМодулей", СтрокаКоманды);
	Если Значение = КодВозвратаДиалога.Да Тогда
		ПоказатьВсплывающееУведомление("Закройте этот конфигуратор, если он не закроется сам, чтобы запустилась выгрузка модулей", 5000);
		ТурбоКонф.Ждать(50);
		ТурбоКонф.АльтКлавиша(Клавиши.F4);
	КонецЕсли; 
КонецПроцедуры

// см. СобытияМодуль.ПриЗакрытииКонфигуратора
Процедура ПриЗакрытииКонфигуратора(Параметры)
	// Тут уже нет строки соединения. Поэтому восстанавливаем ее из значения сеанса
	Если Не ЗначениеЗаполнено(Параметры.PID) Тогда
		Сообщить("ПриЗакрытииКонфигуратора. PID=0!", СтатусСообщения.Внимание); // Ни разу видел срабатывание
		Возврат;
	КонецЕсли;
	СтрокаСоединенияБазы = ВосстановитьЗначениеСеансаКонфигуратора("СтрокаСоединенияБазыКонфигуратора", Параметры.PID);
	Если ПустаяСтрока(СтрокаСоединенияБазы) Тогда
		// Турбоконф иногда ошибочно присылает событие при завершении клиентского приложения
		Сообщить("ПриЗакрытииКонфигуратора. Неизвестный процесс PID=" + Параметры.PID, СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	СтрокаЗапуска = ТурбоКонф.ВосстановитьЗначениеСеанса("СтрокаЗапускаОбновлениеКэшаМодулей");
	Сообщить("СтрокаЗапускаОбновлениеКэшаМодулей=" + СтрокаЗапуска);
	// TODO сделать проброс ИДКонфигуратора
	//ПодключениеИР = ПодключениеИРИзКэша(Параметры.PID);
	//Если ПодключениеИР <> Неопределено Тогда
	//	ПередатьИзмененияМодулей(ПодключениеИР);
	//КонецЕсли;
	ЗакрытьПриложениеИР(Параметры.PID, " после закрытия конфигуратора"); // При обновлении кэша раньше закрывали без сохранения настроек, чтобы не потерялись настройки конфигуратора https://turboconf.ru/Tasks/8425
	Если ЗначениеЗаполнено(СтрокаЗапуска) Тогда
		ЗапуститьПриложение(СтрокаЗапуска);
	КонецЕсли;
	ТурбоКонф.СохранитьЗначениеСеанса("СтрокаЗапускаОбновлениеКэшаМодулей", Неопределено);
	ПоследниеМетоды = ВосстановитьЗначениеСеансаКонфигуратора("ПоследниеМетоды", Параметры.PID); // СписокЗначений
	Если ПоследниеМетоды <> Неопределено Тогда
		МассивСохранения = Новый Массив;
		Для Каждого ЭлементСписка Из ПоследниеМетоды Цикл
			Элемент = Новый Структура("Значение,Представление");
			ЗаполнитьЗначенияСвойств(Элемент, ЭлементСписка);
			МассивСохранения.Добавить(Элемент);
		КонецЦикла;
		Если ЗначениеЗаполнено(СтрокаСоединенияБазы) Тогда
			СохранитьЗначениеБазы("ПоследниеМетодыЖСОН", ОбъектВЖСОН(МассивСохранения),, СтрокаСоединенияБазы); 
		КонецЕсли;
	КонецЕсли;
	Сообщить("Завершен сеанс конфигуратора. PID=" + Параметры.PID + ". СтрокаСоединения=" + СтрокаСоединенияБазы);
КонецПроцедуры

// см. СобытияМодуль.ПриЗавершенииРаботыПрограммы
Процедура ПриЗавершенииРаботыПрограммы()
	ПодлюченныеКонфигураторы = ПодлюченныеКонфигураторы();
	Для каждого КлючИЗначение Из ПодлюченныеКонфигураторы Цикл
		ЗакрытьПриложениеИР(КлючИЗначение.Ключ, "после завершения ТурбоConf");
	КонецЦикла;
КонецПроцедуры

Процедура ОткрытьЖурналРегистрации(Параметры = Неопределено)
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	ТурбоКонф.ОткрытьМеню("Администрирование", "Журнал регистрации");
КонецПроцедуры

Процедура СообщитьОПроблеме()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТехническаяИнформация = ТехническаяИнформацияИР(ПодключениеИР);
	ПутьКФайлам = КаталогВременныхФайлов() + "\ИРАдаптер";
	УдалитьФайлы(ПутьКФайлам);
	СоздатьКаталог(ПутьКФайлам); 
	ИмяФайлаМодуля = ПутьКФайлам + "\Модуль.txt";
	ИмяФайлаИнфо = ПутьКФайлам + "\Инфо.txt";
	ИмяФайлаОшибка = ПутьКФайлам + "\ОшибкаТурбоконф.txt";
	ИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстМодуля);
	ТекстовыйДокумент.Записать(ИмяФайлаМодуля); 
	ТекстовыйДокумент.УстановитьТекст(ТехническаяИнформация);
	ТекстовыйДокумент.Записать(ИмяФайлаИнфо); 
	Попытка
		ТекстОшибки = ТурбоКонф.ПолучитьСообщениеОбОшибке(); // 6.2.9009.28888+
	Исключение
		ТекстОшибки = Неопределено;
	КонецПопытки;
	Если ТекстОшибки <> Неопределено Тогда
		ТекстовыйДокумент.УстановитьТекст(ТекстОшибки);
		ТекстовыйДокумент.Записать(ИмяФайлаОшибка); 
	КонецЕсли;
	ЗаписьЗип = новый ЗаписьZipФайла;
	ЗаписьЗип.Открыть(ИмяФайлаАрхива);
	ЗаписьЗип.Добавить(ПутьКФайлам, РежимСохраненияПутейZIP.НеСохранятьПути);
	ЗаписьЗип.Записать();
	МодулиИР = МодулиИР(ПодключениеИР);
	МодулиИР.ирКлиент.ОткрытьФайлВПроводникеЛкс(ИмяФайлаАрхива);
	ПоказатьВсплывающееУведомление("Укажите в сообщении показанный файл, картинку и текст ошибки, шаги для повторения проблемы, лог TurboConf с уровнем ""Отладка""", 10000);
	ЗапуститьПриложение("https://turboconf.ru/Tasks/Create?forumId=28");
КонецПроцедуры

//.
// Параметры:
//   ПодключениеИР - Application {V83.Application}, Неопределено - 
//   МодулиИР - Application {V83.Application}, Неопределено - 
// Возвращаемое значение:
//   Строка - 
Функция ТехническаяИнформацияИР(Знач ПодключениеИР) Экспорт
	МодулиИР = МодулиИР(ПодключениеИР);
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте,,,, Ложь, Истина);
	СеансИР = ПодключениеИР.ПолучитьТекущийСеансИнформационнойБазы();
	ТехническаяИнформация =
		"Турбоконф. Версия: " + ТурбоКонф.ПолучитьВерсиюТурбоКонф() + "
		|ИР Адаптер. Версия: " + ВерсияАдаптера + "
		|Приложение ИР. Начало сеанса: " + СеансИР.НачалоСеанса + "
		|Приложение ИР. Номер сеанса: " + СеансИР.НомерСеанса;
	Если ПолеТекстаПрограммы <> Неопределено Тогда
		ТехническаяИнформация = ТехническаяИнформация + "
			|Конфигуратор. ИмяМодуля: " + ПолеТекстаПрограммы.мИмяМодуля + "
			|Конфигуратор. ПозицияВМодуле: строка " + ПолеТекстаПрограммы.мНачальнаяСтрока + ", колонка " + ПолеТекстаПрограммы.мНачальнаяКолонка + ", позиция " + ПозицияВТексте;
	КонецЕсли;
	ТехническаяИнформация = ТехническаяИнформация + "
		|" + МодулиИР.ирКлиент.ТехническаяИнформацияЛкс();
	Возврат ТехническаяИнформация;
КонецФункции

// ИмяИсполняемогоФайла передаем когда процесс нет активного конфигуратора
//
// Параметры:
//  ПодключитьОтладчик	 - 	 - 
//  СПользователем		 - 	 - 
//  ДопПараметры		 - 	 - 
//  ИмяИсполняемогоФайла - 	 - 
//  ТолькоВернутьСтроку	 - 	 - 
//  ЛиВБазеКонфигуратора - Булево - если база приложения ИР не совпадает с базой конфигуратора, то брать строку параметры запуска от базы конфигуратора
// 
// Возвращаемое значение:
//   - 
//
Функция ЗапуститьТолстыйКлиент(Знач ПодключитьОтладчик = Истина, Знач СПользователем = Истина, Знач ДопПараметры = "", Знач ИмяИсполняемогоФайла = "", Знач ТолькоВернутьСтроку = Ложь,
		Знач ЛиВБазеКонфигуратора = Истина)
	ДобавкаПортативныйИР = "";
	ИспользуемоеИмяФайлаИР = ВосстановитьЗначениеБазы("ИспользуемоеИмяФайлаПортативногоИР");
	Если ИспользуемоеИмяФайлаИР = Неопределено Тогда
		ПодключениеИР();
		ИспользуемоеИмяФайлаИР = ВосстановитьЗначениеБазы("ИспользуемоеИмяФайлаПортативногоИР");
	КонецЕсли;
	Если ЗначениеЗаполнено(ИспользуемоеИмяФайлаИР) Тогда
		ДобавкаПортативныйИР = "/Execute""" + ИспользуемоеИмяФайлаИР + """";
	КонецЕсли;
	ДобавкаАдресОтладчика = "";
	Если ПодключитьОтладчик Тогда
		АдресОтладчика = ВосстановитьЗначениеСеансаКонфигуратора("АдресОтладчика");
		Если АдресОтладчика = Неопределено Тогда
			ТурбоКонф.ОткрытьМеню("Отладка", "Подключение...");
			Окно = ТурбоКонф.ЖдатьОкно("Предметы отладки", 2000, Ложь);
			Если Окно <> 0 Тогда
				ТурбоКонф.Ждать(50);
				ЗаголовокКнопки = "Настройкa..."; // Последняя "a" - буква английского алфавита!
				КликнутьПоЭлементу(ЗаголовокКнопки, "кнопка");
				Окно = ТурбоКонф.ЖдатьОкно("Настройки отладчика", 1000, Ложь);
				Если Окно = 0 Тогда
					ТурбоКонф.Клавиша(Клавиши.Escape);
					Возврат "";
				КонецЕсли;
			КонецЕсли;
			Если Окно <> 0 Тогда
				ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
				АдресОтладчика = ТурбоКонф.ПолучитьЗначение();
				Если ЗначениеЗаполнено(АдресОтладчика) Тогда
					СохранитьЗначениеСеансаКонфигуратора("АдресОтладчика", АдресОтладчика);
				КонецЕсли;
				ТурбоКонф.Клавиша(Клавиши.Escape);
				ТурбоКонф.Клавиша(Клавиши.Escape);
			КонецЕсли
		КонецЕсли;
		Если ЗначениеЗаполнено(АдресОтладчика) Тогда
			ДобавкаАдресОтладчика = " /DEBUGGERURL""" + АдресОтладчика + """";
		КонецЕсли;
	КонецЕсли;
	Возврат ЗапуститьПриложение1С("/DEBUG" + ДобавкаАдресОтладчика + " " + ДобавкаПортативныйИР + " " + ДопПараметры, СПользователем, ИмяИсполняемогоФайла, ТолькоВернутьСтроку, ЛиВБазеКонфигуратора);
КонецФункции

// ИмяИсполняемогоФайла передаем когда нет активного конфигуратора
Функция ЗапуститьПриложение1С(Знач ДопПараметры, Знач _СПользователем = Истина, Знач ИмяИсполняемогоФайла = "", Знач ТолькоВернутьСтроку = Ложь, Знач ЛиВБазеКонфигуратора = Истина)
	Если ПустаяСтрока(ИмяИсполняемогоФайла) Тогда
		ИмяИсполняемогоФайла = ИмяИсполняемогоФайла();
	КонецЕсли;
	Если ЛиВБазеКонфигуратора Тогда
		СтрокаСоединения = СтрокаСоединенияБазыКонфигуратора();
		ПарольИлиСтрокаСоединения = ВосстановитьЗначениеБазы("ПарольИлиСтрокаСоединения", Истина);
		Если ЛиСтрокаСоединения(ПарольИлиСтрокаСоединения) Тогда
			СтрокаСоединения = СтрокаСоединенияБазыКонфигуратора(Ложь);
		Иначе
			СтрокаСоединения = СтрокаСоединения + СтрШаблон("Pwd=""%1"";", ПарольИлиСтрокаСоединения);
		КонецЕсли;
	Иначе 
		СтрокаСоединения = СтрокаСоединенияБазыИР();
	КонецЕсли; 
	
	// Антибаг 8.3.25 https://www.hostedredmine.com/issues/993141
	ИмяПользователя = НСтр(СтрокаСоединения, "Usr");
	Пароль = НСтр(СтрокаСоединения, "Pwd");
	СтрокаСоединения = СтрРазделитьЛкс(СтрокаСоединения, ";Usr=")[0];
	ДопПараметры = ДопПараметры + " /N""" + ИмяПользователя + """ /P""" + Пароль + """";
	
	СтрокаСоединения = """" + СтрЗаменить(СтрокаСоединения, """", """""") + """";
	Результат = """" + ИмяИсполняемогоФайла + """ ENTERPRISE /IBConnectionString" + СтрокаСоединения + " " + ДопПараметры;
	Если ТолькоВернутьСтроку Тогда
		Возврат Результат;
	Иначе 
		ЗапуститьПриложение(Результат);
	КонецЕсли;
КонецФункции

// Внешний вызов
// см. СобытияМодуль.ПриАктивизацииСтрокиТ9
Процедура ПриАктивизацииСтрокиТ9(Параметры, Отказ, СтандартнаяОбработка)
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если Не ПроверитьРазрешениеИР(Отказ) Тогда
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИзКэша();
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОписаниеКом = ПолеТекстаПрограммы.ОписаниеТекущегоСловаАвтодополнения(Параметры.Значение, Параметры.ЭтоМетод, Параметры.КлючСловаря);
	Если ОписаниеКом <> Неопределено Тогда
		ТипСлова = ОписаниеКом.Тип;
		ОписаниеСлова = ОписаниеКом.Описание;
	КонецЕсли;
	Описание = Новый Структура;
	Описание.Вставить("Тип", ТипСлова);
	Описание.Вставить("Описание", ОписаниеСлова);
	Параметры.Описание = Описание;
	Сообщить("ПриАктивизацииСтрокиT9 - " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала) + "мс");
КонецПроцедуры 

// Внешний вызов со старым некорректным именем (латинская T https://turboconf.ru/Tasks/9890)
// см. СобытияМодуль.ПриАктивизацииСтрокиT9
Процедура ПриАктивизацииСтрокиT9(Параметры, ШаблонДляВставки, ФорматироватьТекст, Отказ, СтандартнаяОбработка)
	ПриАктивизацииСтрокиТ9(Параметры, Отказ, СтандартнаяОбработка);
КонецПроцедуры

// Внешний вызов
// см. СобытияМодуль.ПослеВставкиЗначенияТ9
Процедура ПослеВставкиЗначенияТ9(Параметры, Отказ, СтандартнаяОбработка)
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если Не ПроверитьРазрешениеИР(Отказ) Тогда
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИзКэша();
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ПолеТекстаПрограммы.Адаптер_ОбновитьСтатистикуВыбораСлова(Параметры.Значение, Параметры.ЭтоМетод, Параметры.КлючСловаря);
	Если ПолеТекстаПрограммы.ЛиСохранитьСтатистикуВыбора() Тогда
		ФоновыеЗадания.Выполнить(ЭтотОбъект, "СохранитьСтатистикуВыбораПодсказки");
	КонецЕсли;
	Если Параметры.ЭтоМетод Тогда
		Попытка
			Параметры.ВызватьПодсказкуПараметров = Истина; // 6.3.9199.30724
		Исключение
			// Антибаг Турбоконфа https://turboconf.ru/Tasks/9979
			ТурбоКонф.КонтролШифтКлавиша(Клавиши.Space);
		КонецПопытки;
	КонецЕсли;
	Сообщить("ПослеВставкиЗначенияT9 - " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала) + " мс");
КонецПроцедуры

// Внешний вызов со старым некорректным именем (латинская T https://turboconf.ru/Tasks/9890) 
// см. СобытияМодуль.ПриВыбореЗначенияT9
Процедура ПослеВставкиЗначенияT9(Параметры, Отказ, СтандартнаяОбработка)
	ПослеВставкиЗначенияТ9(Параметры, Отказ, СтандартнаяОбработка);
КонецПроцедуры

// Внешний вызов
// см. СобытияМодуль.ПриВыбореЗначенияТ9
Процедура ПриВыбореЗначенияТ9(Параметры, ШаблонДляВставки, ФорматироватьТекст, Отказ, СтандартнаяОбработка)
	МоментНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если Не ПроверитьРазрешениеИР(Отказ) Тогда
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИзКэша();
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	НовыйШаблон = ПолеТекстаПрограммы.Адаптер_ПриВыбореСтрокиАвтодополнения(Параметры.Значение, Параметры.ЭтоМетод, Параметры.КлючСловаря, ШаблонДляВставки, ФорматироватьТекст);
	Если НовыйШаблон <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = ПустаяСтрока(НовыйШаблон);
		ШаблонДляВставки = НовыйШаблон;
		Если Отказ Тогда
			ПоказатьВсплывающееУведомление("Генератор вернул пустой текст для вставки");
		КонецЕсли;
	ИначеЕсли Найти(ШаблонДляВставки, "Для Каждого") > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ФорматироватьТекст = Истина;
		ШаблонДляВставки = СтрЗаменить(ШаблонДляВставки, "Для Каждого <!> Из  Цикл", "Для Каждого  Из <!> Цикл");
	КонецЕсли;
	Если Истина
		И Не ТурбоКонф.РежимСовместимости() 
		И Лев(Параметры.Значение, 1) = "<"
		И ПолеТекстаПрограммы.ЛиГенераторСПоглощениемНачалаСтроки(Параметры.Значение)
	Тогда
		РежимДетальнойВставки = Истина;
		Попытка
			Пустышка = Параметры.УдалитьТекстС; // 6.3.9199.27671
		Исключение
			РежимДетальнойВставки = Ложь;
		КонецПопытки;
		Если РежимДетальнойВставки Тогда
			УдаляемыйФрагментСлева = ПолеТекстаПрограммы.мРодительскийКонтекст;
			Если ЗначениеЗаполнено(УдаляемыйФрагментСлева) Тогда
				УдаляемыйФрагментСлева = УдаляемыйФрагментСлева + "." + ПоследнийФрагментЛкс(Параметры.СтрокаСлева);
			Иначе
				УдаляемыйФрагментСлева = СокрЛ(Параметры.СтрокаСлева);
			КонецЕсли;
			Параметры.УдалитьТекстС = Параметры.Позиция - СтрДлина(УдаляемыйФрагментСлева);
			Параметры.УдалитьТекстПо = Параметры.Позиция;
		Иначе
			ПозицияВТексте = ПолеТекстаПрограммы.мПозицияВТексте - 1;
			ТурбоКонф.ВыделитьТекст(ПозицияВТексте - СтрДлина(ПолеТекстаПрограммы.мКонтекст), ПозицияВТексте);
			ТурбоКонф.Клавиша(Клавиши.Delete);
			ТурбоКонф.Ждать(10); // Чтобы все асинхронное завершилось https://turboconf.ru/Tasks/10006
		КонецЕсли;
	КонецЕсли;
	Сообщить("ПриВыбореЗначенияT9 - " + (ТекущаяУниверсальнаяДатаВМиллисекундах() - МоментНачала) + " мс");
КонецПроцедуры

// Внешний вызов со старым некорректным именем (латинская T https://turboconf.ru/Tasks/9890)
// см. СобытияМодуль.ПриВыбореЗначенияT9
Процедура ПриВыбореЗначенияT9(Параметры, ШаблонДляВставки, ФорматироватьТекст, Отказ, СтандартнаяОбработка)
	ПриВыбореЗначенияТ9(Параметры, ШаблонДляВставки, ФорматироватьТекст, Отказ, СтандартнаяОбработка);
КонецПроцедуры

Процедура СохранитьСтатистикуВыбораПодсказки() Экспорт
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИзКэша();
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ПолеТекстаПрограммы.СохранитьСтатистикуВыбораПодсказки();
КонецПроцедуры

Процедура ПослеЗавершенияЗагрузкиФайла(ИмяФайла)
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Имя = "ИР.zip" Тогда
		ЧтениеАрхива = Новый ЧтениеZipФайла(ИмяФайла);
		ЧтениеАрхива.ИзвлечьВсе(Файл.Путь);
		ЧтениеАрхива.Закрыть();
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
			// ScriptEngine.Machine.ExternalSystemException: ... (System.IO.IOException): Процесс не может получить доступ к файлу "C:\turboconf\user_scripts\ИР\ИР.zip", так как этот файл используется другим процессом.
		КонецПопытки;
		ВводПароля();
	КонецЕсли;
КонецПроцедуры

// Функция разбивает строку разделителем.
// Старые имена - РазбитьСтрокуРазделителем, ПолучитьМассивИзСтрокиСРазделителем
// 
// Параметры:
//  Стр      - Строка - которую разбиваем;
//  Разделитель - Строка, "." - символ-разделитель;
//  ОбрезатьНепечатныеСимволы - Булево, *Ложь - делать СокрЛП.
//  ОставлятьПустуюСтроку - Булево, *Истина - если передана пустая строка, то добавлять ее в массив
//
// Возвращаемое значение:
//  Массив - фрагментов.
//
Функция СтрРазделитьЛкс(Знач Стр, Знач Разделитель = ".", Знач ОбрезатьНепечатныеСимволы = Ложь, Знач ОставлятьПустуюСтроку = Истина, Знач _УчитыватьКавычки = Ложь, Знач _ПропускатьПустые = Ложь,
	Знач ТолькоПервыйРазделитель = Ложь) Экспорт
	
	МассивСтрок = Новый Массив;
	Если Истина
		И Не ОставлятьПустуюСтроку 
		И ПустаяСтрока(Стр)
	Тогда
		Возврат МассивСтрок;
	КонецЕсли;   
	ОбрезатьНепечатныеСимволыСразу = ОбрезатьНепечатныеСимволы;
	ДлинаРазделителя = СтрДлина(Разделитель);
	Пока 1=1 Цикл
		Поз = Найти(Стр, Разделитель);
		Если Поз=0 Тогда
			Фрагмент = Стр;
			Если ОбрезатьНепечатныеСимволыСразу Тогда
				Фрагмент = СокрЛП(Фрагмент);
			КонецЕсли;
			МассивСтрок.Добавить(Фрагмент);
			Прервать;
		КонецЕсли;
		Фрагмент = Лев(Стр, Поз-1);
		Если ОбрезатьНепечатныеСимволыСразу Тогда
			Фрагмент = СокрЛП(Фрагмент);
		КонецЕсли;
		МассивСтрок.Добавить(Фрагмент);
		Стр = Сред(Стр, Поз+ДлинаРазделителя);
		Если ТолькоПервыйРазделитель Тогда
			МассивСтрок.Добавить(Стр);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат МассивСтрок; 
		
КонецФункции

// Разделитель тоже удаляется.
Функция СтрокаБезПоследнегоФрагментаЛкс(Знач Строка, Знач Разделитель = ".", Знач БратьГраницуЕслиНеНайден = Ложь) Экспорт
	Позиция = СтрНайти(Строка, Разделитель, НаправлениеПоиска.СКонца);
	Если Позиция = 0 Тогда
		Если БратьГраницуЕслиНеНайден Тогда
			Результат = Строка;
		Иначе
			Результат = "";
		КонецЕсли;
	Иначе
		Результат = Лев(Строка, Позиция - 1);
	КонецЕсли;
	Возврат Результат;
КонецФункции

//&ТолькоТекстовыеДокументы
Процедура СохранитьМодульВФайл()
	ТурбоКонф.КонтролКлавиша(Клавиши.S);
	Если Истина
		И ТурбоКонф.ПолучитьВерсиюAPI() >= 6 
		И Не ТурбоКонф.ЭтоСкрипт 
	Тогда
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(,, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекстМодуля) Или Не ЭтоДокумент() Тогда
		Возврат;    
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	Маркер = "//#Дублировать" + " в файл "; // Разделено для не обнаружения себя же
	ИмяФайла = СокрЛП(МодулиИР.ирОбщий.ТекстМеждуМаркерамиЛкс(ТекстМодуля, Маркер, Символы.ПС, Ложь));
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(ТекстМодуля);
		Текст.Записать(ИмяФайла);   
		ПоказатьВсплывающееУведомление(СтрШаблон("Текст модуля сохранен в файл %1", ИмяФайла), 3000);
		ТурбоКонф.ПерезагрузитьСкрипты();  // Может вызывать залипание https://turboconf.ru/Tasks/9940
		ТурбоКонф.ОтжатьМодификаторы();
	Иначе 
		ПоказатьВсплывающееУведомление("Модуль не связан с файлом. В тексте модуля должна быть строка 
		|" + Маркер + "<Полное имя файла>", 4000);
	КонецЕсли;
КонецПроцедуры

// Получает идентификатор из любой строки.
//  "3-я Дебиторка По контрагентам с интервалами СНГ (для  Руководства)" => "_3_яДебиторкаПоКонтрагентамСИнтерваламиСНГ_дляРуководства_".
//
// Параметры:
//  Представление			 - Строка
//  ЗаменаПустойСтроки		 - 	 - 
//  ДопРазрешенныеСимволы	 - 	 - 
//  ЗаменаСпецСимвола		 - Строка - если пустая, то следующий символ приводится к верхнему регистру
// 
// Возвращаемое значение:
//  Строка - .
//
Функция ИдентификаторИзПредставленияЛкс(Знач Представление = Неопределено, Знач ЗаменаПустойСтроки = "_", ДопРазрешенныеСимволы = "", Знач ЗаменаСпецСимвола = "_") Экспорт

	Если ПустаяСтрока(Представление) Тогда
		Представление = ЗаменаПустойСтроки;
	КонецЕсли;
	Если Истина
		И СокрЛП(Представление) = Представление 
		И Найти(Представление, ",") = 0
	Тогда
		Попытка
			Пустышка = Новый Структура(Представление);
			Возврат Представление;
		Исключение КонецПопытки;
	КонецЕсли; 
	НовоеПредставление = Представление;
	ПервыйСимвол = Сред(Представление, 1, 1);
	Если ЛиЦифраЛкс(ПервыйСимвол) Тогда
		// Первый символ - цифра
		НовоеПредставление = "_" + НовоеПредставление;
	КонецЕсли;
	ПредыдущийСимвол = " ";
	ТекущаяСтрока = "";
	ШаблонСимволаИдентификатора = ШаблонСимволаИдентификатораЛкс(ДопРазрешенныеСимволы);
	Для Счетчик = 1 По СтрДлина(НовоеПредставление) Цикл
		ТекущийСимвол = Сред(НовоеПредставление, Счетчик, 1);
		Если ПустаяСтрока(ПредыдущийСимвол) Тогда
			// Предыдущий символ - непечатаемый или спецсимвол
			ТекущийСимвол = ВРег(ТекущийСимвол);
		КонецЕсли;
		Если Найти(ШаблонСимволаИдентификатора, НРег(ТекущийСимвол)) > 0 Тогда
			// Предыдущий символ - непечатаемый
			ТекущаяСтрока = ТекущаяСтрока + ТекущийСимвол;
		Иначе
			Если Не ПустаяСтрока(ТекущийСимвол) Тогда
				ТекущаяСтрока = ТекущаяСтрока + ЗаменаСпецСимвола;
				Если ЗаменаСпецСимвола = "" Тогда
					ТекущийСимвол = " ";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ПредыдущийСимвол = ТекущийСимвол;
	КонецЦикла;
	Результат = ТекущаяСтрока;
	Возврат ТекущаяСтрока;

КонецФункции

Функция ШаблонСимволаИдентификатораЛкс(Знач ДопРазрешенныеСимволы = "") Экспорт 
	
	РусскиеБуквы = РусскиеБуквыЛкс();
	ШаблонСимволаИдентификатора = НРег("_0123456789" + РусскиеБуквы + "abcdefghijklmnopqrstuvwxyz" + ДопРазрешенныеСимволы); // Русский и Ангийский
	Возврат ШаблонСимволаИдентификатора;

КонецФункции

Функция РусскиеБуквыЛкс() Экспорт 
	
	РусскиеБуквы = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	Возврат РусскиеБуквы;

КонецФункции  

Функция ЛиЦифраЛкс(Символ) Экспорт 
	Результат = Символ <> "" И Найти("0123456789", Символ) > 0;
	Возврат Результат;
КонецФункции

// Не используется
// Заменен на собственный индикатор Турбоконфа
Процедура ПоискПоМодулюФоновый() Экспорт
	Если Истина
		И Конфигуратор.ОкноВызоваСкрипта = ТурбоКонф.ПолучитьАктивноеОкно()
		И ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Поиск"
	Тогда
		ИскомаяСтрока = ТурбоКонф.ПолучитьЗначение();
		СтараяИскомаяСтрока = ВосстановитьЗначениеСеансаКонфигуратора("СтараяИскомаяСтрока");
		Если СтрДлина(ИскомаяСтрока) > 2 И СтараяИскомаяСтрока <> ИскомаяСтрока Тогда
			Попытка
				ПоследнийДокумент = Конфигуратор.ПоследнийДокумент;
			Исключение
				ПоследнийДокумент = Неопределено;
				Возврат;
			КонецПопытки;
			Если ПоследнийДокумент <> Неопределено Тогда
				ПодключениеИР = ПодключениеИР(,, Ложь);
				МодулиИР = МодулиИР(ПодключениеИР);
				Вхождения = Неопределено;  
				СловоЦеликом = Ложь;
				//СловоЦеликом = ТурбоКонф.ПолучитьСостояниеФлажка();
				МодулиИР.ирОбщий.СтрНайтиСловоЛкс(ПоследнийДокумент.Текст, ИскомаяСтрока, 0, СловоЦеликом, Ложь, Вхождения);
				Если Вхождения = Неопределено Тогда
					//ИР 7.41-
					Возврат;
				КонецЕсли;
				ТекстРезульта = СтрШаблон("Найдено %1", Вхождения.Количество());
				ТурбоКонф.ПоказатьПодсказку(ТекстРезульта);
				//МодулиИР.ирОбщий.ОбновитьТекстПослеМаркераЛкс(ТекущийЗаголовок, "", ТекстРезульта);
				//ТурбоКонф.УстановитьЗаголовокТекущегоОкна(ТекущийЗаголовок); // Не работает
			КонецЕсли;
			СохранитьЗначениеСеансаКонфигуратора("СтараяИскомаяСтрока", ИскомаяСтрока);
		КонецЕсли;
	КонецЕсли;
	Если ТурбоКонф.НайтиОкноПоЗаголовку("Поиск") <> 0 Тогда
		ТурбоКонф.Ждать(1000);
		ФоновыеЗадания.Выполнить(ЭтотОбъект, "ПоискПоМодулюФоновый");
	Иначе
		//ПоказатьВсплывающееУведомление("Отключено обновление поиска"); // Для отладки
	КонецЕсли;
КонецПроцедуры

// Внешний вызов     
//&ВосстанавливатьБуферОбмена
// см. СобытияМодуль.ПриОткрытииОкна 
Процедура ПриОткрытииОкна(Параметры)
	ЗаголовокОкна = Параметры.Заголовок;
	Сообщить("Активировано окно - " + ЗаголовокОкна);
	Если Конфигуратор = Неопределено Тогда
		// Недоработка Турбоконфа в диалогах выбора файла https://turboconf.ru/Tasks/9001
		Возврат;
	КонецЕсли;
	Если ЗаголовокОкна = "Конфигуратор" Тогда
		ПарольИлиСтрокаСоединения = ВосстановитьЗначениеБазы("ПарольИлиСтрокаСоединения", Истина);
		ЕстьПанельБлокировкиБазы = Ложь;
		ЕстьНеверноеИмя = Ложь;
		Элементы = ТурбоКонф.НайтиЭлементыПоТипу("панель");
		Для каждого Элемент Из Элементы Цикл
			ЕстьПанельБлокировкиБазы = СтрНачинаетсяС(Элемент, "Ошибка исключительной блокировки");
			ЕстьНеверноеИмя = СтрНачинаетсяС(Элемент, "Неверное имя!");
		КонецЦикла;
		Если Истина
			И ЕстьПанельБлокировкиБазы
			И ПодключениеИРИзКэша() <> Неопределено
		Тогда
			//ЗапуститьПроверкуМодулей();
			Если Не ЛиСтрокаСоединения(ПарольИлиСтрокаСоединения) Тогда 
				АктивноеОкно = ТурбоКонф.ПолучитьАктивноеОкно();
				ТекстОбновитьДинамически = "Обновить динамически";
				ЕстьКнопкаОбновитьДинамически = ТурбоКонф.НайтиЭлементПоИмени(ТекстОбновитьДинамически, "кнопка");
				Если ЕстьКнопкаОбновитьДинамически Тогда 
					//КликнутьПоЭлементу(ТекстОбновитьДинамически, "кнопка"); // Метод признан ненадежным https://turboconf.ru/Tasks/8611
					УспехУстановкиФокуса = ТурбоКонф.УстановитьФокусНаЭлемент(ТекстОбновитьДинамически, "кнопка");
					Если УспехУстановкиФокуса Тогда
						ТурбоКонф.Клавиша(Клавиши.Enter);
						Попытка
							ТурбоКонф.ЖдатьЗакрытияОкна(АктивноеОкно, , 5000);
							Дождались = Истина; 
						Исключение
							Дождались = Ложь;
						КонецПопытки;
						Если Дождались Тогда
							ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "БД обновлена динамически. Переподключить приложение ИР для обновления в нем метаданных?",
								6000, ЭтотОбъект, "ЗапуститьПереподключениеПриложенияИР");
						Иначе
							ПоказатьВсплывающееУведомление("Конфигурация БД обновляется динамически из-за подключенного приложения ИР", 4000); 
						КонецЕсли;
					КонецЕсли;
					ЗаголовокОкна = ""; // Чтобы дальше поиск элементов интерфейса не выполнялся, иначе будет замирать указатель мыши https://turboconf.ru/Tasks/9573
				Иначе 
					ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Приложение ИР блокирует обновление базы. Закрыть?", 5000, ЭтотОбъект, "ЗакрытьПриложениеИР");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;  
		Если ТурбоКонф.НайтиЭлементПоИмени("Для выполнения отладки необходимо включить поддержку сетевого протокола TCP/IP", "панель") Тогда
			ПоказатьВсплывающееУведомление("Возможно отсутствуют свободные порты в диапазоне для отладчика https://partners.v8.1c.ru/forum/t/747951/m/768516");
		КонецЕсли;
		Если ЕстьНеверноеИмя Тогда 
			ТурбоКонф.Клавиша(Клавиши.Enter);
			Тип = ПолучитьТипТекущегоЭлемента();
			Если Тип = ТипЭлемента.Поле Тогда
				СтарыйТекст = ТурбоКонф.ПолучитьЗначение();
				Если ЗначениеЗаполнено(СтарыйТекст) Тогда
					НовыйТекст = ИдентификаторИзПредставленияЛкс(СокрЛП(СтарыйТекст));
					
					////ТурбоКонф.УстановитьЗначение(НовыйТекст); // В палитре свойств не взводится модифицированность 
					//УстановитьЗначениеПолюВвода(НовыйТекст, Ложь); // Почему то криво работает
					ТурбоКонф.УстановитьЗначение("");
					ТурбоКонф.ВставитьТекст(НовыйТекст); // В палитре свойств взводится модифицированность
					
					ТурбоКонф.Клавиша(Клавиши.End);
					ПоказатьВсплывающееУведомление("Значение имени преобразовано из """ + СтарыйТекст + """", 5000);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;                                  
	КонецЕсли;
	Если ЗаголовокОкна = "Выбор объекта" Тогда
		// Ставим фокус в поле фильтра
		ТурбоКонф.КонтролАльтКлавиша(Клавиши.M); 
	КонецЕсли;
	Если Ложь
		Или ЗаголовокОкна = "Отбор по подсистемам" 
		Или ЗаголовокОкна = "Подсистемы" // из общей картинки
	Тогда
		// Ставим фокус в дерево
		ТурбоКонф.Клавиша(Клавиши.Home); 
	КонецЕсли;
	// Теперь это делает сам Турбоконф
	Если ЗаголовокОкна = "Замена" Тогда
		ЧтоЗаменять = ТурбоКонф.ПолучитьЗначение(); 
		Если ЗначениеЗаполнено(ЧтоЗаменять) Тогда
			ТурбоКонф.Клавиша(Клавиши.Tab);
			УстановитьЗначениеПолюВвода(ЧтоЗаменять, Ложь);
			КомандаВыделитьВсе();
		КонецЕсли;
	КонецЕсли;
	Если ЗаголовокОкна = "Перейти по номеру строки" Тогда
		Текст = ТурбоКонф.ПолучитьБуферОбмена(); 
		Попытка
			Число = Число(Текст);
		Исключение
			Число = 0;
		КонецПопытки;
		Если ЗначениеЗаполнено(Число) И ТурбоКонф.ПолучитьЗначение() = "1" Тогда
			УстановитьЗначениеПолюВвода(Число, Ложь);
			КомандаВыделитьВсе();
		КонецЕсли;
	КонецЕсли;
	Если ВосстановитьЗначениеБазы("РазрешенИР") = Истина Тогда
		// Теперь это делает сам Турбоконф
		//Если Истина
		//	И ЗаголовокОкна = "Поиск" 
		//	И Не ТурбоКонф.НайтиЭлементПоИмени("По текущей колонке", "флажок")
		//Тогда
		//	СохранитьЗначениеСеансаКонфигуратора("СтараяИскомаяСтрока", "");
		//	ФоновыеЗадания.Выполнить(ЭтотОбъект, "ПоискПоМодулюФоновый"); 
		//КонецЕсли;
		//
		Если ЗаголовокОкна = "Редактирование типа данных" Тогда
			УстановитьФокусВПервуюТаблицуИлиСписок();
			ИмяЭлемента = ТурбоКонф.ПолучитьИмяЭлемента();
			//Сообщить("ИмяЭлемента="+ИмяЭлемента);
			Если Ложь
				Или ИмяЭлемента = "Булево"
				Или ИмяЭлемента = "Строка"
				Или ИмяЭлемента = "Число"
				Или ИмяЭлемента = "Дата"
				Или ИмяЭлемента = "" // тип был не выбран, поэтому пометка установится первому, но он не станет текущим
			Тогда
				//
			Иначе
				Если ТурбоКонф.УстановитьФокусНаЭлемент("Составной тип данных", "флажок") Тогда
					Если Не ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
						ТурбоКонф.УстановитьСостояниеФлажка(Истина);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			// Ставим фокус в поле фильтра
			ТурбоКонф.КонтролАльтКлавиша(Клавиши.M); 
		КонецЕсли;
		Если ЗаголовокОкна = "Реорганизация информации" Тогда
			Если Не ТурбоКонф.ПолучитьДоступностьЭлемента("Принять", "кнопка") Тогда
				ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), "Открыть подготовку к изменению структуры БД (ИР) для устранения конфликтов?
				|Конфигуратор будет закрыт!", Неопределено, ЭтотОбъект, "ОткрытьПодготовкуКИзменениюСтруктурыБД", Новый Структура("Окно", ТурбоКонф.ПолучитьАктивноеОкно()));
			КонецЕсли;
		КонецЕсли;  
		ЗаголовокОкнаАвтоПодключение = "Автоматическое подключение";
		Если ЗаголовокОкна = "Предметы отладки" Тогда
			ПодключениеИР = ПодключениеИРИзКэша();
			Если ПодключениеИР <> Неопределено Тогда
				УстановитьФокусВПервуюТаблицуИлиСписок();
				НажатьКлавишуЦикл(Клавиши.Tab, 2);
				ВидимыеЭлементы = ПолучитьВидимыеЭлементыСписка();
				Если ВидимыеЭлементы <> Неопределено Тогда
					НомерСеанса = ВосстановитьЗначениеСеансаКонфигуратора("ПодключениеИР.НомерСеанса");
					Если ВидимыеЭлементы.ИменаЭлементов.Найти(XMLСтрока(НомерСеанса) + " Сеанс") <> Неопределено Тогда
						ТурбоКонф.Ждать(20); // увеличение не спасает от плавающей ошибки следующего ожидания окна
						Если КликнутьПоЭлементу("Автоматическое подключение...", "кнопка") Тогда
							ТурбоКонф.ЖдатьОкно(ЗаголовокОкнаАвтоПодключение, 2000, Истина, Истина);
							ИмяФлажка = "Клиентские и внешние соединения на сервере";
							Если ТурбоКонф.УстановитьФокусНаЭлемент(ИмяФлажка, "флажок") Тогда
								Если ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
									ТурбоКонф.УстановитьСостояниеФлажка(Ложь);
									ПоказатьВсплывающееУведомление("Флажок автоподключения ""Клиентские и внешние соединения на сервере"" нельзя включать при подключенном приложении ИР");
								КонецЕсли;
							Иначе
								// HTTP отладка
							КонецЕсли;
							ЗакрытьМодальноеОкно(, Клавиши.Enter, Истина);
						КонецЕсли; 
						УстановитьФокусВПервуюТаблицуИлиСписок();
						НажатьКлавишуЦикл(Клавиши.Tab, 2);
						НажатьКлавишуЦикл(Клавиши.Right, 3); // Активируем колонку "Сеанс"
						Для Счетчик = 1 По 2 Цикл
							Если Не НайтиСтрокуВОкне(XMLСтрока(НомерСеанса)) Тогда
								Прервать;
							КонецЕсли;
							КликнутьПоЭлементу("Отключить", "кнопка");
							УстановитьФокусВПервуюТаблицуИлиСписок();
							НажатьКлавишуЦикл(Клавиши.Tab, 2);
							ТурбоКонф.Ждать(20);
						КонецЦикла;
						ПоказатьВсплывающееУведомление(СтрШаблон("Отключен запрещенный предмет отладки (сеанс %1) приложения ИР.", НомерСеанса));
					КонецЕсли;
				КонецЕсли;
				Если Конфигуратор.ПараметрыИнформационнойБазы.Режим = "Серверный" Тогда
					МодулиИР = МодулиИР(ПодключениеИР);
					Если МодулиИР.ирКэш.РежимОтладкиСервераИзКоманднойСтрокиЛкс() = "нет" Тогда
						ПоказатьВсплывающееУведомление("Отладка на сервере запрещена в параметрах запуска службы. Разрешить ее можно запуском на сервере инструмента ""Управление службами серверов 1С (ИР)""");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЗаголовокОкна = ЗаголовокОкнаАвтоПодключение Тогда
			НажатьКлавишуЦикл(Клавиши.Tab, 1);
		КонецЕсли;
		Если Ложь
			//Или ЗаголовокОкна = "Выберите файл конфигурации" 
			Или (Истина
				И ЗаголовокОкна = "Конфигуратор" 
				И ТурбоКонф.НайтиЭлементПоИмени("Объединение конфигураций завершено.", "панель"))
			Или ЗаголовокОкна = "Получение объектов из хранилища конфигурации" 
			Или (Истина
				И ЗаголовокОкна = "Глобальный поиск по текстам" 
				И ТурбоКонф.НайтиЭлементПоИмени("Заменить все", "кнопка")
				И ТурбоКонф.ПолучитьДоступностьЭлемента("Заменить все", "кнопка")) 
		Тогда
			ПоказатьВсплывающееУведомление("После массовых изменений модулей рекомендуется выполнить команду ОбновитьКэшМодулей", 4000);
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  

Процедура ОткрытьПодготовкуКИзменениюСтруктурыБД(Знач Параметры = Неопределено) Экспорт
	ТурбоКонф.АктивироватьОкно(Конфигуратор.ГлавноеОкно);
	Если Параметры <> Неопределено Тогда
		ТурбоКонф.АктивироватьОкно(Параметры.Окно);
	КонецЕсли;                         
	Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Реорганизация информации" Тогда
		ЗакрытьМодальноеОкно();
		ТурбоКонф.Ждать(2000);
	КонецЕсли;
	ИмяИсполняемогоФайла = ИмяИсполняемогоФайла();
	ТурбоКонф.АльтКлавиша(Клавиши.F4);
	ТурбоКонф.Ждать(2000);
	ЗапуститьТолстыйКлиент(Ложь,, "/CПодготовкаКИзменениюСтруктурыБД", ИмяИсполняемогоФайла);
КонецПроцедуры

Процедура ЗапуститьПереподключениеПриложенияИР(Параметры) Экспорт
	Если Не ЗакрытьВсеОкнаВПриложенииИР() Тогда
		Возврат;
	КонецЕсли;
	ФоновыеЗадания.Выполнить(ЭтотОбъект, "ПодключениеИРНовое");
КонецПроцедуры

// см. ОбработкаОбъект.ТурбоКонф.КликнутьПоЭлементу
Функция КликнутьПоЭлементу(Знач ТекстЭлемента, Знач ТипЭлемента, Знач КнопкаМыши = 0, Знач ДвойнокКлик = Ложь) Экспорт 
	Если Не ТурбоКонф.ПолучитьДоступностьЭлемента(ТекстЭлемента, ТипЭлемента) Тогда
		// Непонятно, почему Турбоконф сам это не делает. TODO Турбоконф
		Возврат Ложь;
	КонецЕсли;
	Возврат ТурбоКонф.КликнутьПоЭлементу(ТекстЭлемента, ТипЭлемента, КнопкаМыши, ДвойнокКлик);
КонецФункции

// Внешний вызов   
Процедура ПриОбновленииКэша(Отказ, СтандартнаяОбработка)
	Если Не ПроверитьРазрешениеИР(Отказ) Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст); 
	ДатаОбновленияСтруктурыФормыМодуля = ПолеТекстаПрограммы.ДатаОбновленияСтруктурыФормыМодуля();
	ПолеТекстаПрограммы.СброситьКэшТиповВыраженийМодуля();
	ПолеТекстаПрограммы.мПлатформа.ОчиститьКэшАнализатораЯзыка();
	ПолеТекстаПрограммы.мМодульМетаданных = Неопределено;
	ПолеТекстаПрограммы.мМетодМодуля = Неопределено;
	ПоказатьВсплывающееУведомление(
			"Памятный кэш анализатора кода очищен. 
			|Метаданные в приложении ИР обновляются при его перезапуске командой ЗакрытьПриложениеИР после обновления конфигурации БД. 
			|Модули в кэше приложения ИР обновляются автоматически при измении в окне модуля. Команда ОбновитьКэшМодулей обновляет их все.", 
			10000);
	Если ДатаОбновленияСтруктурыФормыМодуля = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст); // чтобы сразу обновился кэш формы 
КонецПроцедуры

// см. СобытияМодуль.ПриНажатииКнопки
Процедура ПриНажатииКнопки(Кнопка)
	Если Не ПроверитьРазрешениеИР() Тогда
		ПоказатьРазрешениеПриложенияИР(Ложь);
		Возврат;
	КонецЕсли;
	Если Кнопка = "КнопкаРедактироватьТекст" Тогда
		РедактироватьТекст();
	ИначеЕсли Кнопка = "КнопкаОтладитьОбъект" Тогда
		ОтладитьОбъект();
	ИначеЕсли Кнопка = "КнопкаУсловиеОстанова" Тогда
		КнопкаУсловиеОстанова();
	ИначеЕсли Кнопка = "ВычислитьСвойствоРодителяИзВыражения" Тогда
		ВычислитьСвойствоРодителяИзВыражения();
	ИначеЕсли Кнопка = "ВключитьВТаблоИзВыражения" Тогда
		ВключитьВТаблоИзВыражения();
	ИначеЕсли Кнопка = "ВключитьВТаблоИзКоллекции" Тогда
		ВключитьВТаблоИзКоллекции();
	ИначеЕсли Кнопка = "ПодробноОкнаВыражение" Тогда
		ПодробноОкнаВыражение();
	ИначеЕсли Кнопка = "СравнитьОбъектыИзВыражения" Тогда
		СравнитьОбъектыИзВыражения();
	ИначеЕсли Кнопка = "СериализоватьИзВыражения" Тогда
		СериализоватьИзВыражения();
	ИначеЕсли Кнопка = "СократитьКоллекциюИзКоллекции" Тогда
		СократитьКоллекциюИзКоллекции();
	ИначеЕсли Кнопка = "КнопкаВыполнитьПроизвольныйКод" Тогда
		ВыполнитьПроизвольныйКод();
	ИначеЕсли Кнопка = "КнопкаПрерватьОтлаживаемыйКод" Тогда
		ПрерватьОтлаживаемыйКод();
	ИначеЕсли Кнопка = "ВычислитьОписатьПараметрыМетода" Тогда
		ВычислитьОписатьПараметрыМетода();
	ИначеЕсли Кнопка = "КнопкаНайтиЭлементКоллекции" Тогда
		НайтиЭлементКоллекцииВОкне();
	ИначеЕсли Кнопка = "КнопкаОткрытьЭлементКоллекции" Тогда
		КнопкаОткрытьЭлементКоллекции();
	ИначеЕсли Кнопка = "КнопкаНоваяОбычнаяГруппаВертикальная" Тогда
		КнопкаНоваяОбычнаяГруппаВертикальная(1);
	ИначеЕсли Кнопка = "КнопкаНоваяОбычнаяГруппаБезОтображенияВертикальная" Тогда
		КнопкаНоваяОбычнаяГруппаВертикальная(2);
	ИначеЕсли Кнопка = "КнопкаНоваяОбычнаяГруппаГоризонтальная" Тогда
		КнопкаНоваяОбычнаяГруппаГоризонтальная(1);
	ИначеЕсли Кнопка = "КнопкаНоваяОбычнаяГруппаБезОтображенияГоризонтальная" Тогда
		КнопкаНоваяОбычнаяГруппаГоризонтальная(2);
	ИначеЕсли Кнопка = "КнопкаУстановитьФорматПолнойДаты" Тогда
		КнопкаУстановитьФорматПолнойДаты();
	ИначеЕсли Кнопка = "УстановитьФильтрВыбораТипа" Тогда
		УстановитьФильтрВыбораТипа();
	ИначеЕсли Кнопка = "КнопкаТолькоПомеченные" Тогда
		ВыбратьИзПомеченныхЭлементовСписка();
	ИначеЕсли Кнопка = "КнопкаИскатьСсылки" Тогда
		КнопкаИскатьСсылки();
	ИначеЕсли Кнопка = "КнопкаИскатьФункциональныеОпции" Тогда
		КнопкаИскатьСсылки("ФункциональнаяОпция");
	ИначеЕсли Кнопка = "КнопкаВыбратьЕдинственным" Тогда
		КнопкаВыбратьЕдинственным();
	ИначеЕсли Кнопка = "КнопкаВыборТипаДанных" Тогда
		ВыбратьТипДанных();
	ИначеЕсли Кнопка = "КнопкаУстановитьТипПараметраВыбора" Тогда
		УстановитьТипПараметраВыбора();
	ИначеЕсли Кнопка = "ОткрытьСравнениеВерсийМетода" Тогда
		ОткрытьСравнениеВерсийМетода();
	ИначеЕсли Кнопка = "ОткрытьСравнениеТекстов" Тогда
		ОткрытьСравнениеТекстов();
	ИначеЕсли Кнопка = "ПереименоватьСлово" Тогда
		ЗакрытьМодальноеОкно();
		ПереименоватьСлово();
	ИначеЕсли Кнопка = "ВыделитьМетод" Тогда
		ЗакрытьМодальноеОкно();
		КонструкторМетода();
	ИначеЕсли Кнопка = "ПерейтиКСтрокеМодуляИзСобытия" Тогда
		ПерейтиКСтрокеМодуляИзСобытия();
	ИначеЕсли Кнопка = "ОткрытьПользователяИБ" Тогда
		ОткрытьПользователяИБ();
	ИначеЕсли Кнопка = "ОткрытьОбъектМетаданныхИзСобытия" Тогда
		ОткрытьОбъектМетаданныхИзСобытия();
	ИначеЕсли Кнопка = "ОтобратьТранзакциюИзСобытия" Тогда
		ОтобратьТранзакциюИзСобытия();
	ИначеЕсли Кнопка = "КнопкаСписокОбщихМетодов" Тогда
		СписокОбщихМетодов();
	ИначеЕсли Кнопка = "КнопкаСписокМетодовМодуля" Тогда
		СписокМетодовМодуля();
	ИначеЕсли Кнопка = "КнопкаПерейтиИзНавигатора" Тогда
		КнопкаПерейтиИзНавигатора();
	ИначеЕсли Кнопка = "КнопкаВставитьУсловиеИзТабло" Тогда
		ВставитьУсловиеИзТабло();
	ИначеЕсли Кнопка = "КнопкаВставитьОшибкуИзБуфера" Тогда
		ВставитьОшибкуИзБуфера();
	ИначеЕсли Кнопка = "ВыбратьИПодключитьПредметОтладки" Тогда
		ВыбратьИПодключитьПредметОтладки();
	ИначеЕсли Кнопка = "ОтключитьВсеПредметыОтладки" Тогда
		ОтключитьВсеПредметыОтладки();
	ИначеЕсли Кнопка = "ЗапретитьАвтоподключениеОтладки" Тогда
		ЗапретитьАвтоподключениеОтладки();
	ИначеЕсли Кнопка = "КнопкаНайтиТочкуОстанова" Тогда
		НайтиТочкуОстановаИлиЗакладку();
	ИначеЕсли Кнопка = "КнопкаНайтиЗакладку" Тогда
		НайтиТочкуОстановаИлиЗакладку();
	ИначеЕсли Кнопка = "КнопкаНайтиВСпискеОбъектов" Тогда
		НайтиВСпискеОбъектовМетаданных();
	ИначеЕсли Кнопка = "КнопкаНайтиКартинку" Тогда
		КнопкаНайтиКартинку();
	ИначеЕсли Кнопка = "ВставитьТочкиОстановаИзРезультатовПоиска" Тогда
		ВставитьТочкиОстановаИзРезультатовПоиска();
	ИначеЕсли Кнопка = "РедактироватьПользователя" Тогда
		РедактироватьПользователя();
	ИначеЕсли Кнопка = "ОткрытьЖурналПоПользователю" Тогда
		ОткрытьЖурналПоПользователю();
	ИначеЕсли Кнопка = "СброситьПарольПользователю" Тогда
		СброситьПарольПользователю();
	ИначеЕсли Кнопка = "УстановитьОтборТолькоОшибки" Тогда
		УстановитьОтборТолькоОшибки();
	ИначеЕсли Кнопка = "НайтиВМодуляхИзГлобальногоПоиска" Тогда
		НайтиВМодуляхИзГлобальногоПоиска();
	ИначеЕсли Кнопка = "ПоказатьИнфоКонфигуратора" Тогда
		ПоказатьИнфоКонфигуратора();
	ИначеЕсли Кнопка = "ПоказатьИнфоИР" Тогда
		ПоказатьИнфоИР();
	ИначеЕсли Кнопка = "НастроитьОтборПоПодсистемам" Тогда
		НастроитьОтборПоПодсистемам();
	ИначеЕсли Кнопка = "ПерейтиПоСсылкеИзБуфера" Тогда
		ПерейтиКОпределению(Ложь);
	ИначеЕсли Кнопка = "ПерейтиПоСсылкеИзБуфераИзМодальногоОкна" Тогда
		ПерейтиПоСсылкеИзБуфераИзМодальногоОкна();
	ИначеЕсли Кнопка = "СравнитьИОформитьОтчет" Тогда
		СравнитьИОформитьОтчет();
	ИначеЕсли Кнопка = "КнопкаПерейтиКОпределению" Тогда
		ПоказатьВсплывающееУведомление("Пробуй более функциональную команду ""Перейти к определению"" нажатием Ctrl+F12 в модуле");
	КонецЕсли;
КонецПроцедуры    

Процедура СравнитьИОформитьОтчет() Экспорт
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	КликнутьПоЭлементу("Подробно", "переключатель");
	КликнутьПоЭлементу("Текстовый документ", "переключатель");
	ТурбоКонф.Клавиша(Клавиши.Tab);
	ИмяФайла = ТурбоКонф.ПолучитьЗначение();
	ИДСтарый = ИдентификаторТекущегоЭлементаОкна();
	ЗакрытьМодальноеОкно(, Клавиши.Enter, Истина);
	ТурбоКонф.ЖдатьСменуТекущегоЭлемента(ИДСтарый, 500, Ложь);
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайла);
	Массив1 = Новый Массив;
	Массив2 = Новый Массив;
	Для НомерСтроки = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
		Строка = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
		Если Не Найти(Строка, "<--") > 0 Тогда
			Массив1.Добавить(Строка);
		КонецЕсли;
		Если Не Найти(Строка, "-->") > 0 Тогда
			Массив2.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	ЗакрытьДочернееОкноКонфигуратора();
	ВосстановитьОкноПриложения(ПодключениеИР);
	ЗаголовокОкна = МодулиИР.ирОбщий.ТекстМеждуМаркерамиЛкс(ТекстовыйДокумент.ПолучитьТекст(), Символы.ПС + "	- ***", Символы.ПС); 
	МодулиИР.ирКлиент.Сравнить2ЗначенияВФормеЛкс(СтрСоединить(Массив1, Символы.ПС), СтрСоединить(Массив2, Символы.ПС), Ложь,,,,, ЗаголовокОкна,,, ЗаголовокОкна);
КонецПроцедуры    

Процедура КнопкаИскатьСсылки(ИмяТипаСсылки = "")
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ЗакрытьМодальноеОкно(, Клавиши.Enter, Истина, 20000);
	//СтарыйИД = ТурбоКонф.ПолучитьRuntimeIdСтрокой();
	//ЖдатьСменуТекущегоЭлемента(СтарыйИД, 20000);
	ТурбоКонф.КонтролАльтКлавиша(Клавиши.O); // Окно сообщений
	Для Сч=1 По 10 Цикл
		Текст = ТурбоКонф.ПолучитьТекстМодуля("", 0);
		Вхождения = МодулиИР.ирОбщий.НайтиРегВыражениеЛкс(Текст, "Объект ""[^""]+"" использован в:");
		Если Вхождения.Количество() > 0 Тогда
			Прервать;
		КонецЕсли;
		ТурбоКонф.Ждать(500);
	КонецЦикла;
	Позиция = Вхождения.Получить(Вхождения.Количество() - 1).ПозицияВхождения;
	Если ЗначениеЗаполнено(ИмяТипаСсылки) Тогда
		Вхождения = МодулиИР.ирОбщий.НайтиРегВыражениеЛкс(Сред(Текст, Позиция), "^" + ИмяТипаСсылки + "\.",,,, Истина);
		Если Вхождения.Количество() Тогда
			Позиция = Позиция + Вхождения.Получить(0).ПозицияВхождения;
		КонецЕсли;
	КонецЕсли;
	ТурбоКонф.ВыделитьТекст(Позиция, Позиция + 10);
	НомерСтроки = 0;           
	ТурбоКонф.ПолучитьТекстСПозицией("", 0, 0, НомерСтроки);
	ТурбоКонф.ПерейтиВПозицию(1, НомерСтроки);
КонецПроцедуры

Процедура КнопкаВыбратьЕдинственным()
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ТурбоКонф.УстановитьФокусНаЭлемент("Составной тип данных", "флажок");
	Если ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Ложь);
	КонецЕсли;
	ЗаголовокОкнаВыбора = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	Для Сч=1 По 2 Цикл
		УстановитьФокусВПервуюТаблицуИлиСписок();
		ТурбоКонф.Клавиша(Клавиши.Space);
		ЗакрытьМодальноеОкно(Ложь, Клавиши.Enter, Истина, 50);
		Если ТурбоКонф.ПолучитьЗаголовокТекущегоОкна() = "Конфигуратор" Тогда
			// Выбрано ничего
			ТекущееОкно = ТурбоКонф.ПолучитьАктивноеОкно();
			ЗакрытьМодальноеОкно(Ложь, Клавиши.Enter);
			Продолжить;
		КонецЕсли;
		Прервать;
	КонецЦикла;
КонецПроцедуры

Процедура НайтиВМодуляхИзГлобальногоПоиска()
	УстановитьФокусНаКнопкуСправка();
	ТурбоКонф.Клавиша(Клавиши.Tab);
	НайтиВМодулях(ТурбоКонф.ПолучитьЗначение());
КонецПроцедуры     

Процедура ПерейтиПоСсылкеИзБуфераИзМодальногоОкна()
	ЗакрытьМодальноеОкно();
	ПерейтиКОпределению(Ложь);
КонецПроцедуры

Процедура ПоказатьИнфоИР()
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТехническаяИнформацияИР = ТехническаяИнформацияИР(ПодключениеИР);
	ПоказатьВсплывающееУведомление(ТехническаяИнформацияИР, 10000);
КонецПроцедуры

Процедура ПоказатьИнфоКонфигуратора()
	
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПроцессОС = МодулиИР.ирОбщий.ПолучитьПроцессОСЛкс(Конфигуратор.PID);
	ДатаСтарта = МодулиИР.ирОбщий.СтрокаДатыWMIВДатуЛкс(ПроцессОС.CreationDate);
	ПоказатьВсплывающееУведомление(
	"PID=" + Конфигуратор.PID + ", x" + Конфигуратор.РазрядностьПроцесса + ", Старт=" + ДатаСтарта + " 
	|Строка запуска = " + ПроцессОС.CommandLine
	, 10000);
КонецПроцедуры

Процедура ВыбратьИПодключитьПредметОтладки()
	ЯчейкиТекущейСтроки = ЯчейкиТекущейСтрокиСпискаПутемПеремещения();
	ТурбоКонф.КонтролШифтКлавиша(Клавиши.R); // Обновим список
	УстановитьФокусВПервуюТаблицуИлиСписок();
	Если НайтиВСписке(ЯчейкиТекущейСтроки) Тогда
		КликнутьПоЭлементу("Подключить", "кнопка");
	КонецЕсли;
КонецПроцедуры   

Процедура ОтключитьВсеПредметыОтладки()
	УстановитьФокусВПервуюТаблицуИлиСписок();
	НажатьКлавишуЦикл(Клавиши.Tab, 2);
	Пока Истина Цикл
		ТурбоКонф.Клавиша(Клавиши.Home); 
		Если Не КликнутьПоЭлементу("Отключить", "кнопка") Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры  

Процедура ЗапретитьАвтоподключениеОтладки()
	ЗаголовокОкнаАвтоПодключение = "Автоматическое подключение";
	ПодключениеИР = ПодключениеИРИзКэша();
	Если КликнутьПоЭлементу("Автоматическое подключение...", "кнопка") Тогда
		ТурбоКонф.ЖдатьОкно(ЗаголовокОкнаАвтоПодключение, 2000, Истина, Истина);
		ИменаФлажков = Новый Массив;
		ИменаФлажков.Добавить("Клиентские и внешние соединения на сервере");
		ИменаФлажков.Добавить("Web-сервисы");
		ИменаФлажков.Добавить("HTTP-сервисы");
		ИменаФлажков.Добавить("OData-сервисы");
		ИменаФлажков.Добавить("Фоновые задания");
		Для Каждого ИменаЭлемент Из ИменаФлажков Цикл
			Если ТурбоКонф.УстановитьФокусНаЭлемент(ИменаЭлемент, "флажок") Тогда
				Если ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
					ТурбоКонф.УстановитьСостояниеФлажка(Ложь);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ЗакрытьМодальноеОкно(, Клавиши.Enter, Истина);
	КонецЕсли;
	//ПоказатьВсплывающееУведомление("");
КонецПроцедуры   

Процедура ПерейтиКСтрокеМодуляИзСобытия()
	УстановитьФокусНаКнопкуСправка();
	НажатьКлавишуЦикл(Клавиши.Tab, 6);
	ПерейтиКОпределению();
КонецПроцедуры 

Процедура ОткрытьПользователяИБ()
	УстановитьФокусНаКнопкуСправка();
	НажатьКлавишуЦикл(Клавиши.Tab, 2); 
	ИмяПользователя = ТурбоКонф.ПолучитьЗначение();
	ЗакрытьМодальноеОкно();
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ТурбоКонф.ОткрытьМеню("Администрирование", "Пользователи");
	ЖдатьСменуТекущегоЭлемента(СтарыйИД);
	НайтиСтрокуВОкне(ИмяПользователя, Истина);
	ТурбоКонф.Клавиша(Клавиши.Enter);
	
КонецПроцедуры

Процедура ОткрытьОбъектМетаданныхИзСобытия()
	УстановитьФокусНаКнопкуСправка();
	НажатьКлавишуЦикл(Клавиши.Tab, 7); 
	ПредставлениеМД = ТурбоКонф.ПолучитьЗначение();
	Если ПустаяСтрока(ПредставлениеМД) Тогда
		Возврат;
	КонецЕсли;
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ПредставлениеМД = СокрЛП(ПоследнийФрагментЛкс(ПредставлениеМД));
	СтрокаМД = МодулиИР.ирКэш.Получить().ДеревоОбъектовМД().Строки.Найти(ПредставлениеМД, "Представление", Истина);
	Если СтрокаМД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗакрытьМодальноеОкно();
	ПерейтиПоСсылкеМД(СтрокаМД.ПолноеИмяОбъекта);
КонецПроцедуры  

Процедура ОтобратьТранзакциюИзСобытия()
	УстановитьФокусНаКнопкуСправка();
	НажатьКлавишуЦикл(Клавиши.Tab, 7, Истина); 
	Транзакция = ТурбоКонф.ПолучитьЗначение();
	Если ПустаяСтрока(Транзакция) Тогда
		Возврат;
	КонецЕсли;
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ЗакрытьМодальноеОкно();
	ЖдатьСменуТекущегоЭлемента(СтарыйИД);
	КликнутьПоЭлементу("Отбор...", "кнопка");
	ТурбоКонф.ЖдатьОкно("Отбор", 2000, Истина);
	ТурбоКонф.КонтролКлавиша(Клавиши.PageDown);
	ТурбоКонф.КонтролКлавиша(Клавиши.PageDown);
	НажатьКлавишуЦикл(Клавиши.Tab, 1);
	УстановитьЗначениеПолюВвода(Транзакция); 
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
КонецПроцедуры  

Процедура РедактироватьПользователя()
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	УстановитьФокусНаКнопкуСправка();
	НажатьКлавишуЦикл(Клавиши.Tab, 1);
	ИмяПользователя = ТурбоКонф.ПолучитьЗначение();
	ВосстановитьОкноПриложения(ПодключениеИР);
	МодулиИР.ирКлиент.ОткрытьПользователяИБЛкс(ИмяПользователя);
КонецПроцедуры 

Процедура ОткрытьЖурналПоПользователю()
	УстановитьФокусНаКнопкуСправка();
	НажатьКлавишуЦикл(Клавиши.Tab, 1);
	ИмяПользователя = ТурбоКонф.ПолучитьЗначение();
	СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ЗакрытьМодальноеОкно();
	ТурбоКонф.ОткрытьМеню("Администрирование", "Журнал регистрации");
	ЖдатьСменуТекущегоЭлемента(СтарыйИД);
	КликнутьПоЭлементу("Отбор...", "кнопка");
	ТурбоКонф.ЖдатьОкно("Отбор", 2000, Истина);
	НажатьКлавишуЦикл(Клавиши.Tab, 3);
	НайтиСтрокуВОкне(ИмяПользователя, Истина);
КонецПроцедуры 

Процедура СброситьПарольПользователю()
	ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
	УстановитьФокусНаКнопкуСправка();
	НажатьКлавишуЦикл(Клавиши.Tab, 4);
	ТурбоКонф.Ждать(20);
	ТурбоКонф.УстановитьСостояниеФлажка(Истина);
	ТурбоКонф.Клавиша(Клавиши.Tab);
	УстановитьЗначениеПолюВвода("", Ложь);
КонецПроцедуры

Процедура УстановитьОтборТолькоОшибки()
	Если Не ТурбоКонф.НайтиЭлементПоИмени("Основные", "вкладка") Тогда
		ПоказатьВсплывающееУведомление("Недоступно в этом окне");
		Возврат;
	КонецЕсли;
	ТурбоКонф.УстановитьФокусНаЭлемент("Отборы", "кнопка");
	ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
	ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
	НажатьКлавишуЦикл(Клавиши.Tab, 3, Истина);
	
	// Уровни важности
	//КликнутьПоЭлементу("Выключить все", "кнопка"); // Неуникальное имя кнопки
	ТурбоКонф.Клавиша(Клавиши.Home);
	ТурбоКонф.Клавиша(Клавиши.Down);
	ТурбоКонф.Клавиша(Клавиши.Space);
	ТурбоКонф.Клавиша(Клавиши.Down);
	ТурбоКонф.Клавиша(Клавиши.Space);
	ТурбоКонф.Клавиша(Клавиши.Down);
	ТурбоКонф.Клавиша(Клавиши.Space);
	НажатьКлавишуЦикл(Клавиши.Tab, 3, Истина); 
	
	// Типы событий
	Если АктивироватьСтрокуДерева("Информационная база.Ошибка изменения конфигурации базы данных") Тогда
		ТурбоКонф.Клавиша(Клавиши.Space);
	КонецЕсли;
	
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter);

КонецПроцедуры

Процедура ОткрытьСравнениеВерсийМетода()
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	УстановитьФокусВПервуюТаблицуИлиСписок();
	НажатьКлавишуЦикл(Клавиши.Left, 3);
	ТекстЯчейки = ТурбоКонф.ПолучитьИмяЭлемента();
	ИмяМетода = МодулиИР.ирОбщий.ПервыйФрагментЛкс(ТекстЯчейки, " ");
	ЗаголовокЛевый = Сред(ТекстЯчейки, СтрДлина(ИмяМетода) + 2);
	ТурбоКонф.Клавиша(Клавиши.Right);
	ТекстЯчейки = ТурбоКонф.ПолучитьИмяЭлемента();
	ЗаголовокПравый = Сред(ТекстЯчейки, СтрДлина(ИмяМетода) + 2);
	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	ТекстПравый = ТурбоКонф.ПолучитьТекстМодуля("", 0);
	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	ТекстЛевый = ТурбоКонф.ПолучитьТекстМодуля("", 0);
	Модально = Истина; 
	
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ОповеститьПользователяОПриостановке(ПодключениеИР); 
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("Сравнение.*", 5000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
	Попытка
		МодулиИР.ирКлиент.Сравнить2ЗначенияВФормеЛкс(ТекстЛевый, ТекстПравый, Модально, ЗаголовокЛевый, ЗаголовокПравый,,, ИмяМетода,, "ВстроенныйЯзык", ИмяМетода);
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
КонецПроцедуры

Процедура ОткрытьСравнениеТекстов()
	ПодключениеИР = ПодключениеИР(, Ложь, Ложь);
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ТурбоКонф.УстановитьФокусНаЭлемент("", "документ");
	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	ТекстПравый = ТурбоКонф.ПолучитьТекстМодуля("", 0);
	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	ТекстЛевый = ТурбоКонф.ПолучитьТекстМодуля("", 0);
	ЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	ВосстановитьОкноПриложения(ПодключениеИР);
	МодулиИР.ирКлиент.Сравнить2ЗначенияВФормеЛкс(ТекстЛевый, ТекстПравый, Ложь,,,,,,, "ВстроенныйЯзык", ЗаголовокОкна);
КонецПроцедуры

Процедура НайтиТочкуОстановаИлиЗакладку()
	УстановитьФокусВПервуюТаблицуИлиСписок();
	Если НайтиВСписке() Тогда
		КликнутьПоЭлементу("Перейти к исходному коду", "кнопка");
	КонецЕсли;
КонецПроцедуры    

Процедура НайтиВСпискеОбъектовМетаданных()
	УстановитьФокусВПервуюТаблицуИлиСписок();
	Если НайтиВСписке() Тогда
	КонецЕсли;
КонецПроцедуры  

Процедура НайтиЭлементКоллекцииВОкне() 
	ТурбоКонф.ОтжатьМодификаторы();
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ЯчейкиТекущейСтроки = ЯчейкиТекущейСтрокиСпискаПутемПеремещения();
	ЗаголовокНачальногоОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	Если КликнутьПоЭлементу("Вывести список...", "кнопка") Тогда
		ТурбоКонф.ЖдатьОкно("Вывести список", 1000, Истина);
		УстановитьФокусВПервуюТаблицуИлиСписок();
		Если Ложь
			Или ЗаголовокНачальногоОкна = "ТаблицаЗначений"
			Или ЗаголовокНачальногоОкна = "Структура"
			Или ЗаголовокНачальногоОкна = "Соответствие"
			Или ЗаголовокНачальногоОкна = "СписокЗначений"
			Или Найти(ЗаголовокНачальногоОкна, "ТабличнаяЧасть.") > 0
			Или СтрНачинаетсяС(ЗаголовокНачальногоОкна, "КоллекцияСтрок")
			Или СтрНачинаетсяС(ЗаголовокНачальногоОкна, "КоллекцияКолонок")
			Или СтрНачинаетсяС(ЗаголовокНачальногоОкна, "ДанныеФормы")
		Тогда
			// Ускорение
			ТурбоКонф.Клавиша(Клавиши.Down);
			ТурбоКонф.Клавиша(Клавиши.Space); // - Значение элемента
			ТурбоКонф.Клавиша(Клавиши.Down);
			ТурбоКонф.Клавиша(Клавиши.Space); // - Тип элемента
		КонецЕсли;
		Окно = ТурбоКонф.ПолучитьАктивноеОкно();
		ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
		ТурбоКонф.ЖдатьЗакрытияОкна(Окно,, 5000);  
		КликнутьПоЭлементу("Закрыть", "кнопка"); // Окно само не восстанавливает фокус
		Счетчик = 0;
		Успех = Ложь;
		Пока Счетчик < 10  Цикл
			ТурбоКонф.Ждать(20); // Нужно время чтобы конфигуратор после передачи управления главному окну активировал предыущее дочернее
			ЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
			Сообщить("ЗаголовокОкна=" + ЗаголовокОкна);
			Если ЛиАктивноГлавноеОкно(ЗаголовокОкна) Тогда
				Успех = Истина;
				Прервать;
			КонецЕсли;
			Если ЗаголовокОкна = "Выражение" Тогда  
				УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
				ПоследнееВыражение = ТурбоКонф.ПолучитьЗначение();
			КонецЕсли;
			ЗакрытьМодальноеОкно();
			//ЗакрытьДочернееОкноКонфигуратора(); // тоже работает
			Счетчик = Счетчик + 1;
		КонецЦикла; 
		Если Не Успех Тогда
			Возврат;
		КонецЕсли; 
		ИмяФайлаТабличногоДокумента = СохранитьСодержимоеОкнаВоВременныйФайл();
		ЗакрытьДочернееОкноКонфигуратора();
		//ПерейтиКТекущейСтрокеИсполнения(); // Контекст может находиться не в верхней строке стека
		ПодключениеИР = ОткрытьОкноВыражения();  // Почему то тут срабатывает команда ВычислитьВыражение скрипта при отправке нажатия SHIFT+F9
		Если ПодключениеИР = Неопределено Тогда
			УдалитьФайлы(ИмяФайлаТабличногоДокумента);
			Возврат;
		КонецЕсли;
		УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
		УстановитьЗначениеПолюВвода(ПоследнееВыражение);
		ЖдатьВычислениеВыражения();
		ТурбоКонф.Клавиша(Клавиши.F2);
		ТурбоКонф.ЖдатьОкно(ЗаголовокНачальногоОкна, 1000, Истина);
		ТурбоКонф.Ждать(20);
		ТурбоКонф.Клавиша(Клавиши.Up); // Иначе поиск не сработает  
		НайтиВСписке(ЯчейкиТекущейСтроки, ИмяФайлаТабличногоДокумента);
	КонецЕсли;
КонецПроцедуры  

Процедура КнопкаОткрытьЭлементКоллекции()
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ИмяСвойства = ПоследнийФрагментЛкс(ТурбоКонф.ПолучитьИмяЭлемента(), " ");
	ТурбоКонф.Клавиша(Клавиши.F2);
	ЖдатьОкноВыражение();
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ТурбоКонф.Клавиша(Клавиши.Add);
	ТурбоКонф.Клавиша(Клавиши.Down); // Иначе поиск не сработает
	НайтиСтрокуВОкне(ИмяСвойства);
КонецПроцедуры  

Процедура СократитьКоллекциюИзКоллекции()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь, Ложь, Ложь, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	УстановитьФокусВПервуюТаблицуИлиСписок();
	Если Не КликнутьПоЭлементу("Показать значение в отдельном окне", "кнопка") Тогда
		Возврат;
	КонецЕсли;
	ЖдатьОкноВыражение();
	Фрагменты = СтрРазделить(ТурбоКонф.ПолучитьЗначение(), "[]", Ложь);
	Индекс = Число(Фрагменты[Фрагменты.ВГраница()]);
	ЗакрытьМодальноеОкно();
	ЗакрытьМодальноеОкно();
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	ВыражениеКоллекции = ТурбоКонф.ПолучитьЗначение();
	ТекстВызова = ТекстВызоваФункцииРежимаОтладки(ПолеТекстаПрограммы, "СокрКол");
	УстановитьЗначениеПолюВвода(ТекстВызова + "(" + ВыражениеКоллекции + ", " + XMLСтрока(Индекс) + ")");
	ТекстыЯчеек = ЖдатьВычислениеВыражения();
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	УстановитьЗначениеПолюВвода(ВыражениеКоллекции);
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ТурбоКонф.Клавиша(Клавиши.F2);
	Если Найти(ТекстыЯчеек[1], "Ошибка ") > 0 Тогда
		ПоказатьВсплывающееУведомление(ТекстыЯчеек[1]);
	КонецЕсли;
КонецПроцедуры  

Функция ЖдатьОкноВыражение() Экспорт
	Попытка
		//ТурбоКонф.ЖдатьОкно("Выражение", 1000, Истина,, Истина); // 6.3.9141.36481 https://turboconf.ru/Tasks/9996
	Исключение
	КонецПопытки;
	Если Не ЖдатьПотерюАктивностиОкна(,, Истина) Тогда
		ВызватьИсключение "Не дождались окна ""Выражение""";
	КонецЕсли;
КонецФункции  

Процедура КнопкаНоваяОбычнаяГруппаВертикальная(Знач НомерВариантаГруппы = 1)
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ТурбоКонф.Клавиша(Клавиши.Home);
	НажатьКлавишуЦикл(Клавиши.Down, НомерВариантаГруппы - 1);
	ТурбоКонф.Клавиша(Клавиши.Enter);
	ТурбоКонф.Клавиша(Клавиши.Enter);
	АктивироватьСвойствоВПалитреСвойств("Группировка");
	ТурбоКонф.КонтролКлавиша(Клавиши.Down);
	ТурбоКонф.Клавиша(Клавиши.Up);
	ТурбоКонф.Клавиша(Клавиши.Enter);
КонецПроцедуры 

Процедура КнопкаНоваяОбычнаяГруппаГоризонтальная(Знач НомерВариантаГруппы = 1)
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ТурбоКонф.Клавиша(Клавиши.Home);
	НажатьКлавишуЦикл(Клавиши.Down, НомерВариантаГруппы - 1);
	ТурбоКонф.Клавиша(Клавиши.Enter);
	ТурбоКонф.Клавиша(Клавиши.Enter);
	АктивироватьСвойствоВПалитреСвойств("Группировка");
	ТурбоКонф.КонтролКлавиша(Клавиши.Down);
	ТурбоКонф.Клавиша(Клавиши.Down);
	ТурбоКонф.Клавиша(Клавиши.Enter);
КонецПроцедуры  

Процедура КнопкаУстановитьФорматПолнойДаты()
	УстановитьФокусНаКнопкуСправка();
	ТурбоКонф.Клавиша(Клавиши.Tab);
	ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
	ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
	ТурбоКонф.КонтролКлавиша(Клавиши.PageDown);
	ТурбоКонф.Ждать(20);
	Если Не ТурбоКонф.УстановитьФокусНаЭлемент("Формат даты", "флажок") Тогда
		Возврат;
	КонецЕсли;
	ТурбоКонф.Клавиша(Клавиши.Tab);
	УстановитьЗначениеПолюВвода("dd.MM.yyyy HH:mm:ss");
	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
КонецПроцедуры  

Процедура КнопкаНайтиКартинку()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ИмяКартинки = ТурбоКонф.ПолучитьИмяЭлемента();
	ОповеститьПользователяОПриостановке(ПодключениеИР);
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("Картинки.*", 5000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
	Попытка
		ВыбраннаяКартинка = МодулиИР.ирКлиент.ОткрытьВыборКартинкиЛкс(, ИмяКартинки);
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
	Если ВыбраннаяКартинка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
	ТурбоКонф.КонтролКлавиша(Клавиши.PageUp);
	УстановитьФокусВПервуюТаблицуИлиСписок();
	Если ВыбраннаяКартинка.Встроенная Тогда
		ТурбоКонф.КонтролКлавиша(Клавиши.PageDown);
	КонецЕсли;
	НайтиСтрокуВОкне(ВыбраннаяКартинка.Имя, Истина);
КонецПроцедуры    

Процедура НастроитьОтборПоПодсистемам()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КонтекстИнтерфейса = КонтекстИнтерфейса();
	Если Не КонтекстИнтерфейса.ПоддерживаетПоиск Тогда
		ПоказатьВсплывающееУведомление("В данном контексте не поддерживается, т.к. в нем не работает поиск");
		Возврат;
	КонецЕсли;
	УстановитьФокусВПервуюТаблицуИлиСписок();
	МодулиИР = МодулиИР(ПодключениеИР);
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ОповеститьПользователяОПриостановке(ПодключениеИР);
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("Выбор.*", 5000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
	Попытка
		ВыбранныеПодсистемы = МодулиИР.ирКлиент.ОткрытьВыборПодсистемЛкс();
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
	Если ВыбранныеПодсистемы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УстановитьФокусВПервуюТаблицуИлиСписок();
	// Снимаем все пометки
	ТурбоКонф.Клавиша(Клавиши.Home);
	ТурбоКонф.Клавиша(Клавиши.Space);
	ТурбоКонф.Клавиша(Клавиши.Space);
	// Устанавливаем выбранные пометки
	Для Каждого ПолноеИмяПодсистемы Из СтрРазделить(ВыбранныеПодсистемы, ", ", Ложь) Цикл
		ИмяПодсистемы = ПоследнийФрагментЛкс(ПолноеИмяПодсистемы);
		Если Не НайтиУзелДерева(ПодключениеИР, ИмяПодсистемы) Тогда
			ПоказатьВсплывающееУведомление(СтрШаблон("Подсистема %1 не найдена в окне конфигуратора", ИмяПодсистемы));
		Иначе
			ТурбоКонф.Клавиша(Клавиши.Space);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры       

//&ВосстанавливатьБуферОбмена
Процедура ВыполнитьПроизвольныйКод()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь, Ложь, Ложь, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	ВычисленноеВыражение = ТекстВычисленногоМногострочногоВыражения();
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	КлючПамяти = ПолеТекстаПрограммы.ПолноеИмяМетода() + ";ПроизвольныйКод";
	Если Истина
		И Найти(ВычисленноеВыражение, Символы.ПС) 
		И Найти(ВычисленноеВыражение, ";")
	Тогда
		СтарыйТекст = ВычисленноеВыражение;
	Иначе
		СтарыйТекст = ВосстановитьЗначениеСеансаКонфигуратора(КлючПамяти);
	КонецЕсли;
	ТекстПоля = Новый Массив;
	Если ЗначениеЗаполнено(СтарыйТекст) Тогда
		ТекстПоля.Добавить(СтарыйТекст);
	КонецЕсли;
	ВременноеВыражение = "Новый Структура(""_"")";
	ТекущееВыражение = ТурбоКонф.ПолучитьЗначение();
	Если Истина
		И Найти(СтарыйТекст, ТекущееВыражение) = 0
		И Найти(ТекущееВыражение, "ирОбщий.Оперировать") = 0
		И Найти(ТекущееВыражение, ВременноеВыражение) = 0
		И Найти(ВычисленноеВыражение, Символы.ПС) = 0
	Тогда
		ТекстПоля.Добавить("//" + ТекущееВыражение);
	КонецЕсли;
	ТекстПоля = СтрСоединить(ТекстПоля, Символы.ПС);
	ТурбоКонф.Клавиша(Клавиши.Tab);
	ТекстыЯчеек = ТурбоКонф.ПолучитьЭлементыСписка();
	Если ТекстыЯчеек.Количество() Тогда
		ТекстОшибки = ТекстыЯчеек[1];
		//Сообщить("ТекстОшибки=" + ТекстОшибки);
	КонецЕсли;
	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	УстановитьЗначениеПолюВвода(ВременноеВыражение);
	ЖдатьВычислениеВыражения();
	ТурбоКонф.Клавиша(Клавиши.Add);
	ТурбоКонф.Клавиша(Клавиши.Down);
	ТурбоКонф.Ждать(20);
	ОткрытьОкноУстановкиЗначенияВВидеВыражения();
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	ИдентификаторПроцессаИР = МодулиИР.ирКэш.ИдентификаторПроцессаОСЛкс();
	ТекстУведомления = "Запущен рачет типов переменных"; 
	// Почему то такое уведомление не скрывается
	//Уведомление = ПоказатьВсплывающееУведомление(ТекстУведомления); // Не исчезает до закрытия окна
	//ПолеТекстаПрограммы.РассчитатьТипыПеременных();
	//ТурбоКонф.СкрытьВсплывающееУведомление(Уведомление);
	ТурбоКонф.ПоказатьУведомление(ТекстУведомления, 2000);
	ОповеститьПользователяОПриостановке(ПодключениеИР);
	ТурбоКонф.НачатьВызовВнешнегоОкнаАсинх("^Текст.*", 10000, Окно, РежимОткрытияВнешнегоОкна.Диалог, Истина, ИдентификаторПроцессаИР);
	Попытка
		СтруктураВызова = ПолеТекстаПрограммы.ОткрытьРедакторКодаДляОтладчика(ТекстПоля, ТекстОшибки); // Основное время перед открытием уходит на расчет типов переменных модуля
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	ЗавершитьВызовВнешнегоОкнаАсинх(Окно, ИдентификаторПроцессаИР, ПодключениеИР);
	Если СтруктураВызова = Неопределено Тогда
		ТурбоКонф.Клавиша(Клавиши.Escape);
		Возврат;
	КонецЕсли;
	Если КлючПамяти <> Неопределено Тогда
		СохранитьЗначениеСеансаКонфигуратора(КлючПамяти, СтруктураВызова.Текст);
	КонецЕсли;
	
	// Так не увидим текст ошибки
	//ТурбоКонф.ВставитьТекст("ирОбщий.Оперировать(" + МодулиИР.ирОбщий.ТекстВВыражениеВстроенногоЯзыкаЛкс(СтруктураВызова.Текст) + ", 2, " + """" + СтруктураВызова.ИменаПараметров + """, " + СтруктураВызова.ИменаПараметров + ")");
	//ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
    //
	ИмяХранилища = "КодДляОтладчика";
	ТурбоКонф.ВставитьТекст("ирОбщий.СохранитьЗначениеЛкс(""" + ИмяХранилища + """, " + МодулиИР.ирОбщий.ТекстВВыражениеВстроенногоЯзыкаЛкс(СтруктураВызова.Текст) + ")");
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
	ЗакрытьМодальноеОкно();
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	УстановитьЗначениеПолюВвода("ирОбщий.Оперировать(ирОбщий.ВосстановитьЗначениеЛкс(""" + ИмяХранилища + """), 2, " + """" + СтруктураВызова.ИменаПараметров + """, " + СтруктураВызова.ИменаПараметров + ")");
	УстановитьФокусВПервуюТаблицуИлиСписок();
КонецПроцедуры

Процедура ОткрытьОкноУстановкиЗначенияВВидеВыражения() Экспорт
	КликнутьПоЭлементу("Установить новое значение в виде выражения", "кнопка");
	ТурбоКонф.ЖдатьОкно("Ввод выражения", 1000, Истина);
	ТурбоКонф.Ждать(20);
КонецПроцедуры

//&ВосстанавливатьБуферОбмена
Процедура ПрерватьОтлаживаемыйКод()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст, Ложь, Ложь, Ложь, Истина);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодулиИР = МодулиИР(ПодключениеИР);
	УстановитьФиктивноеВыражениеДляУстановкиЗначения();
	ОкноВыражения = ТурбоКонф.ПолучитьАктивноеОкно();
	СтруктураВызова = ПолеТекстаПрограммы.КодОчисткиПеременныхДляОтладчика();

	// Так не увидим текст ошибки, но тут она не интересна и не упремся в длину поля ввода
	ТурбоКонф.ВставитьТекст("ирОбщий.Оперировать(" + МодулиИР.ирОбщий.ТекстВВыражениеВстроенногоЯзыкаЛкс(СтруктураВызова.Текст) + ", 2, 
	|" + """" + СтруктураВызова.ИменаПараметров + """, 
	|" + СтруктураВызова.ИменаПараметров + ")");
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter);
	ТурбоКонф.Ждать(50);
	ЗакрытьМодальноеОкно();
	ЗакрытьМодальноеОкно();
	//ПоказатьВсплывающееУведомление("Очищены все локальные переменные");
	ТурбоКонф.ШифтКлавиша(Клавиши.F11);
КонецПроцедуры

//&ВосстанавливатьБуферОбмена
Процедура ВставитьУсловиеИзТабло()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗакрытьМодальноеОкно();
	ТурбоКонф.КонтролАльтКлавиша(Клавиши.W);
	ТурбоКонф.КопироватьТекстВБуфер();
	ТекстУсловия = СобратьУсловиеИзЗначенийВыраженийВБуфереОбмена();
	ВернутьсяВПредыдущееМестоКонфигуратора();
	ДобавитьУсловиеОстанова(ТекстУсловия);
КонецПроцедуры 

Процедура КнопкаПерейтиИзНавигатора()
КонецПроцедуры 

Функция СобратьУсловиеИзЗначенийВыраженийВБуфереОбмена(Знач БазовыйПуть = "") Экспорт
	ТекстыЯчеек = СтрРазделить(ТурбоКонф.ПолучитьБуферОбмена(), Символы.Таб + Символы.ПС + Символы.ВК);
	ЭлементыУсловия = Новый Массив;
	ЧислоКолонокВСтроке = 4;
	Для НомерСтрокиТекста = 1 По Макс(1, ТекстыЯчеек.Количество() / ЧислоКолонокВСтроке) Цикл
		ИндексПервойЯчейки = (НомерСтрокиТекста-1)*ЧислоКолонокВСтроке;
		ТипЗначения = ТекстыЯчеек[ИндексПервойЯчейки + 2];
		Если ПустаяСтрока(ТипЗначения) Тогда
			Продолжить;
		КонецЕсли;
		ТекстВыражения = БазовыйПуть + ТекстыЯчеек[ИндексПервойЯчейки + 0];
		ЗначениеВыражения = ТекстыЯчеек[ИндексПервойЯчейки + 1];
		Если Ложь
			Или ТипЗначения = "Строка" 
			Или ТипЗначения = "Булево"
		Тогда
			ЭлементУсловия = ТекстВыражения + "=" + ЗначениеВыражения;
		ИначеЕсли Ложь
			Или ТипЗначения = "Null"
			Или ТипЗначения = "Неопределено"
		Тогда
			ЭлементУсловия = ТекстВыражения + "=" + ТипЗначения;
		ИначеЕсли ТипЗначения = "Число" Тогда
			ЭлементУсловия = ТекстВыражения + "=" + СтрЗаменить(ЗначениеВыражения, Символы.НПП, "");
		Иначе
			ЭлементУсловия = """""+" + ТекстВыражения + "=""" + ЗначениеВыражения + """";
		КонецЕсли;
		Сообщить("ЭлементУсловия="+ЭлементУсловия);
		ЭлементыУсловия.Добавить(ЭлементУсловия);
	КонецЦикла;
	ТекстУсловия = СтрСоединить(ЭлементыУсловия, Символы.ПС + "И ");
	Возврат ТекстУсловия;
КонецФункции 

//&ВосстанавливатьБуферОбмена
Процедура ВставитьОшибкуИзБуфера()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ПричиныОшибок = Новый Массив;
	ТекстОшибки1 = ТурбоКонф.ПолучитьБуферОбмена();
	МодулиИР = МодулиИР(ПодключениеИР);
	ПричинаОшибки1 = СокрЛП(МодулиИР.ирОбщий.ПервыйФрагментЛкс(ТекстОшибки1, "{", Ложь));
	Если ЗначениеЗаполнено(ПричинаОшибки1) Тогда
		ПричиныОшибок.Добавить(ПричинаОшибки1);
	КонецЕсли;
	ЗакрытьМодальноеОкно(, Клавиши.Enter, Истина);
	//СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ТурбоКонф.КонтролАльтКлавиша(Клавиши.O);
	//ЖдатьСменуТекущегоЭлемента(СтарыйИД);
	ТурбоКонф.Ждать(20);
	ТекстОшибки2 = ТурбоКонф.ПолучитьТекстТекущегоЭлемента();
	ПричинаОшибки2 = СокрЛП(МодулиИР.ирОбщий.ПервыйФрагментЛкс(ТекстОшибки2, "{", Ложь));
	Если ЗначениеЗаполнено(ПричинаОшибки2) Тогда
		ПричиныОшибок.Добавить(ПоследнийФрагментЛкс(ПричинаОшибки2, Символы.ПС));
	КонецЕсли;
	ТурбоКонф.ОткрытьМеню("Отладка", "Остановка по ошибке...");
	Если ПричиныОшибок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ТурбоКонф.УстановитьФокусНаЭлемент("Останавливаться по ошибке", "флажок");
	Если Не ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Истина);
	КонецЕсли;
	ТурбоКонф.УстановитьФокусНаЭлемент("Останавливаться только на ошибках, включающих текст", "флажок");
	Если Не ТурбоКонф.ПолучитьСостояниеФлажка() Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Истина);
	КонецЕсли;
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ТекстыЯчеек = ТурбоКонф.ПолучитьЭлементыСписка();
	ЧислоКолонок = 2;
	ЗаголовокКолонки = "Текст в сообщении об ошибке";
	Для Каждого Причина Из ПричиныОшибок Цикл
		//НайтиСтрокуВОкне(Причина); // Тут не работает поиск
		ИндексЯчейки = ТекстыЯчеек.Найти(Причина + " " + ЗаголовокКолонки);
		Если ИндексЯчейки <> Неопределено Тогда
			ТурбоКонф.Клавиша(Клавиши.Home);
			НажатьКлавишуЦикл(Клавиши.Down, ИндексЯчейки / ЧислоКолонок);
			ТурбоКонф.Клавиша(Клавиши.Delete);
		КонецЕсли;
		КликнутьПоЭлементу("Добавить", "кнопка");
		УстановитьЗначениеПолюВвода(Причина);
	КонецЦикла;
КонецПроцедуры 

//&ВосстанавливатьБуферОбмена
Процедура КнопкаУсловиеОстанова()
	//ПодключениеИР = ПодключениеИР();
	//Если ПодключениеИР = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ТурбоКонф.КопироватьТекстВБуфер();
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	ПутьКСвойству = СтрокаБезПоследнегоФрагментаЛкс(ТурбоКонф.ПолучитьЗначение());
	Если Найти(ПутьКСвойству, ".") Тогда
		ПутьКСвойству = "";
	ИначеЕсли ЗначениеЗаполнено(ПутьКСвойству) Тогда
		ПутьКСвойству = ПутьКСвойству + ".";
	КонецЕсли;
	ТекстУсловия = СобратьУсловиеИзЗначенийВыраженийВБуфереОбмена(ПутьКСвойству);
	ЗакрытьМодальноеОкно();
	ДобавитьУсловиеОстанова(ТекстУсловия);
КонецПроцедуры 

Процедура ВычислитьСвойствоРодителяИзВыражения()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтруктураВыражения = СтруктураВыраженияОкнаВыражение(Истина);
	Если ПустаяСтрока(СтруктураВыражения.Родитель) Тогда
		Возврат;
	КонецЕсли;    
	УстановитьРодителяИСвойствоВОкнеВыражение(СтруктураВыражения);
КонецПроцедуры     

//.
// Возвращаемое значение:
//   Структура - 
Функция СтруктураВыраженияОкнаВыражение(Знач ПерейтиНаУровеньВышеЕслиРаскрытОдинРодитель = Ложь) Экспорт
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	Выражение = ТурбоКонф.ПолучитьЗначение();
	УстановитьФокусВПервуюТаблицуИлиСписок();
	Родитель = СтрокаБезПоследнегоФрагментаЛкс(Выражение);
	Свойство = ПоследнийФрагментЛкс(Выражение);
	Если ПерейтиНаУровеньВышеЕслиРаскрытОдинРодитель Тогда
		ЯчейкиТекущейСтроки = ЯчейкиТекущейСтроки(3);
		Если ЯчейкиТекущейСтроки.Количество() Тогда
			КликнутьПоЭлементу(ЯчейкиТекущейСтроки[0], ТурбоКонф.ПолучитьНазваниеТипаТекущегоЭлемента());
			РазвернутьДеревоИПерейтиВНачало();
			ТекстКорневойЯчейки = ТурбоКонф.ПолучитьИмяЭлемента();
			Если Истина
				И Найти(Родитель, ".")
				И ТекстКорневойЯчейки = Родитель + " Свойство" 
			Тогда
				Выражение = Родитель;
				Родитель = СтрокаБезПоследнегоФрагментаЛкс(Выражение);
				Свойство = ПоследнийФрагментЛкс(Выражение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Свойство = СтрРазделить(Свойство, "[]")[0];
	Результат = Новый Структура;
	Результат.Вставить("Выражение", Выражение);
	Результат.Вставить("Родитель", Родитель);
	Результат.Вставить("Свойство", Свойство);
	Сообщить("Выражение="+Выражение);
	Сообщить("Родитель="+Родитель);
	Возврат Результат;
КонецФункции     

Процедура ПодробноОкнаВыражение()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыБезКонтекста(ПодключениеИР);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтруктураВыражения = СтруктураВыраженияОкнаВыражение();
	Если Найти(СтруктураВыражения.Свойство, "(") > 0 Тогда
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(СтруктураВыражения.Родитель) Тогда
		СтруктураВыражения.Родитель = СтруктураВыражения.Выражение;
	КонецЕсли;
	Модули = МодулиИР(ПодключениеИР);
	ТекстВызова = ТекстВызоваФункцииРежимаОтладки(ПолеТекстаПрограммы, "Стк");
	Если СтрНачинаетсяС(СтруктураВыражения.Родитель, ТекстВызова) Тогда
		СтруктураВыражения.Родитель = СтрЗаменить(СтруктураВыражения.Родитель, ТекстВызова + "(", "");
		СтруктураВыражения.Родитель = СтрЗаменить(СтруктураВыражения.Родитель, ")", ""); // Опасно
	КонецЕсли;
	Выражение = ТекстВызова + "(" + СтруктураВыражения.Родитель + ")";
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	УстановитьЗначениеПолюВвода(Выражение);
	ЖдатьВычислениеВыражения();
	Если Не НайтиСтрокуВОкне(СтруктураВыражения.Свойство, Истина) Тогда
		ПоказатьВсплывающееУведомление("Тип объекта не поддерживается");
		УстановитьРодителяИСвойствоВОкнеВыражение(СтруктураВыражения);
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьРодителяИСвойствоВОкнеВыражение(Знач СтруктураВыражения) Экспорт
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	Если ЗначениеЗаполнено(СтруктураВыражения.Родитель) Тогда
		УстановитьЗначениеПолюВвода(СтруктураВыражения.Родитель);
	Иначе
		УстановитьЗначениеПолюВвода(СтруктураВыражения.Выражение);
	КонецЕсли;
	ЖдатьВычислениеВыражения();
	НайтиСтрокуВОкне(СтруктураВыражения.Свойство, Истина);
КонецПроцедуры

Процедура СравнитьОбъектыИзВыражения()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыБезКонтекста(ПодключениеИР);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтруктураВыражения = СтруктураВыраженияОкнаВыражение();
	ЯчейкиТекущейСтроки = ЯчейкиТекущейСтроки(3);
	Если ЯчейкиТекущейСтроки.Количество() Тогда
		Если ЯчейкиТекущейСтроки[2] = "Строка Тип" Тогда
			ЗапомнитьТекстДляСравнения(ПодключениеИР, ПолеТекстаПрограммы, ЯчейкиТекущейСтроки[1]);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Модули = МодулиИР(ПодключениеИР);
	ТекстВызова = ТекстВызоваФункцииРежимаОтладки(ПолеТекстаПрограммы, "ЗапомнитьДляСравненияЛкс");
	Выражение = ТекстВызова + "(" + СтруктураВыражения.Выражение + ", " + Модули.ирОбщий.ТекстВВыражениеВстроенногоЯзыкаЛкс(СтруктураВыражения.Выражение);
	//УказательОбъектаДляСравнения = ВосстановитьЗначениеСеансаКонфигуратора("УказательОбъектаДляСравнения");
	//СохранитьЗначениеСеансаКонфигуратора("УказательОбъектаДляСравнения", Неопределено);
	//Если УказательОбъектаДляСравнения <> Неопределено Тогда
	//	Выражение = Выражение + ", " + УказательОбъектаДляСравнения;
	//КонецЕсли;
	Выражение = Выражение + ")";
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	УстановитьЗначениеПолюВвода(Выражение);
	ТекстыЯчеек = ЖдатьВычислениеВыражения();
	Если ТекстыЯчеек[2] = "ТаблицаЗначений" Тогда
		ТурбоКонф.Клавиша(Клавиши.F2);
	ИначеЕсли ТекстыЯчеек[2] = "Строка" Тогда
		Текст = Модули.ирОбщий.ТекстИзВстроенногоЯзыкаЛкс(ТекстыЯчеек[1]);
		ПоказатьВсплывающееУведомление(Текст);
		УстановитьРодителяИСвойствоВОкнеВыражение(СтруктураВыражения);
	Иначе
		// Ошибка
		//ПоказатьВсплывающееУведомление(СтрШаблон("Запомненный ранее объект (%1) не доступен в текущем контексте", УказательОбъектаДляСравнения));
		//УстановитьРодителяИСвойствоВОкнеВыражение(СтруктураВыражения);
	КонецЕсли;
КонецПроцедуры 

Процедура СериализоватьИзВыражения()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеТекстаПрограммы = ПолеТекстаПрограммыБезКонтекста(ПодключениеИР);
	Если ПолеТекстаПрограммы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтруктураВыражения = СтруктураВыраженияОкнаВыражение();
	Модули = МодулиИР(ПодключениеИР);
	ТекстВызова = ТекстВызоваФункцииРежимаОтладки(ПолеТекстаПрограммы, "ОбъектВСтрокуXMLЛкс");
	Выражение = ТекстВызова + "(" + СтруктураВыражения.Выражение + ")";
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	УстановитьЗначениеПолюВвода(Выражение);
	ТекстыЯчеек = ЖдатьВычислениеВыражения();
	Если ТекстыЯчеек[2] = "Строка" Тогда
		Текст = Модули.ирОбщий.ТекстИзВстроенногоЯзыкаЛкс(ТекстыЯчеек[1]);
		УстановитьРодителяИСвойствоВОкнеВыражение(СтруктураВыражения);
		ОткрытьРедакторТекста(Текст,, "XML");
	Иначе
		УстановитьРодителяИСвойствоВОкнеВыражение(СтруктураВыражения);
		ПоказатьВсплывающееУведомление("Ошибка сериализации значения");
	КонецЕсли;
КонецПроцедуры     

Процедура ВключитьВТаблоИзВыражения()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОчередьТабло = ВосстановитьЗначениеСеансаКонфигуратора("ОчередьТабло");
	Если ОчередьТабло = Неопределено Тогда
		ОчередьТабло = Новый СписокЗначений;
	КонецЕсли;
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	Выражение = ТурбоКонф.ПолучитьЗначение();
	ДобавитьВыражениеВОчередьТабло(Выражение);
КонецПроцедуры 

Процедура ВключитьВТаблоИзКоллекции()
	ПодключениеИР = ПодключениеИР();
	Если ПодключениеИР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УстановитьФокусВПервуюТаблицуИлиСписок();
	ИмяСвойства = ПоследнийФрагментЛкс(ТурбоКонф.ПолучитьИмяЭлемента(), " ");
	ТурбоКонф.Клавиша(Клавиши.F2);
	ЖдатьОкноВыражение();
	УстановитьФокусВПолеВводаВыраженияОкнаВыражение();
	Выражение = ТурбоКонф.ПолучитьЗначение() + "." + ИмяСвойства;
	ЗакрытьМодальноеОкно();
	ДобавитьВыражениеВОчередьТабло(Выражение);
КонецПроцедуры    

Процедура ДобавитьВыражениеВОчередьТабло(Знач Выражение) Экспорт
	ОчередьТабло = ВосстановитьЗначениеСеансаКонфигуратора("ОчередьТабло");
	Если ОчередьТабло = Неопределено Тогда
		ОчередьТабло = Новый СписокЗначений;
	КонецЕсли;
	Если ОчередьТабло.НайтиПоЗначению(Выражение) = Неопределено Тогда
		ОчередьТабло.Добавить(Выражение);
		СохранитьЗначениеСеансаКонфигуратора("ОчередьТабло", ОчередьТабло);
	КонецЕсли;
	ПоказатьВсплывающееУведомление("Добавлено в очередь табло:
			|" + Выражение);
	ЗапуститьМоноФоновоеЗадание("ДобавитьОчередьВТаблоФоновый");
КонецПроцедуры    

Процедура ЗапуститьМоноФоновоеЗадание(ИмяМетода, Знач МаксДлительностьФоновогоМетода = Неопределено)
	Если Не ЗначениеЗаполнено(МаксДлительностьФоновогоМетода) Тогда
		МаксДлительностьФоновогоМетода = МаксДлительностьФоновогоМетода();
	КонецЕсли;
	КлючСостоянияФоновогоМетода = КлючСостоянияФоновогоМетода(ИмяМетода);
	ДатаЗапуска = ВосстановитьЗначениеСеансаКонфигуратора(КлючСостоянияФоновогоМетода);
	Если Истина
		И ДатаЗапуска <> Неопределено
		И ТекущаяДата() - ДатаЗапуска < МаксДлительностьФоновогоМетода
	Тогда
		Возврат;
	КонецЕсли;
	// Бесполезная проверка, т.к. предыдущие запуски в другом процессе сидят и тут мы их не увидим
	//ВыбранныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода, Состояние", ИмяМетода, СостояниеФоновогоЗадания.Активно));
	//Если ВыбранныеЗадания.Количество() > 0 Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	ФоновыеЗадания.Выполнить(ЭтотОбъект, ИмяМетода);
	СохранитьЗначениеСеансаКонфигуратора(КлючСостоянияФоновогоМетода, ТекущаяДата());
КонецПроцедуры

Функция КлючСостоянияФоновогоМетода(ИмяМетода) Экспорт
	Возврат "ДатаЗапускаФоновогоМетода." + ИмяМетода;
КонецФункции    

Функция МаксДлительностьФоновогоМетода() Экспорт
	Возврат 600;
КонецФункции    

Функция ПоказатьВсплывающееУведомление(Текст, ЧислоМиллисекунд = 4000)
	Возврат ТурбоКонф.ПоказатьВсплывающееУведомление(НазваниеСкрипта(), Текст, ЧислоМиллисекунд);
КонецФункции

Процедура ДобавитьОчередьВТаблоФоновый() Экспорт
	КлючСостоянияФоновогоМетода = КлючСостоянияФоновогоМетода("ДобавитьОчередьВТаблоФоновый");
	Попытка
		Успех = Истина;
		МоментНачала = ТекущаяДата();
		Пока Истина Цикл
			Если Ложь
				Или Конфигуратор = Неопределено
				Или ТекущаяДата() - МоментНачала > МаксДлительностьФоновогоМетода() 
			Тогда
				Успех = Ложь;
				Прервать;
			КонецЕсли;
			Если ТурбоКонф.ПолучитьАктивноеОкно() = Конфигуратор.ГлавноеОкно Тогда
				Прервать;
			КонецЕсли;
			ТурбоКонф.Ждать(1000);
		КонецЦикла;
		ОчередьТабло = ВосстановитьЗначениеСеансаКонфигуратора("ОчередьТабло"); // СписокЗначений
		ПредставлениеСписка = СтрСоединить(ОчередьТабло.ВыгрузитьЗначения(), Символы.ПС);
		Если Не Успех Тогда
			ПоказатьВсплывающееУведомление("Не дождались освобождения главного окна конфигуратора. Очередь табло очищена:
			|" + ПредставлениеСписка);
		Иначе
			ТурбоКонф.КонтролАльтКлавиша(Клавиши.W);
			ТурбоКонф.Клавиша(Клавиши.End);
			//НажатьКлавишуЦикл(Клавиши.Left, 2); // Тут не работает смена активной колонки
			Если Не КликнутьПоЭлементу(" Выражение", "неизвестный") Тогда
				ПоказатьВсплывающееУведомление("Не удалось добавить очередь в табло. Очередь табло очищена:
				|" + ПредставлениеСписка);
			Иначе
				Для Каждого ОчередьЭлемент Из ОчередьТабло Цикл
					ТурбоКонф.Клавиша(Клавиши.Down);
					СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
					ТурбоКонф.Клавиша(Клавиши.Enter);
					ЖдатьСменуТекущегоЭлемента(СтарыйИД);
					УстановитьЗначениеПолюВвода(ОчередьЭлемент.Значение);
				КонецЦикла;
				ПоказатьВсплывающееУведомление("В табло добавлены выражения из очереди:
						|" + ПредставлениеСписка);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	СохранитьЗначениеСеансаКонфигуратора("ОчередьТабло", Неопределено);
	СохранитьЗначениеСеансаКонфигуратора(КлючСостоянияФоновогоМетода, Неопределено);
КонецПроцедуры

Процедура СледитьЗаТекущимМетодомФоновый() Экспорт
	КлючСостоянияФоновогоМетода = КлючСостоянияФоновогоМетода("СледитьЗаТекущимМетодомФоновый");
	ДатаАктивностиОкнаСпискаМетодов = Дата(1,1,1);
	Попытка
		Пока Конфигуратор <> Неопределено Цикл
			ПодключениеИР = ПодключениеИРИзКэша();
			Если ПодключениеИР = Неопределено Тогда
				Прервать;
			КонецЕсли; 
			ЗаголовокОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
			Если Ложь
				Или ЗаголовокОкна = "JumpToForm" 
				Или ЗаголовокОкна = "Процедуры и функции"
				Или ЗаголовокОкна = "Закладки"
			Тогда
				ДатаАктивностиОкнаСпискаМетодов = ТекущаяДата();
			КонецЕсли;
			Если Истина
				И ТурбоКонф.ПолучитьАктивноеОкно() = Конфигуратор.ГлавноеОкно 
				И ПолучитьТипТекущегоЭлемента() = ТипЭлемента.Документ
			Тогда
				Если ТекущаяДата() - ДатаАктивностиОкнаСпискаМетодов < 5 Тогда
					ЗапомнитьМетод(Ложь);
				Иначе
					// ТекущийДокумент.Позиция слишком редко обновляется, поэтому бесполезная функция
					//ТекущийДокумент = ТурбоКонф.ИдентифицироватьТекущийДокумент();
					//Если Истина
					//	И ТекущийДокумент <> Неопределено
					//	И ЗначениеЗаполнено(ТекущийДокумент.Позиция)
					//Тогда
					//	ПолеТекстаПрограммыИР(ПодключениеИР, Неопределено, ТекущийДокумент.Позиция,, Ложь, Ложь);
					//КонецЕсли;
				КонецЕсли;
				ДатаАктивностиОкнаСпискаМетодов = Дата(1,1,1);
			КонецЕсли;
			ТурбоКонф.Ждать(2000);
		КонецЦикла;
	Исключение
		ПоказатьВсплывающееУведомление(ОписаниеОшибки());
	КонецПопытки;
	СохранитьЗначениеСеансаКонфигуратора(КлючСостоянияФоновогоМетода, Неопределено);
КонецПроцедуры

//.
// Параметры:
//   ВызыватьИсключение -  - 
//   КлавишаЗакрытия - ПеречислениеСсылка.Клавиши - по умолчанию Escape
Процедура ЗакрытьМодальноеОкно(Знач ВызыватьИсключение = Истина, Знач КлавишаЗакрытия = Неопределено, Знач ЗажатьКонтрол = Ложь, Знач ЧислоМиллисекунд = 1000) Экспорт
	Если КлавишаЗакрытия = Неопределено Тогда
		КлавишаЗакрытия = Клавиши.Escape;
	КонецЕсли;
	Окно = ТурбоКонф.ПолучитьАктивноеОкно();
	Если ЗажатьКонтрол Тогда
		ТурбоКонф.КонтролКлавиша(КлавишаЗакрытия);
	Иначе
		ТурбоКонф.Клавиша(КлавишаЗакрытия);
	КонецЕсли;
	ТурбоКонф.ЖдатьЗакрытияОкна(Окно,, ЧислоМиллисекунд,, ВызыватьИсключение); 
КонецПроцедуры

// Закрыть дочернее (немодальное) окно конфигуратора. В понимании Турбоконфа оно не является окном.
Процедура ЗакрытьДочернееОкноКонфигуратора() Экспорт
	//СтарыйИД = ИдентификаторТекущегоЭлементаОкна();
	ТурбоКонф.ШифтКлавиша(Клавиши.Escape);
	//ЖдатьСменуТекущегоЭлемента(СтарыйИД); // Иногда ИД не меняется
КонецПроцедуры   

//.
// Параметры:
//   СтарыйИД - Строка - идентификатор текущего элемента, полученный методом см. ПолучитьRuntimeIdСтрокой
Процедура ЖдатьСменуТекущегоЭлемента(Знач СтарыйИД, Знач ЧислоМиллисекунд = 2000) Экспорт
	Попытка
		ТурбоКонф.ЖдатьСменуТекущегоЭлемента(СтарыйИД, ЧислоМиллисекунд, Ложь);
	Исключение
		// Иногда возникает непонятная ошибка https://turboconf.ru/Tasks/9760 
		ТурбоКонф.Ждать(100);
	КонецПопытки;
КонецПроцедуры   

Функция УстановитьФокусВПервуюТаблицуИлиСписок(Знач ПерейтиВНачало = Ложь) Экспорт
	Результат = ТурбоКонф.УстановитьФокусНаЭлемент("", "таблицу");
	Если Не Результат Тогда
		Результат = ТурбоКонф.УстановитьФокусНаЭлемент("", "список");
	КонецЕсли; 
	Если ПерейтиВНачало Тогда
		ТурбоКонф.КонтролКлавиша(Клавиши.Home);
	КонецЕсли;
	Возврат Результат;
КонецФункции

//.
// Параметры:
//   ТекстУсловия - Строка - 
Процедура ДобавитьУсловиеОстанова(Знач ТекстУсловия) Экспорт
	ТурбоКонф.КонтролКлавиша(Клавиши.F9);
	ТурбоКонф.ЖдатьОкно("Параметры точки останова", 1000, Истина);
	СтарыйТекст = АктивироватьУсловиеВОкнеПараметрыТочкиОстанова();
	Если ЗначениеЗаполнено(СтарыйТекст) Тогда
		ТурбоКонф.КонтролКлавиша(Клавиши.End);
		ТекстУсловия = Символы.ПС + "И " + ТекстУсловия;
	КонецЕсли;
	ТурбоКонф.ВставитьТекст(ТекстУсловия);
	ТурбоКонф.Клавиша(Клавиши.Home);
КонецПроцедуры

Процедура УстановитьФокусВПолеВводаВыраженияОкнаВыражение() Экспорт
	ТурбоКонф.УстановитьФокусНаЭлемент("Рассчитать", "кнопка");
	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	ТурбоКонф.ШифтКлавиша(Клавиши.Tab);
	ТурбоКонф.Ждать(20); // - Для дальнейшего вызова ТурбоКонф.ПолучитьЗначение()
КонецПроцедуры

Процедура НажатиеCtrlENTER() Экспорт
	ЗаголовокТекущегоОкна = ТурбоКонф.ПолучитьЗаголовокТекущегоОкна();
	ТипТекущегоЭлемента = ТурбоКонф.ПолучитьТипТекущегоЭлемента();
	Если Истина
		И ЗаголовокТекущегоОкна = "Редактирование типа данных" 
		И ТипТекущегоЭлемента = ТипЭлемента.ЭлементСписка
	Тогда
		ТурбоКонф.УстановитьСостояниеФлажка(Истина);
	КонецЕсли;
	ТурбоКонф.КонтролКлавиша(Клавиши.Enter); 
КонецПроцедуры

//&ТолькоТекстовыеДокументы
Процедура НажатиеEscape() Экспорт
	ПодключениеИР = ПодключениеИРИзКэша();
	Если ПодключениеИР <> Неопределено Тогда
		ПолеТекстаПрограммы = ПолеТекстаПрограммыИзКэша();
		Если ПолеТекстаПрограммы <> Неопределено Тогда
			ФормаВызовМетода = ПолеТекстаПрограммы.ФормаВызовМетода();
			Если ФормаВызовМетода.Открыта() Тогда
				ФормаВызовМетода.Автообновление = Ложь;
				ФормаВызовМетода.Закрыть();
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Побочный эффект https://turboconf.ru/Tasks/10059 
	//ПродолжитьОбработкуНажатияКлавиш();
	ТурбоКонф.Клавиша(Клавиши.Escape); 
КонецПроцедуры

Процедура _ОбновитьПодсказкуПоВызовуМетодаСКонтролемЧастоты() Экспорт
	КлючКэшаЧастота = "ПоследнееОбновлениеПодсказкиВызоваМетода";
	ПоследнийМомент = ВосстановитьЗначениеСеансаКонфигуратора(КлючКэшаЧастота);
	Если Истина
		И ПоследнийМомент <> Неопределено
		И ТекущаяУниверсальнаяДатаВМиллисекундах() - ПоследнийМомент < 200
	Тогда
		Возврат;
	КонецЕсли;
	_ОбновитьПодсказкуПоВызовуМетода();
	СохранитьЗначениеСеансаКонфигуратора(КлючКэшаЧастота, ТекущаяУниверсальнаяДатаВМиллисекундах());
КонецПроцедуры

Функция _ОбновитьПодсказкуПоВызовуМетода() Экспорт
	ПодключениеИР = ПодключениеИРИзКэша();
	Если ПодключениеИР <> Неопределено Тогда
		ПолеТекстаПрограммы = ПолеТекстаПрограммыИзКэша();
		Если ПолеТекстаПрограммы <> Неопределено Тогда
			ФормаВызовМетода = ПолеТекстаПрограммы.ФормаВызовМетода();
			Если ФормаВызовМетода.Открыта() Тогда
				РазобратьПозициюВТексте(Ложь);
				ПолеТекстаПрограммыИР(ПодключениеИР, ТекстМодуля, ПозицияВТексте, ВыделенныйТекст,, Истина);
				//ФормаВызовМетода.ОбновитьПодсказкуПоВызовуМетода(); // Нужно дорабатывать флаг Автообновление
				ФормаВызовМетода.ОбновитьИлиЗакрытьФорму(Ложь, Истина); // полезный только 2й параметр
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Процедура Тест()  
	//ТурбоКонф.Перейти("Документ.Распоряжение");
	//ТурбоКонф.Перейти("НастройкиДинамическогоСпискаTormozit ОбщаяФорма.НастройкиДинамическогоСписка");
	//ПоказатьВсплывающееУведомление(ТипЗнч(ТурбоКонф.ИдентифицироватьТекущийДокумент()));
КонецПроцедуры

ТурбоКонф = Новый ("ТурбоКонф");
// Служебная секция. Для контекстной подсказки
#Если Сервер И Не Сервер Тогда
	ТурбоКонф = Обработки.ТурбоКонф.Создать();
#КонецЕсли

// настройки
ПапкаПортативногоИР = ""; // Сюда можно вручную прописать путь, если нужен портативный вариант ИР из конкретной папки. По умолчанию он ищется в папке ".\user_scripts\ИР"

МинимальнаяВерсияИР = "7.71"; 
МинимальнаяВерсияТурбоКонф = "5.18.8668.31421";
ВерсияАдаптера = "2.05";
